[NoCoverage] StringLiteral
src/aec-schema.js:32:8
 `.trim();
 
 export const RESPONSE_SCHEMA = {
-	type: "object",
+	type: "",
 	properties: {
 		image: {

[NoCoverage] BooleanLiteral
src/aec-schema.js:37:40
 		image: {
 			type: "object",
 			properties: {
-				width: { type: "number", nullable: true },
+				width: { type: "number", nullable: false },
 				height: { type: "number", nullable: true },
 				fileName: { type: "string", nullable: true },

[NoCoverage] BooleanLiteral
src/aec-schema.js:38:41
 			type: "object",
 			properties: {
 				width: { type: "number", nullable: true },
-				height: { type: "number", nullable: true },
+				height: { type: "number", nullable: false },
 				fileName: { type: "string", nullable: true },
 				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: true, description: "Always normalized_0_1000" }

[NoCoverage] ObjectLiteral
src/aec-schema.js:38:13
 			type: "object",
 			properties: {
 				width: { type: "number", nullable: true },
-				height: { type: "number", nullable: true },
+				height: {},
 				fileName: { type: "string", nullable: true },
 				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: true, description: "Always normalized_0_1000" }

[NoCoverage] BooleanLiteral
src/aec-schema.js:39:43
 			properties: {
 				width: { type: "number", nullable: true },
 				height: { type: "number", nullable: true },
-				fileName: { type: "string", nullable: true },
+				fileName: { type: "string", nullable: false },
 				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: true, description: "Always normalized_0_1000" }
 			},

[NoCoverage] BooleanLiteral
src/aec-schema.js:40:75
 				width: { type: "number", nullable: true },
 				height: { type: "number", nullable: true },
 				fileName: { type: "string", nullable: true },
-				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: true, description: "Always normalized_0_1000" }
+				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: false, description: "Always normalized_0_1000" }
 			},
 			nullable: true

[NoCoverage] BooleanLiteral
src/aec-schema.js:42:14
 				fileName: { type: "string", nullable: true },
 				coordSystem: { type: "string", enum: ["normalized_0_1000"], nullable: true, description: "Always normalized_0_1000" }
 			},
-			nullable: true
+			nullable: false
 		},
 		detections: {

[NoCoverage] ObjectLiteral
src/aec-schema.js:49:10
 			items: {
 				type: "object",
 				properties: {
-					id: { type: "string" },
+					id: {},
 					label: { type: "string" },
 					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },

[NoCoverage] StringLiteral
src/aec-schema.js:49:18
 			items: {
 				type: "object",
 				properties: {
-					id: { type: "string" },
+					id: { type: "" },
 					label: { type: "string" },
 					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },

[NoCoverage] StringLiteral
src/aec-schema.js:51:93
 				properties: {
 					id: { type: "string" },
 					label: { type: "string" },
-					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },
+					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress",""] },
 					confidence: { type: "number" },
 					bbox: {

[NoCoverage] StringLiteral
src/aec-schema.js:51:82
 				properties: {
 					id: { type: "string" },
 					label: { type: "string" },
-					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },
+					category: { type: "string", enum: ["object","facility_asset","safety_issue","","other"] },
 					confidence: { type: "number" },
 					bbox: {

[NoCoverage] StringLiteral
src/aec-schema.js:52:26
 					id: { type: "string" },
 					label: { type: "string" },
 					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },
-					confidence: { type: "number" },
+					confidence: { type: "" },
 					bbox: {
 						type: "array",

[NoCoverage] StringLiteral
src/aec-schema.js:54:13
 					category: { type: "string", enum: ["object","facility_asset","safety_issue","progress","other"] },
 					confidence: { type: "number" },
 					bbox: {
-						type: "array",
+						type: "",
 						items: { type: "number" },
 						minItems: 4,

[NoCoverage] BooleanLiteral
src/aec-schema.js:59:17
 						minItems: 4,
 						maxItems: 4,
 						description: "[ymin, xmin, ymax, xmax] normalized 0-1000",
-						nullable: true
+						nullable: false
 					},
 					polygon: {

[NoCoverage] ObjectLiteral
src/aec-schema.js:61:15
 						description: "[ymin, xmin, ymax, xmax] normalized 0-1000",
 						nullable: true
 					},
-					polygon: {
-						type: "array",
-						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x","y"] },
-						description: "Array of {x,y} points, each normalized 0-1000",
-						nullable: true
-					},
+					polygon: {},
 					safety: {
 						type: "object",

[NoCoverage] StringLiteral
src/aec-schema.js:63:98
 					},
 					polygon: {
 						type: "array",
-						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x","y"] },
+						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x",""] },
 						description: "Array of {x,y} points, each normalized 0-1000",
 						nullable: true

[NoCoverage] ObjectLiteral
src/aec-schema.js:63:14
 					},
 					polygon: {
 						type: "array",
-						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x","y"] },
+						items: {},
 						description: "Array of {x,y} points, each normalized 0-1000",
 						nullable: true

[NoCoverage] StringLiteral
src/aec-schema.js:64:20
 					polygon: {
 						type: "array",
 						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x","y"] },
-						description: "Array of {x,y} points, each normalized 0-1000",
+						description: "",
 						nullable: true
 					},

[NoCoverage] BooleanLiteral
src/aec-schema.js:65:17
 						type: "array",
 						items: { type:"object", properties:{ x:{type:"number"}, y:{type:"number"} }, required:["x","y"] },
 						description: "Array of {x,y} points, each normalized 0-1000",
-						nullable: true
+						nullable: false
 					},
 					safety: {

[NoCoverage] BooleanLiteral
src/aec-schema.js:70:50
 					safety: {
 						type: "object",
 						properties: {
-							isViolation: { type: "boolean", nullable: true },
+							isViolation: { type: "boolean", nullable: false },
 							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
 							rule: { type: "string", nullable: true }

[NoCoverage] ObjectLiteral
src/aec-schema.js:70:21
 					safety: {
 						type: "object",
 						properties: {
-							isViolation: { type: "boolean", nullable: true },
+							isViolation: {},
 							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
 							rule: { type: "string", nullable: true }

[NoCoverage] BooleanLiteral
src/aec-schema.js:71:77
 						type: "object",
 						properties: {
 							isViolation: { type: "boolean", nullable: true },
-							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
+							severity: { type: "string", enum: ["low","medium","high"], nullable: false },
 							rule: { type: "string", nullable: true }
 						},

[NoCoverage] StringLiteral
src/aec-schema.js:71:58
 						type: "object",
 						properties: {
 							isViolation: { type: "boolean", nullable: true },
-							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
+							severity: { type: "string", enum: ["low","medium",""], nullable: true },
 							rule: { type: "string", nullable: true }
 						},

[NoCoverage] BooleanLiteral
src/aec-schema.js:72:42
 						properties: {
 							isViolation: { type: "boolean", nullable: true },
 							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
-							rule: { type: "string", nullable: true }
+							rule: { type: "string", nullable: false }
 						},
 						nullable: true

[NoCoverage] ObjectLiteral
src/aec-schema.js:72:14
 						properties: {
 							isViolation: { type: "boolean", nullable: true },
 							severity: { type: "string", enum: ["low","medium","high"], nullable: true },
-							rule: { type: "string", nullable: true }
+							rule: {}
 						},
 						nullable: true

[NoCoverage] ObjectLiteral
src/aec-schema.js:78:19
 					},
 					progress: {
 						type: "object",
-						properties: {
-							phase: { type: "string", nullable: true },
-							percentComplete: { type: "number", nullable: true },
-							notes: { type: "string", nullable: true }
-						},
+						properties: {},
 						nullable: true
 					},

[NoCoverage] BooleanLiteral
src/aec-schema.js:79:43
 					progress: {
 						type: "object",
 						properties: {
-							phase: { type: "string", nullable: true },
+							phase: { type: "string", nullable: false },
 							percentComplete: { type: "number", nullable: true },
 							notes: { type: "string", nullable: true }

[NoCoverage] BooleanLiteral
src/aec-schema.js:80:53
 						type: "object",
 						properties: {
 							phase: { type: "string", nullable: true },
-							percentComplete: { type: "number", nullable: true },
+							percentComplete: { type: "number", nullable: false },
 							notes: { type: "string", nullable: true }
 						},

[NoCoverage] ObjectLiteral
src/aec-schema.js:80:25
 						type: "object",
 						properties: {
 							phase: { type: "string", nullable: true },
-							percentComplete: { type: "number", nullable: true },
+							percentComplete: {},
 							notes: { type: "string", nullable: true }
 						},

[NoCoverage] BooleanLiteral
src/aec-schema.js:81:43
 						properties: {
 							phase: { type: "string", nullable: true },
 							percentComplete: { type: "number", nullable: true },
-							notes: { type: "string", nullable: true }
+							notes: { type: "string", nullable: false }
 						},
 						nullable: true

[NoCoverage] ObjectLiteral
src/aec-schema.js:85:18
 						},
 						nullable: true
 					},
-					attributes: {
-						type: "array",
-						items: {
-							type: "object",
-							properties: {
-								name: { type: "string" },
-								valueStr: { type: "string", nullable: true },
-								valueNum: { type: "number", nullable: true },
-								valueBool: { type: "boolean", nullable: true },
-								unit: { type: "string", nullable: true }
-							},
-							required: ["name"]
-						},
-						nullable: true
-					},
+					attributes: {},
 					useCaseTags: { type: "array", items: { type:"string" }, nullable: true },
 					relationships: {

[NoCoverage] StringLiteral
src/aec-schema.js:86:13
 						nullable: true
 					},
 					attributes: {
-						type: "array",
+						type: "",
 						items: {
 							type: "object",

[NoCoverage] StringLiteral
src/aec-schema.js:88:14
 					attributes: {
 						type: "array",
 						items: {
-							type: "object",
+							type: "",
 							properties: {
 								name: { type: "string" },

[NoCoverage] BooleanLiteral
src/aec-schema.js:91:47
 							type: "object",
 							properties: {
 								name: { type: "string" },
-								valueStr: { type: "string", nullable: true },
+								valueStr: { type: "string", nullable: false },
 								valueNum: { type: "number", nullable: true },
 								valueBool: { type: "boolean", nullable: true },

[NoCoverage] BooleanLiteral
src/aec-schema.js:92:47
 							properties: {
 								name: { type: "string" },
 								valueStr: { type: "string", nullable: true },
-								valueNum: { type: "number", nullable: true },
+								valueNum: { type: "number", nullable: false },
 								valueBool: { type: "boolean", nullable: true },
 								unit: { type: "string", nullable: true }

[NoCoverage] BooleanLiteral
src/aec-schema.js:93:49
 								name: { type: "string" },
 								valueStr: { type: "string", nullable: true },
 								valueNum: { type: "number", nullable: true },
-								valueBool: { type: "boolean", nullable: true },
+								valueBool: { type: "boolean", nullable: false },
 								unit: { type: "string", nullable: true }
 							},

[NoCoverage] ObjectLiteral
src/aec-schema.js:93:20
 								name: { type: "string" },
 								valueStr: { type: "string", nullable: true },
 								valueNum: { type: "number", nullable: true },
-								valueBool: { type: "boolean", nullable: true },
+								valueBool: {},
 								unit: { type: "string", nullable: true }
 							},

[NoCoverage] BooleanLiteral
src/aec-schema.js:94:43
 								valueStr: { type: "string", nullable: true },
 								valueNum: { type: "number", nullable: true },
 								valueBool: { type: "boolean", nullable: true },
-								unit: { type: "string", nullable: true }
+								unit: { type: "string", nullable: false }
 							},
 							required: ["name"]

[NoCoverage] BooleanLiteral
src/aec-schema.js:100:72
 						},
 						nullable: true
 					},
-					useCaseTags: { type: "array", items: { type:"string" }, nullable: true },
+					useCaseTags: { type: "array", items: { type:"string" }, nullable: false },
 					relationships: {
 						type: "array",

[NoCoverage] ObjectLiteral
src/aec-schema.js:100:19
 						},
 						nullable: true
 					},
-					useCaseTags: { type: "array", items: { type:"string" }, nullable: true },
+					useCaseTags: {},
 					relationships: {
 						type: "array",

[NoCoverage] StringLiteral
src/aec-schema.js:103:104
 					useCaseTags: { type: "array", items: { type:"string" }, nullable: true },
 					relationships: {
 						type: "array",
-						items: { type:"object", properties:{ type:{type:"string"}, targetId:{type:"string"} }, required:["type","targetId"] },
+						items: { type:"object", properties:{ type:{type:"string"}, targetId:{type:"string"} }, required:["","targetId"] },
 						nullable: true
 					}

[NoCoverage] StringLiteral
src/aec-schema.js:103:21
 					useCaseTags: { type: "array", items: { type:"string" }, nullable: true },
 					relationships: {
 						type: "array",
-						items: { type:"object", properties:{ type:{type:"string"}, targetId:{type:"string"} }, required:["type","targetId"] },
+						items: { type:"", properties:{ type:{type:"string"}, targetId:{type:"string"} }, required:["type","targetId"] },
 						nullable: true
 					}

[NoCoverage] BooleanLiteral
src/aec-schema.js:104:17
 					relationships: {
 						type: "array",
 						items: { type:"object", properties:{ type:{type:"string"}, targetId:{type:"string"} }, required:["type","targetId"] },
-						nullable: true
+						nullable: false
 					}
 				},

[NoCoverage] StringLiteral
src/aec-schema.js:107:21
 						nullable: true
 					}
 				},
-				required: ["id","label","category","confidence"]
+				required: ["id","","category","confidence"]
 			}
 		},

[NoCoverage] ObjectLiteral
src/aec-schema.js:115:12
 			items: {
 				type: "object",
 				properties: {
-					name: { type: "string" },
+					name: {},
 					category: { type:"string", enum:["progress","safety_issue","facility_asset","object","other"] },
 					description: { type: "string" },

[NoCoverage] StringLiteral
src/aec-schema.js:115:20
 			items: {
 				type: "object",
 				properties: {
-					name: { type: "string" },
+					name: { type: "" },
 					category: { type:"string", enum:["progress","safety_issue","facility_asset","object","other"] },
 					description: { type: "string" },

[NoCoverage] ArrayDeclaration
src/aec-schema.js:116:38
 				type: "object",
 				properties: {
 					name: { type: "string" },
-					category: { type:"string", enum:["progress","safety_issue","facility_asset","object","other"] },
+					category: { type:"string", enum:[] },
 					description: { type: "string" },
 					confidence: { type: "number" },

[NoCoverage] StringLiteral
src/aec-schema.js:116:23
 				type: "object",
 				properties: {
 					name: { type: "string" },
-					category: { type:"string", enum:["progress","safety_issue","facility_asset","object","other"] },
+					category: { type:"", enum:["progress","safety_issue","facility_asset","object","other"] },
 					description: { type: "string" },
 					confidence: { type: "number" },

[NoCoverage] StringLiteral
src/aec-schema.js:120:13
 					description: { type: "string" },
 					confidence: { type: "number" },
 					metrics: {
-						type: "array",
+						type: "",
 						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
 						nullable: true

[NoCoverage] BooleanLiteral
src/aec-schema.js:121:117
 					confidence: { type: "number" },
 					metrics: {
 						type: "array",
-						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
+						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:false} }, required:["key","value"] },
 						nullable: true
 					},

[NoCoverage] StringLiteral
src/aec-schema.js:121:142
 					confidence: { type: "number" },
 					metrics: {
 						type: "array",
-						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
+						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key",""] },
 						nullable: true
 					},

[NoCoverage] BooleanLiteral
src/aec-schema.js:122:17
 					metrics: {
 						type: "array",
 						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
-						nullable: true
+						nullable: false
 					},
 					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: true },

[NoCoverage] BooleanLiteral
src/aec-schema.js:124:76
 						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
 						nullable: true
 					},
-					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: true },
+					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: false },
 					region: {
 						type: "object",

[NoCoverage] ObjectLiteral
src/aec-schema.js:124:27
 						items: { type:"object", properties:{ key:{type:"string"}, value:{type:"number"}, unit:{type:"string",nullable:true} }, required:["key","value"] },
 						nullable: true
 					},
-					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: true },
+					relatedDetectionIds: {},
 					region: {
 						type: "object",

[NoCoverage] ObjectLiteral
src/aec-schema.js:125:14
 						nullable: true
 					},
 					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: true },
-					region: {
-						type: "object",
-						properties: {
-							bbox: {
-								type: "object",
-								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
-								required: ["x","y","width","height"],
-								nullable: true
-							}
-						},
-						nullable: true
-					}
+					region: {}
 				},
 				required: ["name","category","description","confidence"]

[NoCoverage] StringLiteral
src/aec-schema.js:126:13
 					},
 					relatedDetectionIds: { type:"array", items:{type:"string"}, nullable: true },
 					region: {
-						type: "object",
+						type: "",
 						properties: {
 							bbox: {

[NoCoverage] StringLiteral
src/aec-schema.js:130:97
 						properties: {
 							bbox: {
 								type: "object",
-								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
+								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:""} },
 								required: ["x","y","width","height"],
 								nullable: true

[NoCoverage] ObjectLiteral
src/aec-schema.js:130:44
 						properties: {
 							bbox: {
 								type: "object",
-								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
+								properties: { x:{type:"number"}, y:{}, width:{type:"number"}, height:{type:"number"} },
 								required: ["x","y","width","height"],
 								nullable: true

[NoCoverage] ArrayDeclaration
src/aec-schema.js:131:19
 							bbox: {
 								type: "object",
 								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
-								required: ["x","y","width","height"],
+								required: [],
 								nullable: true
 							}

[NoCoverage] StringLiteral
src/aec-schema.js:131:28
 							bbox: {
 								type: "object",
 								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
-								required: ["x","y","width","height"],
+								required: ["x","y","","height"],
 								nullable: true
 							}

[NoCoverage] BooleanLiteral
src/aec-schema.js:132:19
 								type: "object",
 								properties: { x:{type:"number"}, y:{type:"number"}, width:{type:"number"}, height:{type:"number"} },
 								required: ["x","y","width","height"],
-								nullable: true
+								nullable: false
 							}
 						},

[NoCoverage] StringLiteral
src/aec-schema.js:138:48
 						nullable: true
 					}
 				},
-				required: ["name","category","description","confidence"]
+				required: ["name","category","description",""]
 			}
 		}

[NoCoverage] StringLiteral
src/aec-schema.js:138:23
 						nullable: true
 					}
 				},
-				required: ["name","category","description","confidence"]
+				required: ["name","","description","confidence"]
 			}
 		}
