[Killed] ConditionalExpression
src/batch-processor.js:21:8
 
 	return new Promise((resolve) => {
 		const processNext = async () => {
-			if (nextIndex >= images.length) {
+			if (true) {
 				// All items queued, check if all done
 				if (activeCount === 0) {
killedBy: batch-processor processBatch should process all items successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] EqualityOperator
src/batch-processor.js:21:8
 
 	return new Promise((resolve) => {
 		const processNext = async () => {
-			if (nextIndex >= images.length) {
+			if (nextIndex > images.length) {
 				// All items queued, check if all done
 				if (activeCount === 0) {
killedBy: batch-processor processBatch should process all items successfully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 4

[Killed] EqualityOperator
src/batch-processor.js:23:9
 		const processNext = async () => {
 			if (nextIndex >= images.length) {
 				// All items queued, check if all done
-				if (activeCount === 0) {
+				if (activeCount !== 0) {
 					resolve(results);
 				}
killedBy: batch-processor processBatch should process all items successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/batch-processor.js:23:9
 		const processNext = async () => {
 			if (nextIndex >= images.length) {
 				// All items queued, check if all done
-				if (activeCount === 0) {
+				if (true) {
 					resolve(results);
 				}
killedBy: batch-processor processBatch should process all items successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Timeout] UpdateOperator
src/batch-processor.js:29:25
 				return;
 			}
 
-			const currentIndex = nextIndex++;
+			const currentIndex = nextIndex--;
 			const image = images[currentIndex];
 			activeCount++;

[Timeout] UpdateOperator
src/batch-processor.js:31:4
 
 			const currentIndex = nextIndex++;
 			const image = images[currentIndex];
-			activeCount++;
+			activeCount--;
 
 			try {

[Killed] BlockStatement
src/batch-processor.js:33:8
 			const image = images[currentIndex];
 			activeCount++;
 
-			try {
-				const result = await processOne(image);
-				results[currentIndex] = { success: true, data: result, image };
-				if (onProgress) {
-					onProgress(image, result, null);
-				}
-			} catch (error) {
+			try {} catch (error) {
 				results[currentIndex] = { success: false, error, image };
 				if (onProgress) {
killedBy: batch-processor processBatch should process all items successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/batch-processor.js:35:40
 
 			try {
 				const result = await processOne(image);
-				results[currentIndex] = { success: true, data: result, image };
+				results[currentIndex] = { success: false, data: result, image };
 				if (onProgress) {
 					onProgress(image, result, null);
killedBy: batch-processor processBatch should process all items successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/batch-processor.js:35:29
 
 			try {
 				const result = await processOne(image);
-				results[currentIndex] = { success: true, data: result, image };
+				results[currentIndex] = {};
 				if (onProgress) {
 					onProgress(image, result, null);
killedBy: batch-processor processBatch should process all items successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/batch-processor.js:36:9
 			try {
 				const result = await processOne(image);
 				results[currentIndex] = { success: true, data: result, image };
-				if (onProgress) {
+				if (false) {
 					onProgress(image, result, null);
 				}
killedBy: batch-processor processBatch should call progress callback for each item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/batch-processor.js:36:21
 			try {
 				const result = await processOne(image);
 				results[currentIndex] = { success: true, data: result, image };
-				if (onProgress) {
-					onProgress(image, result, null);
-				}
+				if (onProgress) {}
 			} catch (error) {
 				results[currentIndex] = { success: false, error, image };
killedBy: batch-processor processBatch should call progress callback for each item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/batch-processor.js:39:20
 				if (onProgress) {
 					onProgress(image, result, null);
 				}
-			} catch (error) {
-				results[currentIndex] = { success: false, error, image };
-				if (onProgress) {
-					onProgress(image, null, error);
-				}
-			} finally {
+			} catch (error) {} finally {
 				activeCount--;
 				processNext(); // Start next item
killedBy: batch-processor processBatch should handle errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/batch-processor.js:40:40
 					onProgress(image, result, null);
 				}
 			} catch (error) {
-				results[currentIndex] = { success: false, error, image };
+				results[currentIndex] = { success: true, error, image };
 				if (onProgress) {
 					onProgress(image, null, error);
killedBy: batch-processor processBatch should handle errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/batch-processor.js:41:9
 				}
 			} catch (error) {
 				results[currentIndex] = { success: false, error, image };
-				if (onProgress) {
+				if (true) {
 					onProgress(image, null, error);
 				}
killedBy: batch-processor processBatch should handle errors gracefully
statusReason: TypeError: onProgress is not a function

[Survived] ConditionalExpression
src/batch-processor.js:41:9
 				}
 			} catch (error) {
 				results[currentIndex] = { success: false, error, image };
-				if (onProgress) {
+				if (false) {
 					onProgress(image, null, error);
 				}

[Timeout] BlockStatement
src/batch-processor.js:44:14
 				if (onProgress) {
 					onProgress(image, null, error);
 				}
-			} finally {
-				activeCount--;
-				processNext(); // Start next item
-			}
+			} finally {}
 		};
 

[Timeout] UpdateOperator
src/batch-processor.js:45:5
 					onProgress(image, null, error);
 				}
 			} finally {
-				activeCount--;
+				activeCount++;
 				processNext(); // Start next item
 			}

[Killed] MethodExpression
src/batch-processor.js:51:26
 		};
 
 		// Start initial batch of workers
-		const initialWorkers = Math.min(MAX_CONCURRENT, images.length);
+		const initialWorkers = Math.max(MAX_CONCURRENT, images.length);
 		for (let i = 0; i < initialWorkers; i++) {
 			processNext();
killedBy: batch-processor processBatch should respect concurrency limit
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 10
Received:    25

[Killed] EqualityOperator
src/batch-processor.js:52:19
 
 		// Start initial batch of workers
 		const initialWorkers = Math.min(MAX_CONCURRENT, images.length);
-		for (let i = 0; i < initialWorkers; i++) {
+		for (let i = 0; i <= initialWorkers; i++) {
 			processNext();
 		}
killedBy: batch-processor processBatch should respect concurrency limit
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 10
Received:    11

[Timeout] ConditionalExpression
src/batch-processor.js:52:19
 
 		// Start initial batch of workers
 		const initialWorkers = Math.min(MAX_CONCURRENT, images.length);
-		for (let i = 0; i < initialWorkers; i++) {
+		for (let i = 0; false; i++) {
 			processNext();
 		}

[Killed] BlockStatement
src/batch-processor.js:63:27
  * @param {number} ms - Milliseconds to delay
  * @returns {Promise<void>}
  */
-export function delay(ms) {
-	return new Promise(resolve => setTimeout(resolve, ms));
-}
+export function delay(ms) {}
 
killedBy: batch-processor delay should resolve after specified time
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 45
Received:    0

[Timeout] ArrowFunction
src/batch-processor.js:64:21
  * @returns {Promise<void>}
  */
 export function delay(ms) {
-	return new Promise(resolve => setTimeout(resolve, ms));
+	return new Promise(() => undefined);
 }
 
