[Killed] MethodExpression
src/export.js:21:11
 		imagesAnalyzed: progress.completed,
 		imagesError: progress.error,
 		sessionAggregates: session.sessionAggregates,
-		images: session.images
-			.filter(img => img.status === 'completed')
+		images: session.images
 			.map(img => ({
 				imageId: img.id,
killedBy: export exportSessionJSON should skip images with error status
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"detections": [{"label": "Worker"}], "filename": "a.jpg", "global_insights": [], "height": 100, "imageId": "img1", "status": "completed", "width": 100}, {"detections": [], "filename": "b.jpg", "global_insights": [], "height": 0, "imageId": "img2", "status": "error", "width": 0}]

[Killed] EqualityOperator
src/export.js:22:19
 		imagesError: progress.error,
 		sessionAggregates: session.sessionAggregates,
 		images: session.images
-			.filter(img => img.status === 'completed')
+			.filter(img => img.status !== 'completed')
 			.map(img => ({
 				imageId: img.id,
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/export.js:22:19
 		imagesError: progress.error,
 		sessionAggregates: session.sessionAggregates,
 		images: session.images
-			.filter(img => img.status === 'completed')
+			.filter(img => false)
 			.map(img => ({
 				imageId: img.id,
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ArrowFunction
src/export.js:23:9
 		sessionAggregates: session.sessionAggregates,
 		images: session.images
 			.filter(img => img.status === 'completed')
-			.map(img => ({
-				imageId: img.id,
-				filename: img.filename,
-				status: img.status,
-				width: img.naturalWidth,
-				height: img.naturalHeight,
-				detections: img.detections,
-				global_insights: img.parsedData?.global_insights || []
-			}))
+			.map(() => undefined)
 	};
 
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: TypeError: Cannot read properties of null (reading 'filename')

[Killed] ObjectLiteral
src/export.js:23:17
 		sessionAggregates: session.sessionAggregates,
 		images: session.images
 			.filter(img => img.status === 'completed')
-			.map(img => ({
-				imageId: img.id,
-				filename: img.filename,
-				status: img.status,
-				width: img.naturalWidth,
-				height: img.naturalHeight,
-				detections: img.detections,
-				global_insights: img.parsedData?.global_insights || []
-			}))
+			.map(img => ({}))
 	};
 
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test.jpg"
Received: undefined

[Survived] OptionalChaining
src/export.js:30:22
 				width: img.naturalWidth,
 				height: img.naturalHeight,
 				detections: img.detections,
-				global_insights: img.parsedData?.global_insights || []
+				global_insights: img.parsedData.global_insights || []
 			}))
 	};

[Survived] ConditionalExpression
src/export.js:30:22
 				width: img.naturalWidth,
 				height: img.naturalHeight,
 				detections: img.detections,
-				global_insights: img.parsedData?.global_insights || []
+				global_insights: true
 			}))
 	};

[Killed] StringLiteral
src/export.js:50:3
 		'SessionID',
 		'ImageID',
 		'ImageName',
-		'DetectionID',
+		"",
 		'Label',
 		'Category',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "DetectionID"
Received string:    "SessionID,ImageID,ImageName,,Label,Category,Confidence,SafetySeverity,SafetyRule,ProgressPhase,ProgressPercent"

[Survived] StringLiteral
src/export.js:52:3
 		'ImageName',
 		'DetectionID',
 		'Label',
-		'Category',
+		"",
 		'Confidence',
 		'SafetySeverity',

[Survived] StringLiteral
src/export.js:56:3
 		'Confidence',
 		'SafetySeverity',
 		'SafetyRule',
-		'ProgressPhase',
+		"",
 		'ProgressPercent'
 	].join(','));

[Survived] StringLiteral
src/export.js:58:9
 		'SafetyRule',
 		'ProgressPhase',
 		'ProgressPercent'
-	].join(','));
+	].join(""));
 
 	// Data rows

[Killed] BlockStatement
src/export.js:61:32
 	].join(','));
 
 	// Data rows
-	session.images.forEach(img => {
-		if (img.status === 'completed' && img.detections) {
-			img.detections.forEach(det => {
-				const row = [
-					escapeCsvField(session.sessionId),
-					escapeCsvField(img.id),
-					escapeCsvField(img.filename),
-					escapeCsvField(det.id || ''),
-					escapeCsvField(det.label || ''),
-					escapeCsvField(det.category || ''),
-					det.confidence != null ? det.confidence.toFixed(4) : '',
-					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
-					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
-					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
-					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
-				];
-				rows.push(row.join(','));
-			});
-		}
-	});
+	session.images.forEach(img => {});
 
 	return rows.join('\n');
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/export.js:62:53
 
 	// Data rows
 	session.images.forEach(img => {
-		if (img.status === 'completed' && img.detections) {
-			img.detections.forEach(det => {
-				const row = [
-					escapeCsvField(session.sessionId),
-					escapeCsvField(img.id),
-					escapeCsvField(img.filename),
-					escapeCsvField(det.id || ''),
-					escapeCsvField(det.label || ''),
-					escapeCsvField(det.category || ''),
-					det.confidence != null ? det.confidence.toFixed(4) : '',
-					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
-					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
-					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
-					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
-				];
-				rows.push(row.join(','));
-			});
-		}
+		if (img.status === 'completed' && img.detections) {}
 	});
 
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/export.js:62:7
 
 	// Data rows
 	session.images.forEach(img => {
-		if (img.status === 'completed' && img.detections) {
+		if (false) {
 			img.detections.forEach(det => {
 				const row = [
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/export.js:63:34
 	// Data rows
 	session.images.forEach(img => {
 		if (img.status === 'completed' && img.detections) {
-			img.detections.forEach(det => {
-				const row = [
-					escapeCsvField(session.sessionId),
-					escapeCsvField(img.id),
-					escapeCsvField(img.filename),
-					escapeCsvField(det.id || ''),
-					escapeCsvField(det.label || ''),
-					escapeCsvField(det.category || ''),
-					det.confidence != null ? det.confidence.toFixed(4) : '',
-					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
-					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
-					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
-					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
-				];
-				rows.push(row.join(','));
-			});
+			img.detections.forEach(det => {});
 		}
 	});
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] LogicalOperator
src/export.js:68:21
 					escapeCsvField(session.sessionId),
 					escapeCsvField(img.id),
 					escapeCsvField(img.filename),
-					escapeCsvField(det.id || ''),
+					escapeCsvField(det.id && ''),
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),

[Survived] ConditionalExpression
src/export.js:68:21
 					escapeCsvField(session.sessionId),
 					escapeCsvField(img.id),
 					escapeCsvField(img.filename),
-					escapeCsvField(det.id || ''),
+					escapeCsvField(true),
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),

[Killed] LogicalOperator
src/export.js:69:21
 					escapeCsvField(img.id),
 					escapeCsvField(img.filename),
 					escapeCsvField(det.id || ''),
-					escapeCsvField(det.label || ''),
+					escapeCsvField(det.label && ''),
 					escapeCsvField(det.category || ''),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Worker"
Received string:    "test_session,img1,test.jpg,det1,,object,0.9500,,,,"

[Killed] ConditionalExpression
src/export.js:69:21
 					escapeCsvField(img.id),
 					escapeCsvField(img.filename),
 					escapeCsvField(det.id || ''),
-					escapeCsvField(det.label || ''),
+					escapeCsvField(false),
 					escapeCsvField(det.category || ''),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Worker"
Received string:    "test_session,img1,test.jpg,det1,false,object,0.9500,,,,"

[Survived] ConditionalExpression
src/export.js:70:21
 					escapeCsvField(img.filename),
 					escapeCsvField(det.id || ''),
 					escapeCsvField(det.label || ''),
-					escapeCsvField(det.category || ''),
+					escapeCsvField(true),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',

[Survived] ConditionalExpression
src/export.js:70:21
 					escapeCsvField(img.filename),
 					escapeCsvField(det.id || ''),
 					escapeCsvField(det.label || ''),
-					escapeCsvField(det.category || ''),
+					escapeCsvField(false),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',

[Killed] ConditionalExpression
src/export.js:71:6
 					escapeCsvField(det.id || ''),
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),
-					det.confidence != null ? det.confidence.toFixed(4) : '',
+					false ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "0.9500"
Received string:    "test_session,img1,test.jpg,det1,Worker,object,,,,,"

[Killed] EqualityOperator
src/export.js:71:6
 					escapeCsvField(det.id || ''),
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),
-					det.confidence != null ? det.confidence.toFixed(4) : '',
+					det.confidence == null ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "0.9500"
Received string:    "test_session,img1,test.jpg,det1,Worker,object,,,,,"

[Killed] OptionalChaining
src/export.js:72:6
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
-					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
+					det.safety.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: TypeError: Cannot read properties of undefined (reading 'severity')

[Survived] StringLiteral
src/export.js:72:67
 					escapeCsvField(det.label || ''),
 					escapeCsvField(det.category || ''),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
-					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
+					det.safety?.severity ? escapeCsvField(det.safety.severity) : "Stryker was here!",
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',

[Killed] OptionalChaining
src/export.js:73:6
 					escapeCsvField(det.category || ''),
 					det.confidence != null ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
-					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
+					det.safety.rule ? escapeCsvField(det.safety.rule) : '',
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
 					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: TypeError: Cannot read properties of undefined (reading 'rule')

[Killed] OptionalChaining
src/export.js:74:6
 					det.confidence != null ? det.confidence.toFixed(4) : '',
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
-					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
+					det.progress.phase ? escapeCsvField(det.progress.phase) : '',
 					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
 				];
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: TypeError: Cannot read properties of undefined (reading 'phase')

[Killed] EqualityOperator
src/export.js:75:6
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
-					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
+					det.progress?.percentComplete == null ? det.progress.percentComplete.toFixed(2) : ''
 				];
 				rows.push(row.join(','));
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: TypeError: Cannot read properties of undefined (reading 'percentComplete')

[Killed] OptionalChaining
src/export.js:75:6
 					det.safety?.severity ? escapeCsvField(det.safety.severity) : '',
 					det.safety?.rule ? escapeCsvField(det.safety.rule) : '',
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
-					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
+					det.progress.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
 				];
 				rows.push(row.join(','));
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: TypeError: Cannot read properties of undefined (reading 'percentComplete')

[Survived] StringLiteral
src/export.js:77:24
 					det.progress?.phase ? escapeCsvField(det.progress.phase) : '',
 					det.progress?.percentComplete != null ? det.progress.percentComplete.toFixed(2) : ''
 				];
-				rows.push(row.join(','));
+				rows.push(row.join(""));
 			});
 		}

[NoCoverage] BlockStatement
src/export.js:91:59
  * @param {string} filename - Suggested filename
  * @param {string} mimeType - MIME type
  */
-export function downloadFile(content, filename, mimeType) {
-	const blob = new Blob([content], { type: mimeType });
-	const url = URL.createObjectURL(blob);
-	const link = document.createElement('a');
-	link.href = url;
-	link.download = filename;
-	document.body.appendChild(link);
-	link.click();
-	document.body.removeChild(link);
-	URL.revokeObjectURL(url);
-}
+export function downloadFile(content, filename, mimeType) {}
 
 /**

[NoCoverage] ObjectLiteral
src/export.js:92:35
  * @param {string} mimeType - MIME type
  */
 export function downloadFile(content, filename, mimeType) {
-	const blob = new Blob([content], { type: mimeType });
+	const blob = new Blob([content], {});
 	const url = URL.createObjectURL(blob);
 	const link = document.createElement('a');

[NoCoverage] StringLiteral
src/export.js:94:38
 export function downloadFile(content, filename, mimeType) {
 	const blob = new Blob([content], { type: mimeType });
 	const url = URL.createObjectURL(blob);
-	const link = document.createElement('a');
+	const link = document.createElement("");
 	link.href = url;
 	link.download = filename;

[Killed] BlockStatement
src/export.js:108:32
  * @param {string} value - Field value
  * @returns {string} Escaped value
  */
-function escapeCsvField(value) {
-	if (value == null) return '';
-	const str = String(value);
-	if (str.includes(',') || str.includes('"') || str.includes('\n')) {
-		return `"${str.replace(/"/g, '""')}"`;
-	}
-	return str;
-}
+function escapeCsvField(value) {}
 
 /**
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test_session"
Received string:    ",,,,,,0.9500,,,,"

[Killed] ConditionalExpression
src/export.js:109:6
  * @returns {string} Escaped value
  */
 function escapeCsvField(value) {
-	if (value == null) return '';
+	if (true) return '';
 	const str = String(value);
 	if (str.includes(',') || str.includes('"') || str.includes('\n')) {
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test_session"
Received string:    ",,,,,,0.9500,,,,"

[Killed] EqualityOperator
src/export.js:109:6
  * @returns {string} Escaped value
  */
 function escapeCsvField(value) {
-	if (value == null) return '';
+	if (value != null) return '';
 	const str = String(value);
 	if (str.includes(',') || str.includes('"') || str.includes('\n')) {
killedBy: export exportSessionCSV should export session as CSV with header
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test_session"
Received string:    ",,,,,,0.9500,,,,"

[Killed] LogicalOperator
src/export.js:111:6
 function escapeCsvField(value) {
 	if (value == null) return '';
 	const str = String(value);
-	if (str.includes(',') || str.includes('"') || str.includes('\n')) {
+	if (str.includes(',') && str.includes('"') || str.includes('\n')) {
 		return `"${str.replace(/"/g, '""')}"`;
 	}
killedBy: export exportSessionCSV should escape CSV fields with commas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"file,with,commas.jpg\""
Received string:    "SessionID,ImageID,ImageName,DetectionID,Label,Category,Confidence,SafetySeverity,SafetyRule,ProgressPhase,ProgressPercent
test,img1,file,with,commas.jpg,det1,Worker, standing,object,0.8000,,,,"

[Killed] LogicalOperator
src/export.js:111:6
 function escapeCsvField(value) {
 	if (value == null) return '';
 	const str = String(value);
-	if (str.includes(',') || str.includes('"') || str.includes('\n')) {
+	if ((str.includes(',') || str.includes('"')) && str.includes('\n')) {
 		return `"${str.replace(/"/g, '""')}"`;
 	}
killedBy: export exportSessionCSV should escape CSV fields with commas
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"file,with,commas.jpg\""
Received string:    "SessionID,ImageID,ImageName,DetectionID,Label,Category,Confidence,SafetySeverity,SafetyRule,ProgressPhase,ProgressPercent
test,img1,file,with,commas.jpg,det1,Worker, standing,object,0.8000,,,,"

[Killed] BlockStatement
src/export.js:122:37
  * @param {object} session - Session state
  * @returns {object} Progress counts
  */
-function getProgressCounts(session) {
-	const completed = session.images.filter(img => img.status === 'completed').length;
-	const error = session.images.filter(img => img.status === 'error').length;
-	return { completed, error };
-}
+function getProgressCounts(session) {}
 
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: TypeError: Cannot read properties of undefined (reading 'completed')

[Killed] EqualityOperator
src/export.js:123:49
  * @returns {object} Progress counts
  */
 function getProgressCounts(session) {
-	const completed = session.images.filter(img => img.status === 'completed').length;
+	const completed = session.images.filter(img => img.status !== 'completed').length;
 	const error = session.images.filter(img => img.status === 'error').length;
 	return { completed, error };
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/export.js:123:42
  * @returns {object} Progress counts
  */
 function getProgressCounts(session) {
-	const completed = session.images.filter(img => img.status === 'completed').length;
+	const completed = session.images.filter(() => undefined).length;
 	const error = session.images.filter(img => img.status === 'error').length;
 	return { completed, error };
killedBy: export exportSessionJSON should export session as valid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/export.js:124:45
  */
 function getProgressCounts(session) {
 	const completed = session.images.filter(img => img.status === 'completed').length;
-	const error = session.images.filter(img => img.status === 'error').length;
+	const error = session.images.filter(img => true).length;
 	return { completed, error };
 }

[Survived] EqualityOperator
src/export.js:124:45
  */
 function getProgressCounts(session) {
 	const completed = session.images.filter(img => img.status === 'completed').length;
-	const error = session.images.filter(img => img.status === 'error').length;
+	const error = session.images.filter(img => img.status !== 'error').length;
 	return { completed, error };
 }
