[Killed] BlockStatement
src/geometry.js:7:32
  * Convert Gemini's [ymin, xmin, ymax, xmax] format to {x, y, width, height}
  * Gemini uses: top-left origin, y-first order, normalized 0-1000
  */
-function parseGeminiBbox(bbox) {
-	if (!Array.isArray(bbox) || bbox.length !== 4) return null;
-	const [ymin, xmin, ymax, xmax] = bbox;
-	if (![ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
-	
-	return {
-		x: xmin,
-		y: ymin,
-		width: Math.max(0, xmax - xmin),
-		height: Math.max(0, ymax - ymin)
-	};
-}
+function parseGeminiBbox(bbox) {}
 
 export function toCanvasBox(
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] ConditionalExpression
src/geometry.js:8:6
  * Gemini uses: top-left origin, y-first order, normalized 0-1000
  */
 function parseGeminiBbox(bbox) {
-	if (!Array.isArray(bbox) || bbox.length !== 4) return null;
+	if (true) return null;
 	const [ymin, xmin, ymax, xmax] = bbox;
 	if (![ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] EqualityOperator
src/geometry.js:8:30
  * Gemini uses: top-left origin, y-first order, normalized 0-1000
  */
 function parseGeminiBbox(bbox) {
-	if (!Array.isArray(bbox) || bbox.length !== 4) return null;
+	if (!Array.isArray(bbox) || bbox.length === 4) return null;
 	const [ymin, xmin, ymax, xmax] = bbox;
 	if (![ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] BooleanLiteral
src/geometry.js:10:6
 function parseGeminiBbox(bbox) {
 	if (!Array.isArray(bbox) || bbox.length !== 4) return null;
 	const [ymin, xmin, ymax, xmax] = bbox;
-	if (![ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
+	if ([ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
 	
 	return {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] ConditionalExpression
src/geometry.js:10:6
 function parseGeminiBbox(bbox) {
 	if (!Array.isArray(bbox) || bbox.length !== 4) return null;
 	const [ymin, xmin, ymax, xmax] = bbox;
-	if (![ymin, xmin, ymax, xmax].every(Number.isFinite)) return null;
+	if (true) return null;
 	
 	return {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] MethodExpression
src/geometry.js:15:10
 	return {
 		x: xmin,
 		y: ymin,
-		width: Math.max(0, xmax - xmin),
+		width: Math.min(0, xmax - xmin),
 		height: Math.max(0, ymax - ymin)
 	};
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
-   "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:15:22
 	return {
 		x: xmin,
 		y: ymin,
-		width: Math.max(0, xmax - xmin),
+		width: Math.max(0, xmax + xmin),
 		height: Math.max(0, ymax - ymin)
 	};
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
-   "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:16:23
 		x: xmin,
 		y: ymin,
 		width: Math.max(0, xmax - xmin),
-		height: Math.max(0, ymax - ymin)
+		height: Math.max(0, ymax + ymin)
 	};
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 40,
+   "height": 80,

[Killed] MethodExpression
src/geometry.js:16:11
 		x: xmin,
 		y: ymin,
 		width: Math.max(0, xmax - xmin),
-		height: Math.max(0, ymax - ymin)
+		height: Math.min(0, ymax - ymin)
 	};
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 40,
+   "height": 0,

[Survived] StringLiteral
src/geometry.js:27:11
 	displayScaleY,
 	imgW,
 	imgH,
-	origin = 'top-left',
+	origin = "",
 	canvasWidth,
 	canvasHeight

[Killed] BlockStatement
src/geometry.js:30:3
 	origin = 'top-left',
 	canvasWidth,
 	canvasHeight
-) {
-	// If b is an array, it's Gemini's [ymin, xmin, ymax, xmax] format
-	const box = Array.isArray(b) ? parseGeminiBbox(b) : b;
-	
-	const normalized = normalizeBox(box, coordSystem, imgW, imgH);
-	if (!normalized) return null;
-
-	const oriented = orientBox(normalized, origin, imgH);
-	const scaled = scaleBox(oriented, displayScaleX, displayScaleY);
-	return clampBox(scaled, canvasWidth, canvasHeight);
-}
+) {}
 
 export function toCanvasPolygon(
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: undefined

[Killed] ConditionalExpression
src/geometry.js:35:6
 	const box = Array.isArray(b) ? parseGeminiBbox(b) : b;
 	
 	const normalized = normalizeBox(box, coordSystem, imgW, imgH);
-	if (!normalized) return null;
+	if (true) return null;
 
 	const oriented = orientBox(normalized, origin, imgH);
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] ConditionalExpression
src/geometry.js:35:6
 	const box = Array.isArray(b) ? parseGeminiBbox(b) : b;
 	
 	const normalized = normalizeBox(box, coordSystem, imgW, imgH);
-	if (!normalized) return null;
+	if (false) return null;
 
 	const oriented = orientBox(normalized, origin, imgH);
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox returns null for invalid array
statusReason: TypeError: Cannot read properties of null (reading 'x')

[Killed] BlockStatement
src/geometry.js:50:3
 	imgW,
 	imgH,
 	origin = 'top-left'
-) {
-	if (!Array.isArray(poly)) return null;
-
-	const scaledPoints = poly
-		.map(point => normalizePoint(point, coordSystem, imgW, imgH))
-		.map(point => orientPoint(point, origin, imgH))
-		.map(point => scalePoint(point, displayScaleX, displayScaleY))
-		.filter(Boolean);
-
-	return scaledPoints.length >= 3 ? scaledPoints : null;
-}
+) {}
 
 export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: undefined

[Killed] ConditionalExpression
src/geometry.js:51:6
 	imgH,
 	origin = 'top-left'
 ) {
-	if (!Array.isArray(poly)) return null;
+	if (true) return null;
 
 	const scaledPoints = poly
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] BooleanLiteral
src/geometry.js:51:6
 	imgH,
 	origin = 'top-left'
 ) {
-	if (!Array.isArray(poly)) return null;
+	if (Array.isArray(poly)) return null;
 
 	const scaledPoints = poly
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] MethodExpression
src/geometry.js:53:23
 ) {
 	if (!Array.isArray(poly)) return null;
 
-	const scaledPoints = poly
-		.map(point => normalizePoint(point, coordSystem, imgW, imgH))
-		.map(point => orientPoint(point, origin, imgH))
-		.map(point => scalePoint(point, displayScaleX, displayScaleY))
-		.filter(Boolean);
+	const scaledPoints = poly.map(point => normalizePoint(point, coordSystem, imgW, imgH)).map(point => orientPoint(point, origin, imgH)).map(point => scalePoint(point, displayScaleX, displayScaleY));
 
 	return scaledPoints.length >= 3 ? scaledPoints : null;
killedBy: geometry helpers toCanvasPolygon returns null when fewer than three valid points remain after filtering
statusReason: Error: expect(received).toBeNull()

Received: [{"x": 0, "y": 0}, null, null]

[Killed] ArrowFunction
src/geometry.js:54:8
 	if (!Array.isArray(poly)) return null;
 
 	const scaledPoints = poly
-		.map(point => normalizePoint(point, coordSystem, imgW, imgH))
+		.map(() => undefined)
 		.map(point => orientPoint(point, origin, imgH))
 		.map(point => scalePoint(point, displayScaleX, displayScaleY))
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ArrowFunction
src/geometry.js:55:8
 
 	const scaledPoints = poly
 		.map(point => normalizePoint(point, coordSystem, imgW, imgH))
-		.map(point => orientPoint(point, origin, imgH))
+		.map(() => undefined)
 		.map(point => scalePoint(point, displayScaleX, displayScaleY))
 		.filter(Boolean);
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ArrowFunction
src/geometry.js:56:8
 	const scaledPoints = poly
 		.map(point => normalizePoint(point, coordSystem, imgW, imgH))
 		.map(point => orientPoint(point, origin, imgH))
-		.map(point => scalePoint(point, displayScaleX, displayScaleY))
+		.map(() => undefined)
 		.filter(Boolean);
 
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] EqualityOperator
src/geometry.js:59:9
 		.map(point => scalePoint(point, displayScaleX, displayScaleY))
 		.filter(Boolean);
 
-	return scaledPoints.length >= 3 ? scaledPoints : null;
+	return scaledPoints.length < 3 ? scaledPoints : null;
 }
 
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ConditionalExpression
src/geometry.js:59:9
 		.map(point => scalePoint(point, displayScaleX, displayScaleY))
 		.filter(Boolean);
 
-	return scaledPoints.length >= 3 ? scaledPoints : null;
+	return true ? scaledPoints : null;
 }
 
killedBy: geometry helpers toCanvasPolygon returns null when fewer than three valid points remain after filtering
statusReason: Error: expect(received).toBeNull()

Received: [{"x": 0, "y": 0}]

[Killed] BlockStatement
src/geometry.js:62:72
 	return scaledPoints.length >= 3 ? scaledPoints : null;
 }
 
-export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
-	const cs = res?.image?.coordSystem;
-	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
-}
+export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {}
 
 export function ensureCoordOrigin(res, fallback = 'top-left') {
killedBy: geometry helpers ensureCoordSystem defaults to normalized_0_1000 (Gemini standard)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "normalized_0_1000"
Received: undefined

[NoCoverage] StringLiteral
src/geometry.js:62:51
 	return scaledPoints.length >= 3 ? scaledPoints : null;
 }
 
-export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
+export function ensureCoordSystem(res, fallback = "") {
 	const cs = res?.image?.coordSystem;
 	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;

[Survived] OptionalChaining
src/geometry.js:63:13
 }
 
 export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
-	const cs = res?.image?.coordSystem;
+	const cs = res?.image.coordSystem;
 	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
 }

[Survived] OptionalChaining
src/geometry.js:63:13
 }
 
 export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
-	const cs = res?.image?.coordSystem;
+	const cs = res.image?.coordSystem;
 	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
 }

[Killed] EqualityOperator
src/geometry.js:64:10
 
 export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
 	const cs = res?.image?.coordSystem;
-	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
+	return (cs !== 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
 }
 
killedBy: geometry helpers ensureCoordSystem defaults to normalized_0_1000 (Gemini standard)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "normalized_0_1000"
Received: undefined

[Killed] EqualityOperator
src/geometry.js:64:28
 
 export function ensureCoordSystem(res, fallback = 'normalized_0_1000') {
 	const cs = res?.image?.coordSystem;
-	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
+	return (cs === 'pixel' || cs !== 'normalized_0_1000') ? cs : fallback;
 }
 
killedBy: geometry helpers ensureCoordSystem defaults to normalized_0_1000 (Gemini standard)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "normalized_0_1000"
Received: undefined

[Killed] BlockStatement
src/geometry.js:67:63
 	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
 }
 
-export function ensureCoordOrigin(res, fallback = 'top-left') {
-	const match = collectOrigins(res).find(isValidOrigin);
-	return match ?? fallback;
-}
+export function ensureCoordOrigin(res, fallback = 'top-left') {}
 
 function normalizeBox(box, coordSystem, imgW, imgH) {
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: undefined

[NoCoverage] StringLiteral
src/geometry.js:67:51
 	return (cs === 'pixel' || cs === 'normalized_0_1000') ? cs : fallback;
 }
 
-export function ensureCoordOrigin(res, fallback = 'top-left') {
+export function ensureCoordOrigin(res, fallback = "") {
 	const match = collectOrigins(res).find(isValidOrigin);
 	return match ?? fallback;

[Killed] LogicalOperator
src/geometry.js:69:9
 
 export function ensureCoordOrigin(res, fallback = 'top-left') {
 	const match = collectOrigins(res).find(isValidOrigin);
-	return match ?? fallback;
+	return match && fallback;
 }
 
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] BlockStatement
src/geometry.js:72:53
 	return match ?? fallback;
 }
 
-function normalizeBox(box, coordSystem, imgW, imgH) {
-	if (!box) return null;
-	const { x, y, width, height } = box;
-	if (![x, y, width, height].every(Number.isFinite)) return null;
-
-	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {
-		return { x, y, width, height };
-	}
-
-	return {
-		x: (x / 1000) * imgW,
-		y: (y / 1000) * imgH,
-		width: (width / 1000) * imgW,
-		height: (height / 1000) * imgH
-	};
-}
+function normalizeBox(box, coordSystem, imgW, imgH) {}
 
 function orientBox(box, origin, imgH) {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] BooleanLiteral
src/geometry.js:73:6
 }
 
 function normalizeBox(box, coordSystem, imgW, imgH) {
-	if (!box) return null;
+	if (box) return null;
 	const { x, y, width, height } = box;
 	if (![x, y, width, height].every(Number.isFinite)) return null;
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] ConditionalExpression
src/geometry.js:73:6
 }
 
 function normalizeBox(box, coordSystem, imgW, imgH) {
-	if (!box) return null;
+	if (true) return null;
 	const { x, y, width, height } = box;
 	if (![x, y, width, height].every(Number.isFinite)) return null;
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] MethodExpression
src/geometry.js:75:7
 function normalizeBox(box, coordSystem, imgW, imgH) {
 	if (!box) return null;
 	const { x, y, width, height } = box;
-	if (![x, y, width, height].every(Number.isFinite)) return null;
+	if (![x, y, width, height].some(Number.isFinite)) return null;
 
 	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {
killedBy: geometry helpers toCanvasBox returns null when bbox contains non-finite values
statusReason: Error: expect(received).toBeNull()

Received: {"height": 10, "width": 10, "x": 0, "y": 0}

[Killed] BooleanLiteral
src/geometry.js:75:6
 function normalizeBox(box, coordSystem, imgW, imgH) {
 	if (!box) return null;
 	const { x, y, width, height } = box;
-	if (![x, y, width, height].every(Number.isFinite)) return null;
+	if ([x, y, width, height].every(Number.isFinite)) return null;
 
 	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: null

[Killed] BooleanLiteral
src/geometry.js:77:45
 	const { x, y, width, height } = box;
 	if (![x, y, width, height].every(Number.isFinite)) return null;
 
-	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {
+	if (coordSystem !== 'normalized_0_1000' || Number.isFinite(imgW) || !Number.isFinite(imgH)) {
 		return { x, y, width, height };
 	}
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 80,

[Killed] BlockStatement
src/geometry.js:77:95
 	const { x, y, width, height } = box;
 	if (![x, y, width, height].every(Number.isFinite)) return null;
 
-	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {
-		return { x, y, width, height };
-	}
+	if (coordSystem !== 'normalized_0_1000' || !Number.isFinite(imgW) || !Number.isFinite(imgH)) {}
 
 	return {
killedBy: geometry helpers Legacy object format {x, y, width, height} toCanvasBox still supports object format for backward compatibility
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 30,

[Killed] ArithmeticOperator
src/geometry.js:82:6
 	}
 
 	return {
-		x: (x / 1000) * imgW,
+		x: x / 1000 / imgW,
 		y: (y / 1000) * imgH,
 		width: (width / 1000) * imgW,
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
    "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:82:7
 	}
 
 	return {
-		x: (x / 1000) * imgW,
+		x: (x * 1000) * imgW,
 		y: (y / 1000) * imgH,
 		width: (width / 1000) * imgW,
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "height": 40,
-   "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:83:6
 
 	return {
 		x: (x / 1000) * imgW,
-		y: (y / 1000) * imgH,
+		y: y / 1000 / imgH,
 		width: (width / 1000) * imgW,
 		height: (height / 1000) * imgH
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
    "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:83:7
 
 	return {
 		x: (x / 1000) * imgW,
-		y: (y / 1000) * imgH,
+		y: (y * 1000) * imgH,
 		width: (width / 1000) * imgW,
 		height: (height / 1000) * imgH
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "height": 40,
+   "height": 0,

[Killed] ArithmeticOperator
src/geometry.js:84:11
 	return {
 		x: (x / 1000) * imgW,
 		y: (y / 1000) * imgH,
-		width: (width / 1000) * imgW,
+		width: (width * 1000) * imgW,
 		height: (height / 1000) * imgH
 	};
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
-   "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:84:10
 	return {
 		x: (x / 1000) * imgW,
 		y: (y / 1000) * imgH,
-		width: (width / 1000) * imgW,
+		width: width / 1000 / imgW,
 		height: (height / 1000) * imgH
 	};
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
-   "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:85:11
 		x: (x / 1000) * imgW,
 		y: (y / 1000) * imgH,
 		width: (width / 1000) * imgW,
-		height: (height / 1000) * imgH
+		height: height / 1000 / imgH
 	};
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 40,
+   "height": 0.004,

[Killed] ArithmeticOperator
src/geometry.js:85:12
 		x: (x / 1000) * imgW,
 		y: (y / 1000) * imgH,
 		width: (width / 1000) * imgW,
-		height: (height / 1000) * imgH
+		height: (height * 1000) * imgH
 	};
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 40,
+   "height": 80,

[Killed] BlockStatement
src/geometry.js:89:39
 	};
 }
 
-function orientBox(box, origin, imgH) {
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) {
-		return box;
-	}
-	return {
-		...box,
-		y: imgH - (box.y + box.height)
-	};
-}
+function orientBox(box, origin, imgH) {}
 
 function scaleBox(box, scaleX, scaleY) {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'x')

[Killed] ConditionalExpression
src/geometry.js:90:6
 }
 
 function orientBox(box, origin, imgH) {
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) {
+	if (true) {
 		return box;
 	}
killedBy: geometry helpers Legacy object format {x, y, width, height} toCanvasBox converts bottom-left origin to top-left when specified
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
    "width": 30,

[Killed] BlockStatement
src/geometry.js:90:58
 }
 
 function orientBox(box, origin, imgH) {
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) {
-		return box;
-	}
+	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) {}
 	return {
 		...box,
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 40,
    "width": 80,

[Killed] ArithmeticOperator
src/geometry.js:95:6
 	}
 	return {
 		...box,
-		y: imgH - (box.y + box.height)
+		y: imgH + (box.y + box.height)
 	};
 }
killedBy: geometry helpers Legacy object format {x, y, width, height} toCanvasBox converts bottom-left origin to top-left when specified
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "height": 40,
+   "height": 0,

[Killed] ArithmeticOperator
src/geometry.js:95:14
 	}
 	return {
 		...box,
-		y: imgH - (box.y + box.height)
+		y: imgH - (box.y - box.height)
 	};
 }
killedBy: geometry helpers Legacy object format {x, y, width, height} toCanvasBox converts bottom-left origin to top-left when specified
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "height": 40,
+   "height": 0,

[Killed] BlockStatement
src/geometry.js:99:40
 	};
 }
 
-function scaleBox(box, scaleX, scaleY) {
-	const sx = Number.isFinite(scaleX) ? scaleX : 1;
-	const sy = Number.isFinite(scaleY) ? scaleY : 1;
-	return {
-		x: box.x * sx,
-		y: box.y * sy,
-		width: box.width * sx,
-		height: box.height * sy
-	};
-}
+function scaleBox(box, scaleX, scaleY) {}
 
 function clampBox(box, canvasWidth, canvasHeight) {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/geometry.js:103:6
 	const sx = Number.isFinite(scaleX) ? scaleX : 1;
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
 	return {
-		x: box.x * sx,
+		x: box.x / sx,
 		y: box.y * sy,
 		width: box.width * sx,
killedBy: geometry helpers toCanvasBox respects normalized_0_1000 coord system and scales output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "height": 20,
-   "width": 20,

[Killed] ArithmeticOperator
src/geometry.js:104:6
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
 	return {
 		x: box.x * sx,
-		y: box.y * sy,
+		y: box.y / sy,
 		width: box.width * sx,
 		height: box.height * sy
killedBy: geometry helpers toCanvasBox respects normalized_0_1000 coord system and scales output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "height": 20,
+   "height": 0,

[Killed] ArithmeticOperator
src/geometry.js:105:10
 	return {
 		x: box.x * sx,
 		y: box.y * sy,
-		width: box.width * sx,
+		width: box.width / sx,
 		height: box.height * sy
 	};
killedBy: geometry helpers toCanvasBox respects normalized_0_1000 coord system and scales output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 20,
-   "width": 20,
