[Killed] ArithmeticOperator
src/geometry.js:106:11
 		x: box.x * sx,
 		y: box.y * sy,
 		width: box.width * sx,
-		height: box.height * sy
+		height: box.height / sy
 	};
 }
killedBy: geometry helpers toCanvasBox respects normalized_0_1000 coord system and scales output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 20,
+   "height": 75,

[Killed] BlockStatement
src/geometry.js:110:51
 	};
 }
 
-function clampBox(box, canvasWidth, canvasHeight) {
-	if (!Number.isFinite(canvasWidth) || !Number.isFinite(canvasHeight)) {
-		return box;
-	}
-	const x = clamp(box.x, 0, canvasWidth);
-	const y = clamp(box.y, 0, canvasHeight);
-	const width = clamp(box.width, 0, canvasWidth - x);
-	const height = clamp(box.height, 0, canvasHeight - y);
-	return { x, y, width, height };
-}
+function clampBox(box, canvasWidth, canvasHeight) {}
 
 function normalizePoint(point, coordSystem, imgW, imgH) {
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"height": 40, "width": 80, "x": 20, "y": 20}
Received: undefined

[Killed] BlockStatement
src/geometry.js:111:71
 }
 
 function clampBox(box, canvasWidth, canvasHeight) {
-	if (!Number.isFinite(canvasWidth) || !Number.isFinite(canvasHeight)) {
-		return box;
-	}
+	if (!Number.isFinite(canvasWidth) || !Number.isFinite(canvasHeight)) {}
 	const x = clamp(box.x, 0, canvasWidth);
 	const y = clamp(box.y, 0, canvasHeight);
killedBy: geometry helpers toCanvasBox falls back to unit scale and skips clamping when scale/canvas values are missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 10,
-   "width": 10,

[Killed] ConditionalExpression
src/geometry.js:111:6
 }
 
 function clampBox(box, canvasWidth, canvasHeight) {
-	if (!Number.isFinite(canvasWidth) || !Number.isFinite(canvasHeight)) {
+	if (false) {
 		return box;
 	}
killedBy: geometry helpers toCanvasBox falls back to unit scale and skips clamping when scale/canvas values are missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 10,
-   "width": 10,

[Killed] ArithmeticOperator
src/geometry.js:116:36
 	}
 	const x = clamp(box.x, 0, canvasWidth);
 	const y = clamp(box.y, 0, canvasHeight);
-	const width = clamp(box.width, 0, canvasWidth - x);
+	const width = clamp(box.width, 0, canvasWidth + x);
 	const height = clamp(box.height, 0, canvasHeight - y);
 	return { x, y, width, height };
killedBy: geometry helpers toCanvasBox clamps values that exceed the canvas bounds
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "height": 10,
-   "width": 20,

[Killed] ArithmeticOperator
src/geometry.js:117:38
 	const x = clamp(box.x, 0, canvasWidth);
 	const y = clamp(box.y, 0, canvasHeight);
 	const width = clamp(box.width, 0, canvasWidth - x);
-	const height = clamp(box.height, 0, canvasHeight - y);
+	const height = clamp(box.height, 0, canvasHeight + y);
 	return { x, y, width, height };
 }
killedBy: geometry helpers toCanvasBox clamps values that exceed the canvas bounds
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "height": 10,
+   "height": 30,

[Killed] ObjectLiteral
src/geometry.js:118:9
 	const y = clamp(box.y, 0, canvasHeight);
 	const width = clamp(box.width, 0, canvasWidth - x);
 	const height = clamp(box.height, 0, canvasHeight - y);
-	return { x, y, width, height };
+	return {};
 }
 
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "height": 40,
-   "width": 80,

[Killed] BlockStatement
src/geometry.js:121:57
 	return { x, y, width, height };
 }
 
-function normalizePoint(point, coordSystem, imgW, imgH) {
-	if (!point) return null;
-	let { x, y } = point;
-	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
-
-	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
-		x = (x / 1000) * imgW;
-		y = (y / 1000) * imgH;
-	}
-
-	return { x, y };
-}
+function normalizePoint(point, coordSystem, imgW, imgH) {}
 
 function orientPoint(point, origin, imgH) {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ConditionalExpression
src/geometry.js:122:6
 }
 
 function normalizePoint(point, coordSystem, imgW, imgH) {
-	if (!point) return null;
+	if (true) return null;
 	let { x, y } = point;
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] BooleanLiteral
src/geometry.js:122:6
 }
 
 function normalizePoint(point, coordSystem, imgW, imgH) {
-	if (!point) return null;
+	if (point) return null;
 	let { x, y } = point;
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] BooleanLiteral
src/geometry.js:124:6
 function normalizePoint(point, coordSystem, imgW, imgH) {
 	if (!point) return null;
 	let { x, y } = point;
-	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
+	if (Number.isFinite(x) && Number.isFinite(y)) return null;
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ConditionalExpression
src/geometry.js:124:6
 function normalizePoint(point, coordSystem, imgW, imgH) {
 	if (!point) return null;
 	let { x, y } = point;
-	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
+	if (true) return null;
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] EqualityOperator
src/geometry.js:126:6
 	let { x, y } = point;
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
 
-	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
+	if (coordSystem !== 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
 		x = (x / 1000) * imgW;
 		y = (y / 1000) * imgH;
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -2,13 +2,13 @@
    Object {
      "x": 0,

[Killed] LogicalOperator
src/geometry.js:126:6
 	let { x, y } = point;
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
 
-	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
+	if (coordSystem === 'normalized_0_1000' || Number.isFinite(imgW) && Number.isFinite(imgH)) {
 		x = (x / 1000) * imgW;
 		y = (y / 1000) * imgH;
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -2,13 +2,13 @@
    Object {
      "x": 0,

[Killed] ArithmeticOperator
src/geometry.js:127:8
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
-		x = (x / 1000) * imgW;
+		x = (x * 1000) * imgW;
 		y = (y / 1000) * imgH;
 	}
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -2,13 +2,13 @@
    Object {
      "x": 0,

[Killed] ArithmeticOperator
src/geometry.js:127:7
 	if (!(Number.isFinite(x) && Number.isFinite(y))) return null;
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
-		x = (x / 1000) * imgW;
+		x = x / 1000 / imgW;
 		y = (y / 1000) * imgH;
 	}
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -2,13 +2,13 @@
    Object {
      "x": 0,

[Killed] ArithmeticOperator
src/geometry.js:128:7
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
 		x = (x / 1000) * imgW;
-		y = (y / 1000) * imgH;
+		y = y / 1000 / imgH;
 	}
 
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,8 +7,8 @@
      "x": 200,
      "y": 0,

[Killed] ArithmeticOperator
src/geometry.js:128:8
 
 	if (coordSystem === 'normalized_0_1000' && Number.isFinite(imgW) && Number.isFinite(imgH)) {
 		x = (x / 1000) * imgW;
-		y = (y / 1000) * imgH;
+		y = (y * 1000) * imgH;
 	}
 
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,8 +7,8 @@
      "x": 200,
      "y": 0,

[Killed] BlockStatement
src/geometry.js:134:43
 	return { x, y };
 }
 
-function orientPoint(point, origin, imgH) {
-	if (!point) return null;
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
-	return { x: point.x, y: imgH - point.y };
-}
+function orientPoint(point, origin, imgH) {}
 
 function scalePoint(point, scaleX, scaleY) {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ConditionalExpression
src/geometry.js:135:6
 }
 
 function orientPoint(point, origin, imgH) {
-	if (!point) return null;
+	if (true) return null;
 	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
 	return { x: point.x, y: imgH - point.y };
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] BooleanLiteral
src/geometry.js:135:6
 }
 
 function orientPoint(point, origin, imgH) {
-	if (!point) return null;
+	if (point) return null;
 	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
 	return { x: point.x, y: imgH - point.y };
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] EqualityOperator
src/geometry.js:136:6
 
 function orientPoint(point, origin, imgH) {
 	if (!point) return null;
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
+	if (origin === 'bottom-left' || !Number.isFinite(imgH)) return point;
 	return { x: point.x, y: imgH - point.y };
 }
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,13 +1,13 @@
  Array [
    Object {

[Killed] LogicalOperator
src/geometry.js:136:6
 
 function orientPoint(point, origin, imgH) {
 	if (!point) return null;
-	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
+	if (origin !== 'bottom-left' && !Number.isFinite(imgH)) return point;
 	return { x: point.x, y: imgH - point.y };
 }
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Object {
      "x": 0,

[Killed] ArithmeticOperator
src/geometry.js:137:26
 function orientPoint(point, origin, imgH) {
 	if (!point) return null;
 	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
-	return { x: point.x, y: imgH - point.y };
+	return { x: point.x, y: imgH + point.y };
 }
 
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,8 +7,8 @@
      "x": 100,
      "y": 100,

[Killed] ObjectLiteral
src/geometry.js:137:9
 function orientPoint(point, origin, imgH) {
 	if (!point) return null;
 	if (origin !== 'bottom-left' || !Number.isFinite(imgH)) return point;
-	return { x: point.x, y: imgH - point.y };
+	return {};
 }
 
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "x": 0,

[Killed] BlockStatement
src/geometry.js:140:44
 	return { x: point.x, y: imgH - point.y };
 }
 
-function scalePoint(point, scaleX, scaleY) {
-	if (!point) return null;
-	const sx = Number.isFinite(scaleX) ? scaleX : 1;
-	const sy = Number.isFinite(scaleY) ? scaleY : 1;
-	return { x: point.x * sx, y: point.y * sy };
-}
+function scalePoint(point, scaleX, scaleY) {}
 
 function isValidOrigin(origin) {
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ConditionalExpression
src/geometry.js:141:6
 }
 
 function scalePoint(point, scaleX, scaleY) {
-	if (!point) return null;
+	if (false) return null;
 	const sx = Number.isFinite(scaleX) ? scaleX : 1;
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
killedBy: geometry helpers toCanvasPolygon returns null when fewer than three valid points remain after filtering
statusReason: TypeError: Cannot read properties of null (reading 'x')

[Killed] ConditionalExpression
src/geometry.js:141:6
 }
 
 function scalePoint(point, scaleX, scaleY) {
-	if (!point) return null;
+	if (true) return null;
 	const sx = Number.isFinite(scaleX) ? scaleX : 1;
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
killedBy: geometry helpers toCanvasPolygon flips Y when origin is bottom-left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"x": 0, "y": 100}, {"x": 100, "y": 100}, {"x": 50, "y": 50}]
Received: null

[Killed] ArithmeticOperator
src/geometry.js:144:31
 	if (!point) return null;
 	const sx = Number.isFinite(scaleX) ? scaleX : 1;
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
-	return { x: point.x * sx, y: point.y * sy };
+	return { x: point.x * sx, y: point.y / sy };
 }
 
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,8 +7,8 @@
      "x": 200,
      "y": 0,

[Killed] ArithmeticOperator
src/geometry.js:144:14
 	if (!point) return null;
 	const sx = Number.isFinite(scaleX) ? scaleX : 1;
 	const sy = Number.isFinite(scaleY) ? scaleY : 1;
-	return { x: point.x * sx, y: point.y * sy };
+	return { x: point.x / sx, y: point.y * sy };
 }
 
killedBy: geometry helpers toCanvasPolygon maps normalized coordinates correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -2,13 +2,13 @@
    Object {
      "x": 0,

[Killed] BlockStatement
src/geometry.js:147:32
 	return { x: point.x * sx, y: point.y * sy };
 }
 
-function isValidOrigin(origin) {
-	return origin === 'top-left' || origin === 'bottom-left';
-}
+function isValidOrigin(origin) {}
 
 function collectOrigins(res) {
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] EqualityOperator
src/geometry.js:148:9
 }
 
 function isValidOrigin(origin) {
-	return origin === 'top-left' || origin === 'bottom-left';
+	return origin !== 'top-left' || origin === 'bottom-left';
 }
 
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] ConditionalExpression
src/geometry.js:148:9
 }
 
 function isValidOrigin(origin) {
-	return origin === 'top-left' || origin === 'bottom-left';
+	return true;
 }
 
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] BlockStatement
src/geometry.js:151:30
 	return origin === 'top-left' || origin === 'bottom-left';
 }
 
-function collectOrigins(res) {
-	const origins = [];
-	if (res?.image) {
-		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
-	}
-	if (Array.isArray(res?.detections)) {
-		origins.push(...res.detections.map(det => det?.coordOrigin));
-	}
-	return origins;
-}
+function collectOrigins(res) {}
 
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Survived] ArrayDeclaration
src/geometry.js:152:18
 }
 
 function collectOrigins(res) {
-	const origins = [];
+	const origins = ["Stryker was here"];
 	if (res?.image) {
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);

[Killed] ConditionalExpression
src/geometry.js:153:6
 
 function collectOrigins(res) {
 	const origins = [];
-	if (res?.image) {
+	if (true) {
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}
killedBy: geometry helpers ensureCoordOrigin defaults to top-left (Gemini standard)
statusReason: TypeError: Cannot read properties of undefined (reading 'coordOrigin')

[Survived] OptionalChaining
src/geometry.js:153:6
 
 function collectOrigins(res) {
 	const origins = [];
-	if (res?.image) {
+	if (res.image) {
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}

[Killed] BlockStatement
src/geometry.js:156:38
 	if (res?.image) {
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}
-	if (Array.isArray(res?.detections)) {
-		origins.push(...res.detections.map(det => det?.coordOrigin));
-	}
+	if (Array.isArray(res?.detections)) {}
 	return origins;
 }
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] ConditionalExpression
src/geometry.js:156:6
 	if (res?.image) {
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}
-	if (Array.isArray(res?.detections)) {
+	if (false) {
 		origins.push(...res.detections.map(det => det?.coordOrigin));
 	}
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Killed] ArrowFunction
src/geometry.js:157:38
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}
 	if (Array.isArray(res?.detections)) {
-		origins.push(...res.detections.map(det => det?.coordOrigin));
+		origins.push(...res.detections.map(() => undefined));
 	}
 	return origins;
killedBy: geometry helpers ensureCoordOrigin falls back to detections when image metadata missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom-left"
Received: "top-left"

[Survived] OptionalChaining
src/geometry.js:157:45
 		origins.push(res.image.coordOrigin, res.image.origin, res.image.coordinateOrigin);
 	}
 	if (Array.isArray(res?.detections)) {
-		origins.push(...res.detections.map(det => det?.coordOrigin));
+		origins.push(...res.detections.map(det => det.coordOrigin));
 	}
 	return origins;
