[NoCoverage] StringLiteral
src/index.js:32:42
 import { exportSessionJSON, exportSessionCSV, downloadFile } from './export.js';
 
 // ---------- UI Elements ----------
-const apiKeyEl = document.getElementById('apiKey');
+const apiKeyEl = document.getElementById("");
 const modelEl  = document.getElementById('model');
 const fileEl   = document.getElementById('file');

[NoCoverage] StringLiteral
src/index.js:34:42
 // ---------- UI Elements ----------
 const apiKeyEl = document.getElementById('apiKey');
 const modelEl  = document.getElementById('model');
-const fileEl   = document.getElementById('file');
+const fileEl   = document.getElementById("");
 const dropzone = document.getElementById('dropzone');
 const canvas   = document.getElementById('canvas');

[NoCoverage] StringLiteral
src/index.js:35:42
 const apiKeyEl = document.getElementById('apiKey');
 const modelEl  = document.getElementById('model');
 const fileEl   = document.getElementById('file');
-const dropzone = document.getElementById('dropzone');
+const dropzone = document.getElementById("");
 const canvas   = document.getElementById('canvas');
 const ctx      = canvas.getContext('2d');

[NoCoverage] StringLiteral
src/index.js:39:42
 const canvas   = document.getElementById('canvas');
 const ctx      = canvas.getContext('2d');
 const reportWrap = document.getElementById('reportWrap');
-const jsonOut  = document.getElementById('jsonOut');
+const jsonOut  = document.getElementById("");
 const progressBar = document.getElementById('progressBar');
 const progressText = document.getElementById('progressText');

[NoCoverage] BooleanLiteral
src/index.js:50:19
 
 // Session state
 let currentSession = null;
-let isAnalyzing = false;
+let isAnalyzing = true;
 let pendingApiKeyAnalysis = false;
 

[NoCoverage] BooleanLiteral
src/index.js:51:29
 // Session state
 let currentSession = null;
 let isAnalyzing = false;
-let pendingApiKeyAnalysis = false;
+let pendingApiKeyAnalysis = true;
 
 // Legacy single-image state (for backwards compatibility)

[NoCoverage] ArrayDeclaration
src/index.js:56:25
 // Legacy single-image state (for backwards compatibility)
 let currentFile = null;
 let currentImageBitmap = null;
-let currentDetections = [];
+let currentDetections = ["Stryker was here"];
 let currentParsedData = null;
 let naturalW = 0, naturalH = 0;

[NoCoverage] BooleanLiteral
src/index.js:60:22
 let currentParsedData = null;
 let naturalW = 0, naturalH = 0;
 let highlightedDetectionId = null;
-let analysisQueued = false;
+let analysisQueued = true;
 
 // ---------- Helpers ----------

[NoCoverage] BlockStatement
src/index.js:63:29
 let analysisQueued = false;
 
 // ---------- Helpers ----------
-function logJson(obj, note) {
-	jsonOut.textContent = formatJsonOutput(obj, note);
-}
+function logJson(obj, note) {}
 
 function clearReport() {

[NoCoverage] BlockStatement
src/index.js:67:24
 	jsonOut.textContent = formatJsonOutput(obj, note);
 }
 
-function clearReport() {
-	reportWrap.innerHTML = '';
-}
+function clearReport() {}
 
 // ---------- Multi-Image Functions ----------

[NoCoverage] StringLiteral
src/index.js:68:25
 }
 
 function clearReport() {
-	reportWrap.innerHTML = '';
+	reportWrap.innerHTML = "Stryker was here!";
 }
 

[NoCoverage] BlockStatement
src/index.js:73:43
 
 // ---------- Multi-Image Functions ----------
 
-async function handleMultipleFiles(files) {
-	const fileArray = Array.from(files);
-	
-	if (fileArray.length > MAX_IMAGES) {
-		logJson({ error: `Maximum ${MAX_IMAGES} images allowed. You selected ${fileArray.length}.` }, 'Error');
-		return;
-	}
-
-	const apiKey = apiKeyEl.value.trim();
-	if (!apiKey) {
-		pendingApiKeyAnalysis = true;
-		logJson({ message: `${fileArray.length} images loaded. Enter your API key to start analysis.` });
-		return;
-	}
-
-	pendingApiKeyAnalysis = false;
-	await analyzeMultipleImages(fileArray);
-}
+async function handleMultipleFiles(files) {}
 
 async function analyzeMultipleImages(files) {

[NoCoverage] ConditionalExpression
src/index.js:76:6
 async function handleMultipleFiles(files) {
 	const fileArray = Array.from(files);
 	
-	if (fileArray.length > MAX_IMAGES) {
+	if (true) {
 		logJson({ error: `Maximum ${MAX_IMAGES} images allowed. You selected ${fileArray.length}.` }, 'Error');
 		return;

[NoCoverage] EqualityOperator
src/index.js:76:6
 async function handleMultipleFiles(files) {
 	const fileArray = Array.from(files);
 	
-	if (fileArray.length > MAX_IMAGES) {
+	if (fileArray.length <= MAX_IMAGES) {
 		logJson({ error: `Maximum ${MAX_IMAGES} images allowed. You selected ${fileArray.length}.` }, 'Error');
 		return;

[NoCoverage] MethodExpression
src/index.js:81:17
 		return;
 	}
 
-	const apiKey = apiKeyEl.value.trim();
+	const apiKey = apiKeyEl.value;
 	if (!apiKey) {
 		pendingApiKeyAnalysis = true;

[NoCoverage] ConditionalExpression
src/index.js:82:6
 	}
 
 	const apiKey = apiKeyEl.value.trim();
-	if (!apiKey) {
+	if (false) {
 		pendingApiKeyAnalysis = true;
 		logJson({ message: `${fileArray.length} images loaded. Enter your API key to start analysis.` });

[NoCoverage] ConditionalExpression
src/index.js:82:6
 	}
 
 	const apiKey = apiKeyEl.value.trim();
-	if (!apiKey) {
+	if (true) {
 		pendingApiKeyAnalysis = true;
 		logJson({ message: `${fileArray.length} images loaded. Enter your API key to start analysis.` });

[NoCoverage] BooleanLiteral
src/index.js:83:27
 
 	const apiKey = apiKeyEl.value.trim();
 	if (!apiKey) {
-		pendingApiKeyAnalysis = true;
+		pendingApiKeyAnalysis = false;
 		logJson({ message: `${fileArray.length} images loaded. Enter your API key to start analysis.` });
 		return;

[NoCoverage] ObjectLiteral
src/index.js:84:11
 	const apiKey = apiKeyEl.value.trim();
 	if (!apiKey) {
 		pendingApiKeyAnalysis = true;
-		logJson({ message: `${fileArray.length} images loaded. Enter your API key to start analysis.` });
+		logJson({});
 		return;
 	}

[NoCoverage] BooleanLiteral
src/index.js:88:26
 		return;
 	}
 
-	pendingApiKeyAnalysis = false;
+	pendingApiKeyAnalysis = true;
 	await analyzeMultipleImages(fileArray);
 }

[NoCoverage] ConditionalExpression
src/index.js:93:6
 }
 
 async function analyzeMultipleImages(files) {
-	if (isAnalyzing) return;
+	if (false) return;
 	isAnalyzing = true;
 

[NoCoverage] ConditionalExpression
src/index.js:93:6
 }
 
 async function analyzeMultipleImages(files) {
-	if (isAnalyzing) return;
+	if (true) return;
 	isAnalyzing = true;
 

[NoCoverage] BooleanLiteral
src/index.js:94:16
 
 async function analyzeMultipleImages(files) {
 	if (isAnalyzing) return;
-	isAnalyzing = true;
+	isAnalyzing = false;
 
 	// Create session

[NoCoverage] StringLiteral
src/index.js:101:30
 	
 	// Hide dropzone, show progress bar and gallery
 	dropzone.style.display = 'none';
-	progressBar.style.display = 'block';
+	progressBar.style.display = "";
 	gallery.style.display = 'block';
 	clearReport();

[NoCoverage] StringLiteral
src/index.js:102:26
 	// Hide dropzone, show progress bar and gallery
 	dropzone.style.display = 'none';
 	progressBar.style.display = 'block';
-	gallery.style.display = 'block';
+	gallery.style.display = "";
 	clearReport();
 

[NoCoverage] BlockStatement
src/index.js:109:43
 	renderGallery();
 
 	// Load image bitmaps
-	for (const img of currentSession.images) {
-		try {
-			img.bitmap = await createImageBitmap(img.file);
-			img.naturalWidth = img.bitmap.width;
-			img.naturalHeight = img.bitmap.height;
-		} catch (err) {
-			img.error = `Failed to load image: ${err.message}`;
-			img.status = 'error';
-		}
-		updateGalleryThumb(img.id);
-	}
+	for (const img of currentSession.images) {}
 
 	// Display first image

[NoCoverage] BlockStatement
src/index.js:110:7
 
 	// Load image bitmaps
 	for (const img of currentSession.images) {
-		try {
-			img.bitmap = await createImageBitmap(img.file);
-			img.naturalWidth = img.bitmap.width;
-			img.naturalHeight = img.bitmap.height;
-		} catch (err) {
+		try {} catch (err) {
 			img.error = `Failed to load image: ${err.message}`;
 			img.status = 'error';

[NoCoverage] BlockStatement
src/index.js:114:17
 			img.bitmap = await createImageBitmap(img.file);
 			img.naturalWidth = img.bitmap.width;
 			img.naturalHeight = img.bitmap.height;
-		} catch (err) {
-			img.error = `Failed to load image: ${err.message}`;
-			img.status = 'error';
-		}
+		} catch (err) {}
 		updateGalleryThumb(img.id);
 	}

[NoCoverage] ConditionalExpression
src/index.js:122:6
 	}
 
 	// Display first image
-	if (currentSession.images.length > 0) {
+	if (true) {
 		await displaySessionImage(0);
 	}

[NoCoverage] EqualityOperator
src/index.js:122:6
 	}
 
 	// Display first image
-	if (currentSession.images.length > 0) {
+	if (currentSession.images.length >= 0) {
 		await displaySessionImage(0);
 	}

[NoCoverage] MethodExpression
src/index.js:127:17
 	}
 
 	// Process all images
-	const apiKey = apiKeyEl.value.trim();
+	const apiKey = apiKeyEl.value;
 	const model = modelEl.value.trim() || 'gemini-2.5-pro';
 

[NoCoverage] LogicalOperator
src/index.js:128:16
 
 	// Process all images
 	const apiKey = apiKeyEl.value.trim();
-	const model = modelEl.value.trim() || 'gemini-2.5-pro';
+	const model = modelEl.value.trim() && 'gemini-2.5-pro';
 
 	await processBatch(

[NoCoverage] ConditionalExpression
src/index.js:128:16
 
 	// Process all images
 	const apiKey = apiKeyEl.value.trim();
-	const model = modelEl.value.trim() || 'gemini-2.5-pro';
+	const model = false;
 
 	await processBatch(

[NoCoverage] ConditionalExpression
src/index.js:131:39
 	const model = modelEl.value.trim() || 'gemini-2.5-pro';
 
 	await processBatch(
-		currentSession.images.filter(img => img.status === 'queued'),
+		currentSession.images.filter(img => true),
 		async (img) => {
 			img.status = 'analyzing';

[NoCoverage] EqualityOperator
src/index.js:131:39
 	const model = modelEl.value.trim() || 'gemini-2.5-pro';
 
 	await processBatch(
-		currentSession.images.filter(img => img.status === 'queued'),
+		currentSession.images.filter(img => img.status !== 'queued'),
 		async (img) => {
 			img.status = 'analyzing';

[NoCoverage] BlockStatement
src/index.js:132:18
 
 	await processBatch(
 		currentSession.images.filter(img => img.status === 'queued'),
-		async (img) => {
-			img.status = 'analyzing';
-			updateProgress();
-			updateGalleryThumb(img.id);
-
-			const resp = await callGeminiREST({ apiKey, model, file: img.file });
-			const parsed = extractJSONFromResponse(resp);
-			prepareDetectionData(parsed, img.naturalWidth, img.naturalHeight);
-
-			const coordSystem = ensureCoordSystem(parsed, 'normalized_0_1000');
-			ensureCoordOrigin(parsed, 'top-left');
-			if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
-
-			img.parsedData = parsed;
-			img.detections = Array.isArray(parsed.detections) ? parsed.detections : [];
-			img.status = 'completed';
-
-			return parsed;
-		},
+		async (img) => {},
 		(img, result, error) => {
 			if (error) {

[NoCoverage] EqualityOperator
src/index.js:143:8
 
 			const coordSystem = ensureCoordSystem(parsed, 'normalized_0_1000');
 			ensureCoordOrigin(parsed, 'top-left');
-			if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
+			if (parsed.image.coordSystem != null) parsed.image.coordSystem = coordSystem;
 
 			img.parsedData = parsed;

[NoCoverage] ConditionalExpression
src/index.js:143:8
 
 			const coordSystem = ensureCoordSystem(parsed, 'normalized_0_1000');
 			ensureCoordOrigin(parsed, 'top-left');
-			if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
+			if (true) parsed.image.coordSystem = coordSystem;
 
 			img.parsedData = parsed;

[NoCoverage] StringLiteral
src/index.js:147:17
 
 			img.parsedData = parsed;
 			img.detections = Array.isArray(parsed.detections) ? parsed.detections : [];
-			img.status = 'completed';
+			img.status = "";
 
 			return parsed;

[NoCoverage] BlockStatement
src/index.js:151:27
 
 			return parsed;
 		},
-		(img, result, error) => {
-			if (error) {
-				img.error = String(error?.message || error);
-				img.status = 'error';
-			}
-			updateProgress();
-			updateGalleryThumb(img.id);
-			
-			// Redraw active image if it's the one that just completed
-			if (currentSession.activeImageIndex === currentSession.images.indexOf(img)) {
-				drawOverlaysForSession();
-			}
-		}
+		(img, result, error) => {}
 	);
 

[NoCoverage] ConditionalExpression
src/index.js:152:8
 			return parsed;
 		},
 		(img, result, error) => {
-			if (error) {
+			if (false) {
 				img.error = String(error?.message || error);
 				img.status = 'error';

[NoCoverage] ConditionalExpression
src/index.js:152:8
 			return parsed;
 		},
 		(img, result, error) => {
-			if (error) {
+			if (true) {
 				img.error = String(error?.message || error);
 				img.status = 'error';

[NoCoverage] LogicalOperator
src/index.js:153:24
 		},
 		(img, result, error) => {
 			if (error) {
-				img.error = String(error?.message || error);
+				img.error = String(error?.message && error);
 				img.status = 'error';
 			}

[NoCoverage] OptionalChaining
src/index.js:153:24
 		},
 		(img, result, error) => {
 			if (error) {
-				img.error = String(error?.message || error);
+				img.error = String(error.message || error);
 				img.status = 'error';
 			}

[NoCoverage] BlockStatement
src/index.js:160:80
 			updateGalleryThumb(img.id);
 			
 			// Redraw active image if it's the one that just completed
-			if (currentSession.activeImageIndex === currentSession.images.indexOf(img)) {
-				drawOverlaysForSession();
-			}
+			if (currentSession.activeImageIndex === currentSession.images.indexOf(img)) {}
 		}
 	);

[NoCoverage] ConditionalExpression
src/index.js:160:8
 			updateGalleryThumb(img.id);
 			
 			// Redraw active image if it's the one that just completed
-			if (currentSession.activeImageIndex === currentSession.images.indexOf(img)) {
+			if (true) {
 				drawOverlaysForSession();
 			}

[NoCoverage] StringLiteral
src/index.js:170:30
 	currentSession.status = updateSessionStatus(currentSession);
 	currentSession.sessionAggregates = calculateSessionAggregates(currentSession);
 
-	progressBar.style.display = 'none';
+	progressBar.style.display = "";
 
 	// Render session report

[NoCoverage] EqualityOperator
src/index.js:178:19
 
 	// Setup interactions
 	const activeImg = currentSession.images[currentSession.activeImageIndex];
-	if (activeImg && activeImg.status === 'completed') {
+	if (activeImg && activeImg.status !== 'completed') {
 		setupReportInteractions(
 			reportWrap,

[NoCoverage] ConditionalExpression
src/index.js:178:6
 
 	// Setup interactions
 	const activeImg = currentSession.images[currentSession.activeImageIndex];
-	if (activeImg && activeImg.status === 'completed') {
+	if (false) {
 		setupReportInteractions(
 			reportWrap,

[NoCoverage] BlockStatement
src/index.js:182:19
 		setupReportInteractions(
 			reportWrap,
 			activeImg.detections,
-			(detection) => {
-				highlightedDetectionId = detection.id;
-				drawOverlaysForSession();
-			},
+			(detection) => {},
 			() => {
 				highlightedDetectionId = null;

[NoCoverage] BlockStatement
src/index.js:186:10
 				highlightedDetectionId = detection.id;
 				drawOverlaysForSession();
 			},
-			() => {
-				highlightedDetectionId = null;
-				drawOverlaysForSession();
-			}
+			() => {}
 		);
 	}

[NoCoverage] StringLiteral
src/index.js:194:48
 	}
 
 	// Setup export buttons
-	const exportJSONBtn = document.getElementById('exportJSON');
+	const exportJSONBtn = document.getElementById("");
 	const exportCSVBtn = document.getElementById('exportCSV');
 	

[NoCoverage] StringLiteral
src/index.js:195:47
 
 	// Setup export buttons
 	const exportJSONBtn = document.getElementById('exportJSON');
-	const exportCSVBtn = document.getElementById('exportCSV');
+	const exportCSVBtn = document.getElementById("");
 	
 	if (exportJSONBtn) {

[NoCoverage] BlockStatement
src/index.js:197:21
 	const exportJSONBtn = document.getElementById('exportJSON');
 	const exportCSVBtn = document.getElementById('exportCSV');
 	
-	if (exportJSONBtn) {
-		exportJSONBtn.addEventListener('click', () => {
-			const json = exportSessionJSON(currentSession);
-			downloadFile(json, `session_${currentSession.sessionId}.json`, 'application/json');
-		});
-	}
+	if (exportJSONBtn) {}
 	
 	if (exportCSVBtn) {

[NoCoverage] ConditionalExpression
src/index.js:197:6
 	const exportJSONBtn = document.getElementById('exportJSON');
 	const exportCSVBtn = document.getElementById('exportCSV');
 	
-	if (exportJSONBtn) {
+	if (true) {
 		exportJSONBtn.addEventListener('click', () => {
 			const json = exportSessionJSON(currentSession);

[NoCoverage] BlockStatement
src/index.js:198:49
 	const exportCSVBtn = document.getElementById('exportCSV');
 	
 	if (exportJSONBtn) {
-		exportJSONBtn.addEventListener('click', () => {
-			const json = exportSessionJSON(currentSession);
-			downloadFile(json, `session_${currentSession.sessionId}.json`, 'application/json');
-		});
+		exportJSONBtn.addEventListener('click', () => {});
 	}
 	

[NoCoverage] StringLiteral
src/index.js:198:34
 	const exportCSVBtn = document.getElementById('exportCSV');
 	
 	if (exportJSONBtn) {
-		exportJSONBtn.addEventListener('click', () => {
+		exportJSONBtn.addEventListener("", () => {
 			const json = exportSessionJSON(currentSession);
 			downloadFile(json, `session_${currentSession.sessionId}.json`, 'application/json');

[NoCoverage] BlockStatement
src/index.js:204:20
 		});
 	}
 	
-	if (exportCSVBtn) {
-		exportCSVBtn.addEventListener('click', () => {
-			const csv = exportSessionCSV(currentSession);
-			downloadFile(csv, `session_${currentSession.sessionId}.csv`, 'text/csv');
-		});
-	}
+	if (exportCSVBtn) {}
 
 	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => img.status === 'completed').length} images.` });

[NoCoverage] ConditionalExpression
src/index.js:204:6
 		});
 	}
 	
-	if (exportCSVBtn) {
+	if (true) {
 		exportCSVBtn.addEventListener('click', () => {
 			const csv = exportSessionCSV(currentSession);

[NoCoverage] BlockStatement
src/index.js:205:48
 	}
 	
 	if (exportCSVBtn) {
-		exportCSVBtn.addEventListener('click', () => {
-			const csv = exportSessionCSV(currentSession);
-			downloadFile(csv, `session_${currentSession.sessionId}.csv`, 'text/csv');
-		});
+		exportCSVBtn.addEventListener('click', () => {});
 	}
 

[NoCoverage] ConditionalExpression
src/index.js:211:149
 		});
 	}
 
-	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => img.status === 'completed').length} images.` });
+	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => true).length} images.` });
 	isAnalyzing = false;
 }

[NoCoverage] EqualityOperator
src/index.js:211:149
 		});
 	}
 
-	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => img.status === 'completed').length} images.` });
+	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => img.status !== 'completed').length} images.` });
 	isAnalyzing = false;
 }

[NoCoverage] BooleanLiteral
src/index.js:212:16
 	}
 
 	logJson({ message: `Analysis complete. ${currentSession.sessionAggregates.totalDetections} detections across ${currentSession.images.filter(img => img.status === 'completed').length} images.` });
-	isAnalyzing = false;
+	isAnalyzing = true;
 }
 

[NoCoverage] StringLiteral
src/index.js:216:22
 }
 
 function renderGallery() {
-	gallery.innerHTML = '';
+	gallery.innerHTML = "Stryker was here!";
 	currentSession.images.forEach((img, index) => {
 		const thumb = document.createElement('div');

[NoCoverage] StringLiteral
src/index.js:219:21
 	gallery.innerHTML = '';
 	currentSession.images.forEach((img, index) => {
 		const thumb = document.createElement('div');
-		thumb.className = 'gallery-thumb';
+		thumb.className = "";
 		thumb.id = `thumb-${img.id}`;
 		if (index === currentSession.activeImageIndex) {

[NoCoverage] StringLiteral
src/index.js:220:14
 	currentSession.images.forEach((img, index) => {
 		const thumb = document.createElement('div');
 		thumb.className = 'gallery-thumb';
-		thumb.id = `thumb-${img.id}`;
+		thumb.id = ``;
 		if (index === currentSession.activeImageIndex) {
 			thumb.classList.add('active');

[NoCoverage] EqualityOperator
src/index.js:221:7
 		const thumb = document.createElement('div');
 		thumb.className = 'gallery-thumb';
 		thumb.id = `thumb-${img.id}`;
-		if (index === currentSession.activeImageIndex) {
+		if (index !== currentSession.activeImageIndex) {
 			thumb.classList.add('active');
 		}

[NoCoverage] ConditionalExpression
src/index.js:221:7
 		const thumb = document.createElement('div');
 		thumb.className = 'gallery-thumb';
 		thumb.id = `thumb-${img.id}`;
-		if (index === currentSession.activeImageIndex) {
+		if (false) {
 			thumb.classList.add('active');
 		}

[NoCoverage] ConditionalExpression
src/index.js:227:7
 
 		const imgEl = document.createElement('img');
 		imgEl.className = 'gallery-thumb-img';
-		if (img.bitmap) {
+		if (false) {
 			imgEl.src = createThumbnailDataUrl(img.bitmap);
 		}

[NoCoverage] BlockStatement
src/index.js:227:19
 
 		const imgEl = document.createElement('img');
 		imgEl.className = 'gallery-thumb-img';
-		if (img.bitmap) {
-			imgEl.src = createThumbnailDataUrl(img.bitmap);
-		}
+		if (img.bitmap) {}
 
 		const nameEl = document.createElement('div');

[NoCoverage] StringLiteral
src/index.js:231:41
 			imgEl.src = createThumbnailDataUrl(img.bitmap);
 		}
 
-		const nameEl = document.createElement('div');
+		const nameEl = document.createElement("");
 		nameEl.className = 'gallery-thumb-name';
 		nameEl.textContent = img.filename;

[NoCoverage] StringLiteral
src/index.js:236:24
 		nameEl.textContent = img.filename;
 
 		const statusEl = document.createElement('div');
-		statusEl.className = `gallery-thumb-status ${img.status}`;
+		statusEl.className = ``;
 		statusEl.id = `status-${img.id}`;
 		statusEl.textContent = img.status;

[NoCoverage] BlockStatement
src/index.js:244:41
 		thumb.appendChild(nameEl);
 		thumb.appendChild(statusEl);
 
-		thumb.addEventListener('click', () => {
-			displaySessionImage(index);
-		});
+		thumb.addEventListener('click', () => {});
 
 		gallery.appendChild(thumb);

[NoCoverage] BlockStatement
src/index.js:252:38
 	});
 }
 
-function updateGalleryThumb(imageId) {
-	const img = currentSession.images.find(i => i.id === imageId);
-	if (!img) return;
-
-	const statusEl = document.getElementById(`status-${imageId}`);
-	if (statusEl) {
-		statusEl.className = `gallery-thumb-status ${img.status}`;
-		statusEl.textContent = img.status;
-	}
-}
+function updateGalleryThumb(imageId) {}
 
 async function displaySessionImage(index) {

[NoCoverage] ConditionalExpression
src/index.js:253:46
 }
 
 function updateGalleryThumb(imageId) {
-	const img = currentSession.images.find(i => i.id === imageId);
+	const img = currentSession.images.find(i => false);
 	if (!img) return;
 

[NoCoverage] EqualityOperator
src/index.js:253:46
 }
 
 function updateGalleryThumb(imageId) {
-	const img = currentSession.images.find(i => i.id === imageId);
+	const img = currentSession.images.find(i => i.id !== imageId);
 	if (!img) return;
 

[NoCoverage] ConditionalExpression
src/index.js:254:6
 
 function updateGalleryThumb(imageId) {
 	const img = currentSession.images.find(i => i.id === imageId);
-	if (!img) return;
+	if (false) return;
 
 	const statusEl = document.getElementById(`status-${imageId}`);

[NoCoverage] BooleanLiteral
src/index.js:254:6
 
 function updateGalleryThumb(imageId) {
 	const img = currentSession.images.find(i => i.id === imageId);
-	if (!img) return;
+	if (img) return;
 
 	const statusEl = document.getElementById(`status-${imageId}`);

[NoCoverage] ConditionalExpression
src/index.js:257:6
 	if (!img) return;
 
 	const statusEl = document.getElementById(`status-${imageId}`);
-	if (statusEl) {
+	if (false) {
 		statusEl.className = `gallery-thumb-status ${img.status}`;
 		statusEl.textContent = img.status;

[NoCoverage] BlockStatement
src/index.js:257:16
 	if (!img) return;
 
 	const statusEl = document.getElementById(`status-${imageId}`);
-	if (statusEl) {
-		statusEl.className = `gallery-thumb-status ${img.status}`;
-		statusEl.textContent = img.status;
-	}
+	if (statusEl) {}
 }
 

[NoCoverage] StringLiteral
src/index.js:258:24
 
 	const statusEl = document.getElementById(`status-${imageId}`);
 	if (statusEl) {
-		statusEl.className = `gallery-thumb-status ${img.status}`;
+		statusEl.className = ``;
 		statusEl.textContent = img.status;
 	}

[NoCoverage] EqualityOperator
src/index.js:264:25
 }
 
 async function displaySessionImage(index) {
-	if (!currentSession || index < 0 || index >= currentSession.images.length) return;
+	if (!currentSession || index <= 0 || index >= currentSession.images.length) return;
 
 	currentSession.activeImageIndex = index;

[NoCoverage] EqualityOperator
src/index.js:264:38
 }
 
 async function displaySessionImage(index) {
-	if (!currentSession || index < 0 || index >= currentSession.images.length) return;
+	if (!currentSession || index < 0 || index > currentSession.images.length) return;
 
 	currentSession.activeImageIndex = index;

[NoCoverage] BlockStatement
src/index.js:270:68
 	const img = currentSession.images[index];
 
 	// Update gallery active state
-	document.querySelectorAll('.gallery-thumb').forEach((thumb, i) => {
-		thumb.classList.toggle('active', i === index);
-	});
+	document.querySelectorAll('.gallery-thumb').forEach((thumb, i) => {});
 
 	// Draw image

[NoCoverage] ConditionalExpression
src/index.js:271:36
 
 	// Update gallery active state
 	document.querySelectorAll('.gallery-thumb').forEach((thumb, i) => {
-		thumb.classList.toggle('active', i === index);
+		thumb.classList.toggle('active', true);
 	});
 

[NoCoverage] EqualityOperator
src/index.js:271:36
 
 	// Update gallery active state
 	document.querySelectorAll('.gallery-thumb').forEach((thumb, i) => {
-		thumb.classList.toggle('active', i === index);
+		thumb.classList.toggle('active', i !== index);
 	});
 

[NoCoverage] BlockStatement
src/index.js:275:18
 	});
 
 	// Draw image
-	if (img.bitmap) {
-		currentImageBitmap = img.bitmap;
-		naturalW = img.naturalWidth;
-		naturalH = img.naturalHeight;
-		currentDetections = img.detections || [];
-		currentParsedData = img.parsedData;
-
-		const scale = calculateDisplayScale(naturalW, window.innerWidth);
-		canvas.width = Math.round(naturalW * scale);
-		canvas.height = Math.round(naturalH * scale);
-
-		ctx.clearRect(0, 0, canvas.width, canvas.height);
-		ctx.drawImage(img.bitmap, 0, 0, canvas.width, canvas.height);
-
-		drawOverlaysForSession();
-	}
+	if (img.bitmap) {}
 }
 

[NoCoverage] ConditionalExpression
src/index.js:275:6
 	});
 
 	// Draw image
-	if (img.bitmap) {
+	if (true) {
 		currentImageBitmap = img.bitmap;
 		naturalW = img.naturalWidth;

[NoCoverage] ConditionalExpression
src/index.js:279:23
 		currentImageBitmap = img.bitmap;
 		naturalW = img.naturalWidth;
 		naturalH = img.naturalHeight;
-		currentDetections = img.detections || [];
+		currentDetections = false;
 		currentParsedData = img.parsedData;
 

[NoCoverage] LogicalOperator
src/index.js:279:23
 		currentImageBitmap = img.bitmap;
 		naturalW = img.naturalWidth;
 		naturalH = img.naturalHeight;
-		currentDetections = img.detections || [];
+		currentDetections = img.detections && [];
 		currentParsedData = img.parsedData;
 

[NoCoverage] ArithmeticOperator
src/index.js:283:29
 		currentParsedData = img.parsedData;
 
 		const scale = calculateDisplayScale(naturalW, window.innerWidth);
-		canvas.width = Math.round(naturalW * scale);
+		canvas.width = Math.round(naturalW / scale);
 		canvas.height = Math.round(naturalH * scale);
 

[NoCoverage] ArithmeticOperator
src/index.js:284:30
 
 		const scale = calculateDisplayScale(naturalW, window.innerWidth);
 		canvas.width = Math.round(naturalW * scale);
-		canvas.height = Math.round(naturalH * scale);
+		canvas.height = Math.round(naturalH / scale);
 
 		ctx.clearRect(0, 0, canvas.width, canvas.height);

[NoCoverage] BlockStatement
src/index.js:293:35
 	}
 }
 
-function drawOverlaysForSession() {
-	if (!currentSession || !currentImageBitmap) return;
-
-	const img = currentSession.images[currentSession.activeImageIndex];
-	if (!img || img.status !== 'completed') return;
-
-	drawOverlaysForData(img.bitmap, img.parsedData, img.detections, img.naturalWidth, img.naturalHeight);
-}
+function drawOverlaysForSession() {}
 
 function updateProgress() {

[NoCoverage] ConditionalExpression
src/index.js:294:6
 }
 
 function drawOverlaysForSession() {
-	if (!currentSession || !currentImageBitmap) return;
+	if (false) return;
 
 	const img = currentSession.images[currentSession.activeImageIndex];

[NoCoverage] LogicalOperator
src/index.js:294:6
 }
 
 function drawOverlaysForSession() {
-	if (!currentSession || !currentImageBitmap) return;
+	if (!currentSession && !currentImageBitmap) return;
 
 	const img = currentSession.images[currentSession.activeImageIndex];

[NoCoverage] LogicalOperator
src/index.js:297:6
 	if (!currentSession || !currentImageBitmap) return;
 
 	const img = currentSession.images[currentSession.activeImageIndex];
-	if (!img || img.status !== 'completed') return;
+	if (!img && img.status !== 'completed') return;
 
 	drawOverlaysForData(img.bitmap, img.parsedData, img.detections, img.naturalWidth, img.naturalHeight);
