[NoCoverage] ConditionalExpression
src/index.js:297:14
 	if (!currentSession || !currentImageBitmap) return;
 
 	const img = currentSession.images[currentSession.activeImageIndex];
-	if (!img || img.status !== 'completed') return;
+	if (!img || false) return;
 
 	drawOverlaysForData(img.bitmap, img.parsedData, img.detections, img.naturalWidth, img.naturalHeight);

[NoCoverage] BlockStatement
src/index.js:302:27
 	drawOverlaysForData(img.bitmap, img.parsedData, img.detections, img.naturalWidth, img.naturalHeight);
 }
 
-function updateProgress() {
-	if (!currentSession) return;
-
-	const progress = getSessionProgress(currentSession);
-	progressText.textContent = `Analyzing ${progress.done} of ${progress.total} images...`;
-	progressFill.style.width = `${progress.percentage}%`;
-	progressFill.textContent = `${progress.percentage}%`;
-}
+function updateProgress() {}
 
 function createThumbnailDataUrl(bitmap) {

[NoCoverage] ConditionalExpression
src/index.js:303:6
 }
 
 function updateProgress() {
-	if (!currentSession) return;
+	if (false) return;
 
 	const progress = getSessionProgress(currentSession);

[NoCoverage] ConditionalExpression
src/index.js:303:6
 }
 
 function updateProgress() {
-	if (!currentSession) return;
+	if (true) return;
 
 	const progress = getSessionProgress(currentSession);

[NoCoverage] BlockStatement
src/index.js:311:41
 	progressFill.textContent = `${progress.percentage}%`;
 }
 
-function createThumbnailDataUrl(bitmap) {
-	const thumbCanvas = document.createElement('canvas');
-	const thumbCtx = thumbCanvas.getContext('2d');
-	const maxHeight = 80;
-	const scale = maxHeight / bitmap.height;
-	thumbCanvas.width = bitmap.width * scale;
-	thumbCanvas.height = maxHeight;
-	thumbCtx.drawImage(bitmap, 0, 0, thumbCanvas.width, thumbCanvas.height);
-	return thumbCanvas.toDataURL('image/jpeg', 0.7);
-}
+function createThumbnailDataUrl(bitmap) {}
 
 function drawOverlays() {

[NoCoverage] ArithmeticOperator
src/index.js:315:16
 	const thumbCanvas = document.createElement('canvas');
 	const thumbCtx = thumbCanvas.getContext('2d');
 	const maxHeight = 80;
-	const scale = maxHeight / bitmap.height;
+	const scale = maxHeight * bitmap.height;
 	thumbCanvas.width = bitmap.width * scale;
 	thumbCanvas.height = maxHeight;

[NoCoverage] ArithmeticOperator
src/index.js:316:22
 	const thumbCtx = thumbCanvas.getContext('2d');
 	const maxHeight = 80;
 	const scale = maxHeight / bitmap.height;
-	thumbCanvas.width = bitmap.width * scale;
+	thumbCanvas.width = bitmap.width / scale;
 	thumbCanvas.height = maxHeight;
 	thumbCtx.drawImage(bitmap, 0, 0, thumbCanvas.width, thumbCanvas.height);

[NoCoverage] BlockStatement
src/index.js:322:25
 	return thumbCanvas.toDataURL('image/jpeg', 0.7);
 }
 
-function drawOverlays() {
-	if (!currentImageBitmap || !currentParsedData) return;
-	drawOverlaysForData(currentImageBitmap, currentParsedData, currentDetections, naturalW, naturalH);
-}
+function drawOverlays() {}
 
 function drawOverlaysForData(bitmap, parsedData, detections, natW, natH) {

[NoCoverage] BooleanLiteral
src/index.js:323:6
 }
 
 function drawOverlays() {
-	if (!currentImageBitmap || !currentParsedData) return;
+	if (currentImageBitmap || !currentParsedData) return;
 	drawOverlaysForData(currentImageBitmap, currentParsedData, currentDetections, naturalW, naturalH);
 }

[NoCoverage] LogicalOperator
src/index.js:323:6
 }
 
 function drawOverlays() {
-	if (!currentImageBitmap || !currentParsedData) return;
+	if (!currentImageBitmap && !currentParsedData) return;
 	drawOverlaysForData(currentImageBitmap, currentParsedData, currentDetections, naturalW, naturalH);
 }

[NoCoverage] BooleanLiteral
src/index.js:328:17
 }
 
 function drawOverlaysForData(bitmap, parsedData, detections, natW, natH) {
-	if (!bitmap || !parsedData) return;
+	if (!bitmap || parsedData) return;
 
 	// Redraw base image

[NoCoverage] ConditionalExpression
src/index.js:328:6
 }
 
 function drawOverlaysForData(bitmap, parsedData, detections, natW, natH) {
-	if (!bitmap || !parsedData) return;
+	if (true) return;
 
 	// Redraw base image

[NoCoverage] ArithmeticOperator
src/index.js:334:17
 	ctx.clearRect(0, 0, canvas.width, canvas.height);
 	ctx.drawImage(bitmap, 0, 0, canvas.width, canvas.height);
 
-	const scaleX = canvas.width / natW;
+	const scaleX = canvas.width * natW;
 	const scaleY = canvas.height / natH;
 	const coordSystem = ensureCoordSystem(parsedData, 'normalized_0_1000');

[NoCoverage] ArithmeticOperator
src/index.js:335:17
 	ctx.drawImage(bitmap, 0, 0, canvas.width, canvas.height);
 
 	const scaleX = canvas.width / natW;
-	const scaleY = canvas.height / natH;
+	const scaleY = canvas.height * natH;
 	const coordSystem = ensureCoordSystem(parsedData, 'normalized_0_1000');
 	const coordOrigin = ensureCoordOrigin(parsedData, 'top-left');

[NoCoverage] EqualityOperator
src/index.js:340:25
 	const coordOrigin = ensureCoordOrigin(parsedData, 'top-left');
 
 	for (const d of detections) {
-		const isHighlighted = highlightedDetectionId === d.id;
+		const isHighlighted = highlightedDetectionId !== d.id;
 		const color = colorForCategory(d.category);
 		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;

[NoCoverage] ConditionalExpression
src/index.js:340:25
 	const coordOrigin = ensureCoordOrigin(parsedData, 'top-left');
 
 	for (const d of detections) {
-		const isHighlighted = highlightedDetectionId === d.id;
+		const isHighlighted = false;
 		const color = colorForCategory(d.category);
 		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;

[NoCoverage] EqualityOperator
src/index.js:342:40
 	for (const d of detections) {
 		const isHighlighted = highlightedDetectionId === d.id;
 		const color = colorForCategory(d.category);
-		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;
+		const label = `${d.label ?? 'item'}${typeof d.confidence !== 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;
 
 		if (isHighlighted) {

[NoCoverage] ArithmeticOperator
src/index.js:342:81
 	for (const d of detections) {
 		const isHighlighted = highlightedDetectionId === d.id;
 		const color = colorForCategory(d.category);
-		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;
+		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence / 100).toFixed(0)}%)` : ''}`;
 
 		if (isHighlighted) {

[NoCoverage] ConditionalExpression
src/index.js:344:7
 		const color = colorForCategory(d.category);
 		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;
 
-		if (isHighlighted) {
+		if (false) {
 			ctx.save();
 			ctx.shadowColor = color;

[NoCoverage] BlockStatement
src/index.js:344:22
 		const color = colorForCategory(d.category);
 		const label = `${d.label ?? 'item'}${typeof d.confidence === 'number' ? ` (${(d.confidence*100).toFixed(0)}%)` : ''}`;
 
-		if (isHighlighted) {
-			ctx.save();
-			ctx.shadowColor = color;
-			ctx.shadowBlur = 15;
-		}
+		if (isHighlighted) {}
 
 		if (d.bbox) {

[NoCoverage] BlockStatement
src/index.js:350:15
 			ctx.shadowBlur = 15;
 		}
 
-		if (d.bbox) {
-			const b = toCanvasBox(
-				d.bbox,
-				coordSystem,
-				scaleX,
-				scaleY,
-				natW,
-				natH,
-				coordOrigin,
-				canvas.width,
-				canvas.height
-			);
-			if (b) {
-				if (isHighlighted) ctx.lineWidth = 4;
-				drawBox(b, label, color);
-			}
-		}
+		if (d.bbox) {}
 		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);

[NoCoverage] ConditionalExpression
src/index.js:350:7
 			ctx.shadowBlur = 15;
 		}
 
-		if (d.bbox) {
+		if (true) {
 			const b = toCanvasBox(
 				d.bbox,

[NoCoverage] ConditionalExpression
src/index.js:362:8
 				canvas.width,
 				canvas.height
 			);
-			if (b) {
+			if (false) {
 				if (isHighlighted) ctx.lineWidth = 4;
 				drawBox(b, label, color);

[NoCoverage] ConditionalExpression
src/index.js:362:8
 				canvas.width,
 				canvas.height
 			);
-			if (b) {
+			if (true) {
 				if (isHighlighted) ctx.lineWidth = 4;
 				drawBox(b, label, color);

[NoCoverage] ConditionalExpression
src/index.js:363:9
 				canvas.height
 			);
 			if (b) {
-				if (isHighlighted) ctx.lineWidth = 4;
+				if (true) ctx.lineWidth = 4;
 				drawBox(b, label, color);
 			}

[NoCoverage] ConditionalExpression
src/index.js:363:9
 				canvas.height
 			);
 			if (b) {
-				if (isHighlighted) ctx.lineWidth = 4;
+				if (false) ctx.lineWidth = 4;
 				drawBox(b, label, color);
 			}

[NoCoverage] EqualityOperator
src/index.js:367:35
 				drawBox(b, label, color);
 			}
 		}
-		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
+		if (Array.isArray(d.polygon) && d.polygon.length < 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
 			if (pts) {

[NoCoverage] EqualityOperator
src/index.js:367:35
 				drawBox(b, label, color);
 			}
 		}
-		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
+		if (Array.isArray(d.polygon) && d.polygon.length > 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
 			if (pts) {

[NoCoverage] ConditionalExpression
src/index.js:369:8
 		}
 		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
-			if (pts) {
+			if (true) {
 				if (isHighlighted) ctx.lineWidth = 4;
 				drawPolygon(pts, label, color);

[NoCoverage] BlockStatement
src/index.js:369:13
 		}
 		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
-			if (pts) {
-				if (isHighlighted) ctx.lineWidth = 4;
-				drawPolygon(pts, label, color);
-			}
+			if (pts) {}
 		}
 

[NoCoverage] ConditionalExpression
src/index.js:370:9
 		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
 			if (pts) {
-				if (isHighlighted) ctx.lineWidth = 4;
+				if (true) ctx.lineWidth = 4;
 				drawPolygon(pts, label, color);
 			}

[NoCoverage] ConditionalExpression
src/index.js:370:9
 		if (Array.isArray(d.polygon) && d.polygon.length >= 3) {
 			const pts = toCanvasPolygon(d.polygon, coordSystem, scaleX, scaleY, natW, natH, coordOrigin);
 			if (pts) {
-				if (isHighlighted) ctx.lineWidth = 4;
+				if (false) ctx.lineWidth = 4;
 				drawPolygon(pts, label, color);
 			}

[NoCoverage] ConditionalExpression
src/index.js:375:7
 			}
 		}
 
-		if (isHighlighted) {
+		if (true) {
 			ctx.restore();
 		}

[NoCoverage] BlockStatement
src/index.js:381:28
 	}
 }
 
-function getStoredApiKey() {
-	try {
-		return globalThis.localStorage?.getItem(STORAGE_KEY) || '';
-	} catch {
-		return '';
-	}
-}
+function getStoredApiKey() {}
 
 function persistApiKey(value) {

[NoCoverage] BlockStatement
src/index.js:382:6
 }
 
 function getStoredApiKey() {
-	try {
-		return globalThis.localStorage?.getItem(STORAGE_KEY) || '';
-	} catch {
+	try {} catch {
 		return '';
 	}

[NoCoverage] OptionalChaining
src/index.js:383:10
 
 function getStoredApiKey() {
 	try {
-		return globalThis.localStorage?.getItem(STORAGE_KEY) || '';
+		return globalThis.localStorage.getItem(STORAGE_KEY) || '';
 	} catch {
 		return '';

[NoCoverage] ConditionalExpression
src/index.js:383:10
 
 function getStoredApiKey() {
 	try {
-		return globalThis.localStorage?.getItem(STORAGE_KEY) || '';
+		return false;
 	} catch {
 		return '';

[NoCoverage] BlockStatement
src/index.js:384:10
 function getStoredApiKey() {
 	try {
 		return globalThis.localStorage?.getItem(STORAGE_KEY) || '';
-	} catch {
-		return '';
-	}
+	} catch {}
 }
 

[NoCoverage] BlockStatement
src/index.js:389:31
 	}
 }
 
-function persistApiKey(value) {
-	try {
-		const trimmed = value.trim();
-		if (trimmed) {
-			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
-		} else {
-			globalThis.localStorage?.removeItem(STORAGE_KEY);
-		}
-	} catch {
-		// Ignore storage errors (private mode, quotas, etc.)
-	}
-}
+function persistApiKey(value) {}
 
 const storedApiKey = getStoredApiKey();

[NoCoverage] BlockStatement
src/index.js:390:6
 }
 
 function persistApiKey(value) {
-	try {
-		const trimmed = value.trim();
-		if (trimmed) {
-			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
-		} else {
-			globalThis.localStorage?.removeItem(STORAGE_KEY);
-		}
-	} catch {
+	try {} catch {
 		// Ignore storage errors (private mode, quotas, etc.)
 	}

[NoCoverage] MethodExpression
src/index.js:391:19
 
 function persistApiKey(value) {
 	try {
-		const trimmed = value.trim();
+		const trimmed = value;
 		if (trimmed) {
 			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);

[NoCoverage] ConditionalExpression
src/index.js:392:7
 function persistApiKey(value) {
 	try {
 		const trimmed = value.trim();
-		if (trimmed) {
+		if (false) {
 			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
 		} else {

[NoCoverage] ConditionalExpression
src/index.js:392:7
 function persistApiKey(value) {
 	try {
 		const trimmed = value.trim();
-		if (trimmed) {
+		if (true) {
 			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
 		} else {

[NoCoverage] OptionalChaining
src/index.js:393:4
 	try {
 		const trimmed = value.trim();
 		if (trimmed) {
-			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
+			globalThis.localStorage.setItem(STORAGE_KEY, trimmed);
 		} else {
 			globalThis.localStorage?.removeItem(STORAGE_KEY);

[NoCoverage] BlockStatement
src/index.js:394:10
 		const trimmed = value.trim();
 		if (trimmed) {
 			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
-		} else {
-			globalThis.localStorage?.removeItem(STORAGE_KEY);
-		}
+		} else {}
 	} catch {
 		// Ignore storage errors (private mode, quotas, etc.)

[NoCoverage] OptionalChaining
src/index.js:395:4
 		if (trimmed) {
 			globalThis.localStorage?.setItem(STORAGE_KEY, trimmed);
 		} else {
-			globalThis.localStorage?.removeItem(STORAGE_KEY);
+			globalThis.localStorage.removeItem(STORAGE_KEY);
 		}
 	} catch {

[NoCoverage] BlockStatement
src/index.js:403:19
 }
 
 const storedApiKey = getStoredApiKey();
-if (storedApiKey) {
-	apiKeyEl.value = storedApiKey;
-}
+if (storedApiKey) {}
 
 function toBase64(file) {

[NoCoverage] ConditionalExpression
src/index.js:403:5
 }
 
 const storedApiKey = getStoredApiKey();
-if (storedApiKey) {
+if (true) {
 	apiKeyEl.value = storedApiKey;
 }

[NoCoverage] BlockStatement
src/index.js:407:25
 	apiKeyEl.value = storedApiKey;
 }
 
-function toBase64(file) {
-	return new Promise((res, rej) => {
-		const r = new FileReader();
-		r.onload = () => res(extractBase64FromDataUrl(String(r.result)));
-		r.onerror = rej;
-		r.readAsDataURL(file);
-	});
-}
+function toBase64(file) {}
 
 async function drawImage(file) {

[NoCoverage] BlockStatement
src/index.js:408:35
 }
 
 function toBase64(file) {
-	return new Promise((res, rej) => {
-		const r = new FileReader();
-		r.onload = () => res(extractBase64FromDataUrl(String(r.result)));
-		r.onerror = rej;
-		r.readAsDataURL(file);
-	});
+	return new Promise((res, rej) => {});
 }
 

[NoCoverage] ArrowFunction
src/index.js:410:14
 function toBase64(file) {
 	return new Promise((res, rej) => {
 		const r = new FileReader();
-		r.onload = () => res(extractBase64FromDataUrl(String(r.result)));
+		r.onload = () => undefined;
 		r.onerror = rej;
 		r.readAsDataURL(file);

[NoCoverage] BlockStatement
src/index.js:416:32
 	});
 }
 
-async function drawImage(file) {
-	const bmp = await createImageBitmap(file);
-	currentImageBitmap = bmp;
-	naturalW = bmp.width;
-	naturalH = bmp.height;
-	// Fit to viewport width but keep full resolution internally
-	const scale = calculateDisplayScale(naturalW, window.innerWidth);
-	canvas.width  = Math.round(naturalW * scale);
-	canvas.height = Math.round(naturalH * scale);
-	// Draw scaled image
-	ctx.clearRect(0,0,canvas.width,canvas.height);
-	ctx.drawImage(bmp, 0, 0, canvas.width, canvas.height);
-	return { scaleX: scale, scaleY: scale };
-}
+async function drawImage(file) {}
 
 function setDrag(drag) {

[NoCoverage] ObjectLiteral
src/index.js:428:9
 	// Draw scaled image
 	ctx.clearRect(0,0,canvas.width,canvas.height);
 	ctx.drawImage(bmp, 0, 0, canvas.width, canvas.height);
-	return { scaleX: scale, scaleY: scale };
+	return {};
 }
 

[NoCoverage] BlockStatement
src/index.js:431:24
 	return { scaleX: scale, scaleY: scale };
 }
 
-function setDrag(drag) {
-	dropzone.classList.toggle('drag', !!drag);
-}
+function setDrag(drag) {}
 
 function drawLabelBox(x, y, text) {

[NoCoverage] BooleanLiteral
src/index.js:432:37
 }
 
 function setDrag(drag) {
-	dropzone.classList.toggle('drag', !!drag);
+	dropzone.classList.toggle('drag', !drag);
 }
 

[NoCoverage] BlockStatement
src/index.js:435:35
 	dropzone.classList.toggle('drag', !!drag);
 }
 
-function drawLabelBox(x, y, text) {
-	ctx.save();
-	ctx.font = '12px ui-sans-serif, system-ui, -apple-system';
-	const pad = 4;
-	const metrics = ctx.measureText(text);
-	const w = metrics.width + pad*2;
-	const h = 16 + pad*2;
-	ctx.fillStyle = 'rgba(0,0,0,0.6)';
-	ctx.fillRect(x, Math.max(0, y - h), w, h);
-	ctx.fillStyle = '#ffffff';
-	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));
-	ctx.restore();
-}
+function drawLabelBox(x, y, text) {}
 
 function drawBox(b, label, color) {

[NoCoverage] StringLiteral
src/index.js:437:13
 
 function drawLabelBox(x, y, text) {
 	ctx.save();
-	ctx.font = '12px ui-sans-serif, system-ui, -apple-system';
+	ctx.font = "";
 	const pad = 4;
 	const metrics = ctx.measureText(text);

[NoCoverage] ArithmeticOperator
src/index.js:440:28
 	ctx.font = '12px ui-sans-serif, system-ui, -apple-system';
 	const pad = 4;
 	const metrics = ctx.measureText(text);
-	const w = metrics.width + pad*2;
+	const w = metrics.width + pad / 2;
 	const h = 16 + pad*2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';

[NoCoverage] ArithmeticOperator
src/index.js:440:12
 	ctx.font = '12px ui-sans-serif, system-ui, -apple-system';
 	const pad = 4;
 	const metrics = ctx.measureText(text);
-	const w = metrics.width + pad*2;
+	const w = metrics.width - pad * 2;
 	const h = 16 + pad*2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';

[NoCoverage] ArithmeticOperator
src/index.js:441:17
 	const pad = 4;
 	const metrics = ctx.measureText(text);
 	const w = metrics.width + pad*2;
-	const h = 16 + pad*2;
+	const h = 16 + pad / 2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
 	ctx.fillRect(x, Math.max(0, y - h), w, h);

[NoCoverage] ArithmeticOperator
src/index.js:441:12
 	const pad = 4;
 	const metrics = ctx.measureText(text);
 	const w = metrics.width + pad*2;
-	const h = 16 + pad*2;
+	const h = 16 - pad * 2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
 	ctx.fillRect(x, Math.max(0, y - h), w, h);

[NoCoverage] ArithmeticOperator
src/index.js:443:30
 	const w = metrics.width + pad*2;
 	const h = 16 + pad*2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
-	ctx.fillRect(x, Math.max(0, y - h), w, h);
+	ctx.fillRect(x, Math.max(0, y + h), w, h);
 	ctx.fillStyle = '#ffffff';
 	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));

[NoCoverage] MethodExpression
src/index.js:443:18
 	const w = metrics.width + pad*2;
 	const h = 16 + pad*2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
-	ctx.fillRect(x, Math.max(0, y - h), w, h);
+	ctx.fillRect(x, Math.min(0, y - h), w, h);
 	ctx.fillStyle = '#ffffff';
 	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));

[NoCoverage] StringLiteral
src/index.js:444:18
 	const h = 16 + pad*2;
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
 	ctx.fillRect(x, Math.max(0, y - h), w, h);
-	ctx.fillStyle = '#ffffff';
+	ctx.fillStyle = "";
 	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));
 	ctx.restore();

[NoCoverage] ArithmeticOperator
src/index.js:445:39
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
 	ctx.fillRect(x, Math.max(0, y - h), w, h);
 	ctx.fillStyle = '#ffffff';
-	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));
+	ctx.fillText(text, x + pad, Math.max(12 - (y - h) + pad, 12));
 	ctx.restore();
 }

[NoCoverage] MethodExpression
src/index.js:445:30
 	ctx.fillStyle = 'rgba(0,0,0,0.6)';
 	ctx.fillRect(x, Math.max(0, y - h), w, h);
 	ctx.fillStyle = '#ffffff';
-	ctx.fillText(text, x + pad, Math.max(12 + (y - h) + pad, 12));
+	ctx.fillText(text, x + pad, Math.min(12 + (y - h) + pad, 12));
 	ctx.restore();
 }

[NoCoverage] BlockStatement
src/index.js:449:35
 	ctx.restore();
 }
 
-function drawBox(b, label, color) {
-	ctx.save();
-	ctx.lineWidth = 2;
-	ctx.strokeStyle = color;
-	ctx.strokeRect(b.x, b.y, b.width, b.height);
-	drawLabelBox(b.x, b.y, label);
-	ctx.restore();
-}
+function drawBox(b, label, color) {}
 
 function drawPolygon(points, label, color) {

[NoCoverage] BlockStatement
src/index.js:458:44
 	ctx.restore();
 }
 
-function drawPolygon(points, label, color) {
-	if (!points || points.length < 3) return;
-	ctx.save();
-	ctx.lineWidth = 2;
-	ctx.strokeStyle = color;
-	ctx.beginPath();
-	ctx.moveTo(points[0].x, points[0].y);
-	for (let i = 1; i < points.length; i++) ctx.lineTo(points[i].x, points[i].y);
-	ctx.closePath();
-	ctx.stroke();
-	// Label near first vertex
-	drawLabelBox(points[0].x, points[0].y, label);
-	ctx.restore();
-}
+function drawPolygon(points, label, color) {}
 
 // colorForCategory is now imported from ui-utils.js

[NoCoverage] EqualityOperator
src/index.js:459:17
 }
 
 function drawPolygon(points, label, color) {
-	if (!points || points.length < 3) return;
+	if (!points || points.length <= 3) return;
 	ctx.save();
 	ctx.lineWidth = 2;

[NoCoverage] EqualityOperator
src/index.js:459:17
 }
 
 function drawPolygon(points, label, color) {
-	if (!points || points.length < 3) return;
+	if (!points || points.length >= 3) return;
 	ctx.save();
 	ctx.lineWidth = 2;

[NoCoverage] EqualityOperator
src/index.js:465:18
 	ctx.strokeStyle = color;
 	ctx.beginPath();
 	ctx.moveTo(points[0].x, points[0].y);
-	for (let i = 1; i < points.length; i++) ctx.lineTo(points[i].x, points[i].y);
+	for (let i = 1; i <= points.length; i++) ctx.lineTo(points[i].x, points[i].y);
 	ctx.closePath();
 	ctx.stroke();

[NoCoverage] UpdateOperator
src/index.js:465:37
 	ctx.strokeStyle = color;
 	ctx.beginPath();
 	ctx.moveTo(points[0].x, points[0].y);
-	for (let i = 1; i < points.length; i++) ctx.lineTo(points[i].x, points[i].y);
+	for (let i = 1; i < points.length; i--) ctx.lineTo(points[i].x, points[i].y);
 	ctx.closePath();
 	ctx.stroke();

[NoCoverage] ConditionalExpression
src/index.js:478:31
 async function callGeminiREST({ apiKey, model, file }) {
 	const base64 = await toBase64(file);
 	const parts = [
-		{ inline_data: { mime_type: file.type || 'image/jpeg', data: base64 } },
+		{ inline_data: { mime_type: false, data: base64 } },
 		{ text: AEC_PROMPT }
 	];

[NoCoverage] ConditionalExpression
src/index.js:478:31
 async function callGeminiREST({ apiKey, model, file }) {
 	const base64 = await toBase64(file);
 	const parts = [
-		{ inline_data: { mime_type: file.type || 'image/jpeg', data: base64 } },
+		{ inline_data: { mime_type: true, data: base64 } },
 		{ text: AEC_PROMPT }
 	];

[NoCoverage] ObjectLiteral
src/index.js:479:3
 	const base64 = await toBase64(file);
 	const parts = [
 		{ inline_data: { mime_type: file.type || 'image/jpeg', data: base64 } },
-		{ text: AEC_PROMPT }
+		{}
 	];
 

[NoCoverage] ArrayDeclaration
src/index.js:484:13
 
 	// Build two payload flavors: snake_case (REST-preferred) and camelCase (fallback)
 	const snake = {
-		contents: [{ parts }],
+		contents: [],
 		generationConfig: {
 			response_mime_type: "application/json",

[NoCoverage] ObjectLiteral
src/index.js:484:14
 
 	// Build two payload flavors: snake_case (REST-preferred) and camelCase (fallback)
 	const snake = {
-		contents: [{ parts }],
+		contents: [{}],
 		generationConfig: {
 			response_mime_type: "application/json",

[NoCoverage] ObjectLiteral
src/index.js:485:21
 	// Build two payload flavors: snake_case (REST-preferred) and camelCase (fallback)
 	const snake = {
 		contents: [{ parts }],
-		generationConfig: {
-			response_mime_type: "application/json",
-			response_schema: RESPONSE_SCHEMA
-		}
+		generationConfig: {}
 	};
 	const camel = {

[NoCoverage] StringLiteral
src/index.js:486:24
 	const snake = {
 		contents: [{ parts }],
 		generationConfig: {
-			response_mime_type: "application/json",
+			response_mime_type: "",
 			response_schema: RESPONSE_SCHEMA
 		}

[NoCoverage] ArrayDeclaration
src/index.js:491:13
 		}
 	};
 	const camel = {
-		contents: [{ parts }],
+		contents: [],
 		generationConfig: {
 			responseMimeType: "application/json",

[NoCoverage] BlockStatement
src/index.js:499:28
 	};
 
 	const url = `https://generativelanguage.googleapis.com/v1beta/models/${encodeURIComponent(model)}:generateContent`;
-	async function post(body) {
-		const r = await fetch(url, {
-			method: 'POST',
-			headers: {
-				'Content-Type': 'application/json',
-				'x-goog-api-key': apiKey
-			},
-			body: JSON.stringify(body)
-		});
-		const data = await r.json().catch(() => ({}));
-		if (!r.ok) {
-			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;
-			throw new Error(msg);
-		}
-		return data;
-	}
+	async function post(body) {}
 
 	try {

[NoCoverage] ArrowFunction
src/index.js:508:37
 			},
 			body: JSON.stringify(body)
 		});
-		const data = await r.json().catch(() => ({}));
+		const data = await r.json().catch(() => undefined);
 		if (!r.ok) {
 			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;

[NoCoverage] BooleanLiteral
src/index.js:509:7
 			body: JSON.stringify(body)
 		});
 		const data = await r.json().catch(() => ({}));
-		if (!r.ok) {
+		if (r.ok) {
 			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;
 			throw new Error(msg);

[NoCoverage] ConditionalExpression
src/index.js:509:7
 			body: JSON.stringify(body)
 		});
 		const data = await r.json().catch(() => ({}));
-		if (!r.ok) {
+		if (true) {
 			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;
 			throw new Error(msg);

[NoCoverage] ConditionalExpression
src/index.js:510:16
 		});
 		const data = await r.json().catch(() => ({}));
 		if (!r.ok) {
-			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;
+			const msg = true;
 			throw new Error(msg);
 		}

[NoCoverage] ConditionalExpression
src/index.js:510:26
 		});
 		const data = await r.json().catch(() => ({}));
 		if (!r.ok) {
-			const msg = (data && (data.error?.message || data.candidates?.[0]?.finishReason)) || `HTTP ${r.status}`;
+			const msg = (data && (true)) || `HTTP ${r.status}`;
 			throw new Error(msg);
 		}

[NoCoverage] BlockStatement
src/index.js:516:6
 		return data;
 	}
 
-	try {
-		return await post(snake);
-	} catch (e1) {
+	try {} catch (e1) {
 		// Retry with camelCase schema fields if the first fails
 		try {

[NoCoverage] BlockStatement
src/index.js:518:15
 
 	try {
 		return await post(snake);
-	} catch (e1) {
-		// Retry with camelCase schema fields if the first fails
-		try {
-			return await post(camel);
-		} catch (e2) {
-			throw new Error(`Gemini call failed.\nFirst: ${e1.message}\nThen: ${e2.message}`);
-		}
-	}
+	} catch (e1) {}
 }
 

[NoCoverage] BlockStatement
src/index.js:520:7
 		return await post(snake);
 	} catch (e1) {
 		// Retry with camelCase schema fields if the first fails
-		try {
-			return await post(camel);
-		} catch (e2) {
+		try {} catch (e2) {
 			throw new Error(`Gemini call failed.\nFirst: ${e1.message}\nThen: ${e2.message}`);
 		}

[NoCoverage] BlockStatement
src/index.js:522:16
 		// Retry with camelCase schema fields if the first fails
 		try {
 			return await post(camel);
-		} catch (e2) {
-			throw new Error(`Gemini call failed.\nFirst: ${e1.message}\nThen: ${e2.message}`);
-		}
+		} catch (e2) {}
 	}
 }

[NoCoverage] BooleanLiteral
src/index.js:530:59
 
 // extractJSONFromResponse is now imported from ui-utils.js
 
-async function analyzeCurrentImage({ silentOnMissingKey = false } = {}) {
+async function analyzeCurrentImage({ silentOnMissingKey = true } = {}) {
 	const apiKey = apiKeyEl.value.trim();
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';

[NoCoverage] MethodExpression
src/index.js:531:17
 // extractJSONFromResponse is now imported from ui-utils.js
 
 async function analyzeCurrentImage({ silentOnMissingKey = false } = {}) {
-	const apiKey = apiKeyEl.value.trim();
+	const apiKey = apiKeyEl.value;
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
 

[NoCoverage] ConditionalExpression
src/index.js:532:17
 
 async function analyzeCurrentImage({ silentOnMissingKey = false } = {}) {
 	const apiKey = apiKeyEl.value.trim();
-	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
+	const model  = true;
 
 	if (!apiKey) {

[NoCoverage] ConditionalExpression
src/index.js:534:6
 	const apiKey = apiKeyEl.value.trim();
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
 
-	if (!apiKey) {
+	if (true) {
 		if (!silentOnMissingKey) {
 			logJson({ error: 'Missing API key' }, 'Error');

[NoCoverage] ConditionalExpression
src/index.js:534:6
 	const apiKey = apiKeyEl.value.trim();
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
 
-	if (!apiKey) {
+	if (false) {
 		if (!silentOnMissingKey) {
 			logJson({ error: 'Missing API key' }, 'Error');

[NoCoverage] ConditionalExpression
src/index.js:535:7
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
 
 	if (!apiKey) {
-		if (!silentOnMissingKey) {
+		if (false) {
 			logJson({ error: 'Missing API key' }, 'Error');
 		}
