[NoCoverage] BooleanLiteral
src/index.js:535:7
 	const model  = modelEl.value.trim() || 'gemini-2.5-pro';
 
 	if (!apiKey) {
-		if (!silentOnMissingKey) {
+		if (silentOnMissingKey) {
 			logJson({ error: 'Missing API key' }, 'Error');
 		}

[NoCoverage] ConditionalExpression
src/index.js:541:6
 		return;
 	}
 
-	if (!currentFile) {
+	if (false) {
 		if (!silentOnMissingKey) {
 			logJson({ error: 'No image selected' }, 'Error');

[NoCoverage] ConditionalExpression
src/index.js:541:6
 		return;
 	}
 
-	if (!currentFile) {
+	if (true) {
 		if (!silentOnMissingKey) {
 			logJson({ error: 'No image selected' }, 'Error');

[NoCoverage] BlockStatement
src/index.js:542:28
 	}
 
 	if (!currentFile) {
-		if (!silentOnMissingKey) {
-			logJson({ error: 'No image selected' }, 'Error');
-		}
+		if (!silentOnMissingKey) {}
 		return;
 	}

[NoCoverage] ConditionalExpression
src/index.js:542:7
 	}
 
 	if (!currentFile) {
-		if (!silentOnMissingKey) {
+		if (false) {
 			logJson({ error: 'No image selected' }, 'Error');
 		}

[NoCoverage] ObjectLiteral
src/index.js:543:12
 
 	if (!currentFile) {
 		if (!silentOnMissingKey) {
-			logJson({ error: 'No image selected' }, 'Error');
+			logJson({}, 'Error');
 		}
 		return;

[NoCoverage] BooleanLiteral
src/index.js:549:26
 	}
 
 	persistApiKey(apiKey);
-	pendingApiKeyAnalysis = false;
+	pendingApiKeyAnalysis = true;
 
 	if (isAnalyzing) {

[NoCoverage] ConditionalExpression
src/index.js:551:6
 	persistApiKey(apiKey);
 	pendingApiKeyAnalysis = false;
 
-	if (isAnalyzing) {
+	if (true) {
 		analysisQueued = true;
 		return;

[NoCoverage] BlockStatement
src/index.js:551:19
 	persistApiKey(apiKey);
 	pendingApiKeyAnalysis = false;
 
-	if (isAnalyzing) {
-		analysisQueued = true;
-		return;
-	}
+	if (isAnalyzing) {}
 
 	isAnalyzing = true;

[NoCoverage] BooleanLiteral
src/index.js:552:20
 	pendingApiKeyAnalysis = false;
 
 	if (isAnalyzing) {
-		analysisQueued = true;
+		analysisQueued = false;
 		return;
 	}

[NoCoverage] BooleanLiteral
src/index.js:556:16
 		return;
 	}
 
-	isAnalyzing = true;
+	isAnalyzing = false;
 	analysisQueued = false;
 

[NoCoverage] BooleanLiteral
src/index.js:557:19
 	}
 
 	isAnalyzing = true;
-	analysisQueued = false;
+	analysisQueued = true;
 
 	clearReport();

[NoCoverage] ConditionalExpression
src/index.js:564:6
 	currentParsedData = null;
 	highlightedDetectionId = null;
 
-	if (currentImageBitmap) {
+	if (false) {
 		ctx.clearRect(0,0,canvas.width,canvas.height);
 		ctx.drawImage(currentImageBitmap, 0, 0, canvas.width, canvas.height);

[NoCoverage] ConditionalExpression
src/index.js:564:6
 	currentParsedData = null;
 	highlightedDetectionId = null;
 
-	if (currentImageBitmap) {
+	if (true) {
 		ctx.clearRect(0,0,canvas.width,canvas.height);
 		ctx.drawImage(currentImageBitmap, 0, 0, canvas.width, canvas.height);

[NoCoverage] ObjectLiteral
src/index.js:569:10
 		ctx.drawImage(currentImageBitmap, 0, 0, canvas.width, canvas.height);
 	}
 
-	logJson({ status: 'Calling Gemini…' });
+	logJson({});
 
 	try {

[NoCoverage] StringLiteral
src/index.js:578:29
 		prepareDetectionData(parsed, naturalW, naturalH);
 
 		const coordSystem = ensureCoordSystem(parsed, 'normalized_0_1000');
-		ensureCoordOrigin(parsed, 'top-left');
+		ensureCoordOrigin(parsed, "");
 		if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
 

[NoCoverage] ConditionalExpression
src/index.js:579:7
 
 		const coordSystem = ensureCoordSystem(parsed, 'normalized_0_1000');
 		ensureCoordOrigin(parsed, 'top-left');
-		if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
+		if (false) parsed.image.coordSystem = coordSystem;
 
 		currentParsedData = parsed;

[NoCoverage] ArrayDeclaration
src/index.js:582:78
 		if (parsed.image.coordSystem == null) parsed.image.coordSystem = coordSystem;
 
 		currentParsedData = parsed;
-		currentDetections = Array.isArray(parsed.detections) ? parsed.detections : [];
+		currentDetections = Array.isArray(parsed.detections) ? parsed.detections : ["Stryker was here"];
 
 		drawOverlays();

[NoCoverage] BlockStatement
src/index.js:592:19
 		setupReportInteractions(
 			reportWrap,
 			currentDetections,
-			(detection) => {
-				highlightedDetectionId = detection.id;
-				drawOverlays();
-			},
+			(detection) => {},
 			() => {
 				highlightedDetectionId = null;

[NoCoverage] BlockStatement
src/index.js:596:10
 				highlightedDetectionId = detection.id;
 				drawOverlays();
 			},
-			() => {
-				highlightedDetectionId = null;
-				drawOverlays();
-			}
+			() => {}
 		);
 

[NoCoverage] BlockStatement
src/index.js:603:16
 		);
 
 		logJson(parsed, 'Model JSON');
-	} catch (err) {
-		clearReport();
-		logJson({ error: String(err?.message || err) }, 'Error');
-	} finally {
+	} catch (err) {} finally {
 		isAnalyzing = false;
 		if (analysisQueued) {

[NoCoverage] OptionalChaining
src/index.js:605:27
 		logJson(parsed, 'Model JSON');
 	} catch (err) {
 		clearReport();
-		logJson({ error: String(err?.message || err) }, 'Error');
+		logJson({ error: String(err.message || err) }, 'Error');
 	} finally {
 		isAnalyzing = false;

[NoCoverage] LogicalOperator
src/index.js:605:27
 		logJson(parsed, 'Model JSON');
 	} catch (err) {
 		clearReport();
-		logJson({ error: String(err?.message || err) }, 'Error');
+		logJson({ error: String(err?.message && err) }, 'Error');
 	} finally {
 		isAnalyzing = false;

[NoCoverage] BlockStatement
src/index.js:606:12
 	} catch (err) {
 		clearReport();
 		logJson({ error: String(err?.message || err) }, 'Error');
-	} finally {
-		isAnalyzing = false;
-		if (analysisQueued) {
-			analysisQueued = false;
-			await analyzeCurrentImage({ silentOnMissingKey: true });
-		}
-	}
+	} finally {}
 }
 

[NoCoverage] BooleanLiteral
src/index.js:607:17
 		clearReport();
 		logJson({ error: String(err?.message || err) }, 'Error');
 	} finally {
-		isAnalyzing = false;
+		isAnalyzing = true;
 		if (analysisQueued) {
 			analysisQueued = false;

[NoCoverage] ConditionalExpression
src/index.js:608:7
 		logJson({ error: String(err?.message || err) }, 'Error');
 	} finally {
 		isAnalyzing = false;
-		if (analysisQueued) {
+		if (false) {
 			analysisQueued = false;
 			await analyzeCurrentImage({ silentOnMissingKey: true });

[NoCoverage] ConditionalExpression
src/index.js:608:7
 		logJson({ error: String(err?.message || err) }, 'Error');
 	} finally {
 		isAnalyzing = false;
-		if (analysisQueued) {
+		if (true) {
 			analysisQueued = false;
 			await analyzeCurrentImage({ silentOnMissingKey: true });

[NoCoverage] BooleanLiteral
src/index.js:609:21
 	} finally {
 		isAnalyzing = false;
 		if (analysisQueued) {
-			analysisQueued = false;
+			analysisQueued = true;
 			await analyzeCurrentImage({ silentOnMissingKey: true });
 		}

[NoCoverage] BooleanLiteral
src/index.js:610:52
 		isAnalyzing = false;
 		if (analysisQueued) {
 			analysisQueued = false;
-			await analyzeCurrentImage({ silentOnMissingKey: true });
+			await analyzeCurrentImage({ silentOnMissingKey: false });
 		}
 	}

[NoCoverage] BooleanLiteral
src/index.js:616:6
 }
 
 async function handleFileSelection(file) {
-	if (!file) return;
+	if (file) return;
 
 	currentFile = file;

[NoCoverage] ConditionalExpression
src/index.js:616:6
 }
 
 async function handleFileSelection(file) {
-	if (!file) return;
+	if (false) return;
 
 	currentFile = file;

[NoCoverage] BooleanLiteral
src/index.js:622:19
 	currentParsedData = null;
 	currentDetections = [];
 	highlightedDetectionId = null;
-	analysisQueued = false;
+	analysisQueued = true;
 
 	try {

[NoCoverage] BlockStatement
src/index.js:624:6
 	highlightedDetectionId = null;
 	analysisQueued = false;
 
-	try {
-		await drawImage(file);
-	} catch (err) {
+	try {} catch (err) {
 		logJson({ error: `Failed to load image: ${String(err?.message || err)}` }, 'Error');
 		return;

[NoCoverage] BlockStatement
src/index.js:626:16
 
 	try {
 		await drawImage(file);
-	} catch (err) {
-		logJson({ error: `Failed to load image: ${String(err?.message || err)}` }, 'Error');
-		return;
-	}
+	} catch (err) {}
 
 	clearReport();

[NoCoverage] ConditionalExpression
src/index.js:627:52
 	try {
 		await drawImage(file);
 	} catch (err) {
-		logJson({ error: `Failed to load image: ${String(err?.message || err)}` }, 'Error');
+		logJson({ error: `Failed to load image: ${String(false)}` }, 'Error');
 		return;
 	}

[NoCoverage] LogicalOperator
src/index.js:627:52
 	try {
 		await drawImage(file);
 	} catch (err) {
-		logJson({ error: `Failed to load image: ${String(err?.message || err)}` }, 'Error');
+		logJson({ error: `Failed to load image: ${String(err?.message && err)}` }, 'Error');
 		return;
 	}

[NoCoverage] BlockStatement
src/index.js:634:15
 	clearReport();
 
 	const apiKey = apiKeyEl.value.trim();
-	if (!apiKey) {
-		pendingApiKeyAnalysis = true;
-		logJson({ message: 'Image loaded. Enter your API key to start analysis.' });
-		return;
-	}
+	if (!apiKey) {}
 
 	pendingApiKeyAnalysis = false;

[NoCoverage] BooleanLiteral
src/index.js:634:6
 	clearReport();
 
 	const apiKey = apiKeyEl.value.trim();
-	if (!apiKey) {
+	if (apiKey) {
 		pendingApiKeyAnalysis = true;
 		logJson({ message: 'Image loaded. Enter your API key to start analysis.' });

[NoCoverage] BooleanLiteral
src/index.js:641:50
 	}
 
 	pendingApiKeyAnalysis = false;
-	await analyzeCurrentImage({ silentOnMissingKey: true });
+	await analyzeCurrentImage({ silentOnMissingKey: false });
 }
 

[NoCoverage] ArrowFunction
src/index.js:645:36
 }
 
 // ---------- Event wiring ----------
-dropzone.addEventListener('click', () => fileEl.click());
+dropzone.addEventListener('click', () => undefined);
 
 dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });

[NoCoverage] StringLiteral
src/index.js:645:27
 }
 
 // ---------- Event wiring ----------
-dropzone.addEventListener('click', () => fileEl.click());
+dropzone.addEventListener("", () => fileEl.click());
 
 dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });

[NoCoverage] BlockStatement
src/index.js:647:44
 // ---------- Event wiring ----------
 dropzone.addEventListener('click', () => fileEl.click());
 
-dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });
+dropzone.addEventListener('dragover', e => {});
 dropzone.addEventListener('dragleave', () => setDrag(false));
 dropzone.addEventListener('drop', async e => {

[NoCoverage] BooleanLiteral
src/index.js:647:74
 // ---------- Event wiring ----------
 dropzone.addEventListener('click', () => fileEl.click());
 
-dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });
+dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(false); });
 dropzone.addEventListener('dragleave', () => setDrag(false));
 dropzone.addEventListener('drop', async e => {

[NoCoverage] BooleanLiteral
src/index.js:648:54
 dropzone.addEventListener('click', () => fileEl.click());
 
 dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });
-dropzone.addEventListener('dragleave', () => setDrag(false));
+dropzone.addEventListener('dragleave', () => setDrag(true));
 dropzone.addEventListener('drop', async e => {
 	e.preventDefault();

[NoCoverage] ArrowFunction
src/index.js:648:40
 dropzone.addEventListener('click', () => fileEl.click());
 
 dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });
-dropzone.addEventListener('dragleave', () => setDrag(false));
+dropzone.addEventListener('dragleave', () => undefined);
 dropzone.addEventListener('drop', async e => {
 	e.preventDefault();

[NoCoverage] BlockStatement
src/index.js:649:46
 
 dropzone.addEventListener('dragover', e => { e.preventDefault(); setDrag(true); });
 dropzone.addEventListener('dragleave', () => setDrag(false));
-dropzone.addEventListener('drop', async e => {
-	e.preventDefault();
-	setDrag(false);
-	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
-	
-	if (files.length === 0) return;
-	
-	if (files.length === 1) {
-		await handleFileSelection(files[0]);
-	} else {
-		await handleMultipleFiles(files);
-	}
-});
+dropzone.addEventListener('drop', async e => {});
 
 fileEl.addEventListener('change', async e => {

[NoCoverage] BooleanLiteral
src/index.js:651:10
 dropzone.addEventListener('dragleave', () => setDrag(false));
 dropzone.addEventListener('drop', async e => {
 	e.preventDefault();
-	setDrag(false);
+	setDrag(true);
 	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
 	

[NoCoverage] MethodExpression
src/index.js:652:61
 dropzone.addEventListener('drop', async e => {
 	e.preventDefault();
 	setDrag(false);
-	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
+	const files = Array.from(e.dataTransfer.files).filter(f => f.type.endsWith('image/'));
 	
 	if (files.length === 0) return;

[NoCoverage] MethodExpression
src/index.js:652:16
 dropzone.addEventListener('drop', async e => {
 	e.preventDefault();
 	setDrag(false);
-	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
+	const files = Array.from(e.dataTransfer.files);
 	
 	if (files.length === 0) return;

[NoCoverage] ConditionalExpression
src/index.js:654:6
 	setDrag(false);
 	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
 	
-	if (files.length === 0) return;
+	if (true) return;
 	
 	if (files.length === 1) {

[NoCoverage] EqualityOperator
src/index.js:654:6
 	setDrag(false);
 	const files = Array.from(e.dataTransfer.files).filter(f => f.type.startsWith('image/'));
 	
-	if (files.length === 0) return;
+	if (files.length !== 0) return;
 	
 	if (files.length === 1) {

[NoCoverage] BlockStatement
src/index.js:656:26
 	
 	if (files.length === 0) return;
 	
-	if (files.length === 1) {
-		await handleFileSelection(files[0]);
-	} else {
+	if (files.length === 1) {} else {
 		await handleMultipleFiles(files);
 	}

[NoCoverage] ConditionalExpression
src/index.js:656:6
 	
 	if (files.length === 0) return;
 	
-	if (files.length === 1) {
+	if (false) {
 		await handleFileSelection(files[0]);
 	} else {

[NoCoverage] BlockStatement
src/index.js:658:9
 	
 	if (files.length === 1) {
 		await handleFileSelection(files[0]);
-	} else {
-		await handleMultipleFiles(files);
-	}
+	} else {}
 });
 

[NoCoverage] BlockStatement
src/index.js:663:46
 	}
 });
 
-fileEl.addEventListener('change', async e => {
-	const files = Array.from(e.target.files);
-	if (files.length === 0) return;
-	
-	if (files.length === 1) {
-		await handleFileSelection(files[0]);
-	} else {
-		await handleMultipleFiles(files);
-	}
-	e.target.value = '';
-});
+fileEl.addEventListener('change', async e => {});
 
 apiKeyEl.addEventListener('input', async e => {

[NoCoverage] StringLiteral
src/index.js:663:25
 	}
 });
 
-fileEl.addEventListener('change', async e => {
+fileEl.addEventListener("", async e => {
 	const files = Array.from(e.target.files);
 	if (files.length === 0) return;

[NoCoverage] EqualityOperator
src/index.js:665:6
 
 fileEl.addEventListener('change', async e => {
 	const files = Array.from(e.target.files);
-	if (files.length === 0) return;
+	if (files.length !== 0) return;
 	
 	if (files.length === 1) {

[NoCoverage] ConditionalExpression
src/index.js:665:6
 
 fileEl.addEventListener('change', async e => {
 	const files = Array.from(e.target.files);
-	if (files.length === 0) return;
+	if (true) return;
 	
 	if (files.length === 1) {

[NoCoverage] ConditionalExpression
src/index.js:667:6
 	const files = Array.from(e.target.files);
 	if (files.length === 0) return;
 	
-	if (files.length === 1) {
+	if (true) {
 		await handleFileSelection(files[0]);
 	} else {

[NoCoverage] EqualityOperator
src/index.js:667:6
 	const files = Array.from(e.target.files);
 	if (files.length === 0) return;
 	
-	if (files.length === 1) {
+	if (files.length !== 1) {
 		await handleFileSelection(files[0]);
 	} else {

[NoCoverage] BlockStatement
src/index.js:675:47
 	e.target.value = '';
 });
 
-apiKeyEl.addEventListener('input', async e => {
-	const value = e.target.value;
-	persistApiKey(value);
-	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
-		pendingApiKeyAnalysis = false;
-		if (currentFile) {
-			await analyzeCurrentImage({ silentOnMissingKey: true });
-		} else if (currentSession) {
-			await analyzeMultipleImages(currentSession.images.map(img => img.file));
-		}
-	}
-});
+apiKeyEl.addEventListener('input', async e => {});
 
 // ---------- Initial message ----------

[NoCoverage] StringLiteral
src/index.js:675:27
 	e.target.value = '';
 });
 
-apiKeyEl.addEventListener('input', async e => {
+apiKeyEl.addEventListener("", async e => {
 	const value = e.target.value;
 	persistApiKey(value);

[NoCoverage] LogicalOperator
src/index.js:678:6
 apiKeyEl.addEventListener('input', async e => {
 	const value = e.target.value;
 	persistApiKey(value);
-	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
+	if (pendingApiKeyAnalysis && value.trim() || !isAnalyzing) {
 		pendingApiKeyAnalysis = false;
 		if (currentFile) {

[NoCoverage] ConditionalExpression
src/index.js:678:6
 apiKeyEl.addEventListener('input', async e => {
 	const value = e.target.value;
 	persistApiKey(value);
-	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
+	if (true) {
 		pendingApiKeyAnalysis = false;
 		if (currentFile) {

[NoCoverage] BooleanLiteral
src/index.js:679:27
 	const value = e.target.value;
 	persistApiKey(value);
 	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
-		pendingApiKeyAnalysis = false;
+		pendingApiKeyAnalysis = true;
 		if (currentFile) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });

[NoCoverage] ConditionalExpression
src/index.js:680:7
 	persistApiKey(value);
 	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
 		pendingApiKeyAnalysis = false;
-		if (currentFile) {
+		if (true) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });
 		} else if (currentSession) {

[NoCoverage] ConditionalExpression
src/index.js:680:7
 	persistApiKey(value);
 	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
 		pendingApiKeyAnalysis = false;
-		if (currentFile) {
+		if (false) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });
 		} else if (currentSession) {

[NoCoverage] BooleanLiteral
src/index.js:681:52
 	if (pendingApiKeyAnalysis && value.trim() && !isAnalyzing) {
 		pendingApiKeyAnalysis = false;
 		if (currentFile) {
-			await analyzeCurrentImage({ silentOnMissingKey: true });
+			await analyzeCurrentImage({ silentOnMissingKey: false });
 		} else if (currentSession) {
 			await analyzeMultipleImages(currentSession.images.map(img => img.file));

[NoCoverage] ConditionalExpression
src/index.js:682:14
 		pendingApiKeyAnalysis = false;
 		if (currentFile) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });
-		} else if (currentSession) {
+		} else if (false) {
 			await analyzeMultipleImages(currentSession.images.map(img => img.file));
 		}

[NoCoverage] ConditionalExpression
src/index.js:682:14
 		pendingApiKeyAnalysis = false;
 		if (currentFile) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });
-		} else if (currentSession) {
+		} else if (true) {
 			await analyzeMultipleImages(currentSession.images.map(img => img.file));
 		}

[NoCoverage] ArrowFunction
src/index.js:683:58
 		if (currentFile) {
 			await analyzeCurrentImage({ silentOnMissingKey: true });
 		} else if (currentSession) {
-			await analyzeMultipleImages(currentSession.images.map(img => img.file));
+			await analyzeMultipleImages(currentSession.images.map(() => undefined));
 		}
 	}

[NoCoverage] StringLiteral
src/index.js:689:20
 });
 
 // ---------- Initial message ----------
-logJson({ message: 'Drop or click to choose images (up to 20). Analysis runs automatically.' });
+logJson({ message: "" });
 
