[NoCoverage] BlockStatement
src/report-ui.js:118:32
 	// Progress from detections (regional)
 	if (progressItems.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Regional Progress</h4>';
-		progressItems.forEach(det => {
-			const phase = det.progress?.phase || 'Unknown phase';
-			const percent = det.progress?.percentComplete ?? 0;
-			const notes = det.progress?.notes || '';
-			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
-
-			html += `
-				<div class="progress-item" data-detection-id="${det.id || ''}">
-					<div class="progress-header">
-						<span class="progress-label">${escapeHtml(det.label)}: ${escapeHtml(phase)}</span>
-						<span class="progress-percent">${percent.toFixed(0)}%</span>
-					</div>
-					<div class="progress-bar-bg">
-						<div class="progress-bar-fill" style="width: ${percent}%"></div>
-					</div>
-					${notes ? `<div class="progress-notes">${escapeHtml(notes)}</div>` : ''}
-					<div class="progress-notes">Confidence: ${confidence}%</div>
-				</div>
-			`;
-		});
+		progressItems.forEach(det => {});
 	}
 

[NoCoverage] LogicalOperator
src/report-ui.js:119:18
 	if (progressItems.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Regional Progress</h4>';
 		progressItems.forEach(det => {
-			const phase = det.progress?.phase || 'Unknown phase';
+			const phase = det.progress?.phase && 'Unknown phase';
 			const percent = det.progress?.percentComplete ?? 0;
 			const notes = det.progress?.notes || '';

[NoCoverage] ConditionalExpression
src/report-ui.js:119:18
 	if (progressItems.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Regional Progress</h4>';
 		progressItems.forEach(det => {
-			const phase = det.progress?.phase || 'Unknown phase';
+			const phase = false;
 			const percent = det.progress?.percentComplete ?? 0;
 			const notes = det.progress?.notes || '';

[NoCoverage] OptionalChaining
src/report-ui.js:120:20
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Regional Progress</h4>';
 		progressItems.forEach(det => {
 			const phase = det.progress?.phase || 'Unknown phase';
-			const percent = det.progress?.percentComplete ?? 0;
+			const percent = det.progress.percentComplete ?? 0;
 			const notes = det.progress?.notes || '';
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';

[NoCoverage] LogicalOperator
src/report-ui.js:120:20
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Regional Progress</h4>';
 		progressItems.forEach(det => {
 			const phase = det.progress?.phase || 'Unknown phase';
-			const percent = det.progress?.percentComplete ?? 0;
+			const percent = det.progress?.percentComplete && 0;
 			const notes = det.progress?.notes || '';
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';

[NoCoverage] ConditionalExpression
src/report-ui.js:121:18
 		progressItems.forEach(det => {
 			const phase = det.progress?.phase || 'Unknown phase';
 			const percent = det.progress?.percentComplete ?? 0;
-			const notes = det.progress?.notes || '';
+			const notes = false;
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
 

[NoCoverage] ConditionalExpression
src/report-ui.js:121:18
 		progressItems.forEach(det => {
 			const phase = det.progress?.phase || 'Unknown phase';
 			const percent = det.progress?.percentComplete ?? 0;
-			const notes = det.progress?.notes || '';
+			const notes = true;
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
 

[NoCoverage] EqualityOperator
src/report-ui.js:122:23
 			const phase = det.progress?.phase || 'Unknown phase';
 			const percent = det.progress?.percentComplete ?? 0;
 			const notes = det.progress?.notes || '';
-			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
+			const confidence = typeof det.confidence !== 'number' ? (det.confidence * 100).toFixed(0) : '?';
 
 			html += `

[NoCoverage] ConditionalExpression
src/report-ui.js:122:23
 			const phase = det.progress?.phase || 'Unknown phase';
 			const percent = det.progress?.percentComplete ?? 0;
 			const notes = det.progress?.notes || '';
-			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
+			const confidence = true ? (det.confidence * 100).toFixed(0) : '?';
 
 			html += `

[NoCoverage] StringLiteral
src/report-ui.js:124:12
 			const notes = det.progress?.notes || '';
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
 
-			html += `
-				<div class="progress-item" data-detection-id="${det.id || ''}">
-					<div class="progress-header">
-						<span class="progress-label">${escapeHtml(det.label)}: ${escapeHtml(phase)}</span>
-						<span class="progress-percent">${percent.toFixed(0)}%</span>
-					</div>
-					<div class="progress-bar-bg">
-						<div class="progress-bar-fill" style="width: ${percent}%"></div>
-					</div>
-					${notes ? `<div class="progress-notes">${escapeHtml(notes)}</div>` : ''}
-					<div class="progress-notes">Confidence: ${confidence}%</div>
-				</div>
-			`;
+			html += ``;
 		});
 	}

[NoCoverage] ConditionalExpression
src/report-ui.js:125:53
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
 
 			html += `
-				<div class="progress-item" data-detection-id="${det.id || ''}">
+				<div class="progress-item" data-detection-id="${false}">
 					<div class="progress-header">
 						<span class="progress-label">${escapeHtml(det.label)}: ${escapeHtml(phase)}</span>

[NoCoverage] ConditionalExpression
src/report-ui.js:125:53
 			const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
 
 			html += `
-				<div class="progress-item" data-detection-id="${det.id || ''}">
+				<div class="progress-item" data-detection-id="${true}">
 					<div class="progress-header">
 						<span class="progress-label">${escapeHtml(det.label)}: ${escapeHtml(phase)}</span>

[NoCoverage] StringLiteral
src/report-ui.js:133:75
 					<div class="progress-bar-bg">
 						<div class="progress-bar-fill" style="width: ${percent}%"></div>
 					</div>
-					${notes ? `<div class="progress-notes">${escapeHtml(notes)}</div>` : ''}
+					${notes ? `<div class="progress-notes">${escapeHtml(notes)}</div>` : "Stryker was here!"}
 					<div class="progress-notes">Confidence: ${confidence}%</div>
 				</div>

[NoCoverage] EqualityOperator
src/report-ui.js:141:6
 	}
 
 	// Progress from global insights
-	if (progressInsights.length > 0) {
+	if (progressInsights.length <= 0) {
 		if (progressItems.length > 0) {
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';

[NoCoverage] EqualityOperator
src/report-ui.js:141:6
 	}
 
 	// Progress from global insights
-	if (progressInsights.length > 0) {
+	if (progressInsights.length >= 0) {
 		if (progressItems.length > 0) {
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';

[NoCoverage] EqualityOperator
src/report-ui.js:142:7
 
 	// Progress from global insights
 	if (progressInsights.length > 0) {
-		if (progressItems.length > 0) {
+		if (progressItems.length <= 0) {
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';
 		}

[NoCoverage] EqualityOperator
src/report-ui.js:142:7
 
 	// Progress from global insights
 	if (progressInsights.length > 0) {
-		if (progressItems.length > 0) {
+		if (progressItems.length >= 0) {
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';
 		}

[NoCoverage] BlockStatement
src/report-ui.js:145:39
 		if (progressItems.length > 0) {
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';
 		}
-		progressInsights.forEach(insight => {
-			const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
-			// Try to extract percentage from metrics or description
-			let percent = 0;
-			if (insight.metrics) {
-				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
-				if (pctMetric) percent = pctMetric.value;
-			}
-
-			html += `
-				<div class="progress-item">
-					<div class="progress-header">
-						<span class="progress-label">${escapeHtml(insight.name)}</span>
-						${percent > 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
-					</div>
-					${percent > 0 ? `
-						<div class="progress-bar-bg">
-							<div class="progress-bar-fill" style="width: ${percent}%"></div>
-						</div>
-					` : ''}
-					<div class="progress-notes">${escapeHtml(insight.description)}</div>
-					<div class="progress-notes">Confidence: ${confidence}%</div>
-				</div>
-			`;
-		});
+		progressInsights.forEach(insight => {});
 	}
 

[NoCoverage] ConditionalExpression
src/report-ui.js:146:23
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';
 		}
 		progressInsights.forEach(insight => {
-			const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
+			const confidence = true ? (insight.confidence * 100).toFixed(0) : '?';
 			// Try to extract percentage from metrics or description
 			let percent = 0;

[NoCoverage] EqualityOperator
src/report-ui.js:146:23
 			html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Overall Progress</h4>';
 		}
 		progressInsights.forEach(insight => {
-			const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
+			const confidence = typeof insight.confidence !== 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 			// Try to extract percentage from metrics or description
 			let percent = 0;

[NoCoverage] BlockStatement
src/report-ui.js:149:25
 			const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 			// Try to extract percentage from metrics or description
 			let percent = 0;
-			if (insight.metrics) {
-				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
-				if (pctMetric) percent = pctMetric.value;
-			}
+			if (insight.metrics) {}
 
 			html += `

[NoCoverage] ConditionalExpression
src/report-ui.js:149:8
 			const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 			// Try to extract percentage from metrics or description
 			let percent = 0;
-			if (insight.metrics) {
+			if (true) {
 				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
 				if (pctMetric) percent = pctMetric.value;

[NoCoverage] MethodExpression
src/report-ui.js:150:92
 			// Try to extract percentage from metrics or description
 			let percent = 0;
 			if (insight.metrics) {
-				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
+				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toUpperCase().includes('complete'));
 				if (pctMetric) percent = pctMetric.value;
 			}

[NoCoverage] ConditionalExpression
src/report-ui.js:150:49
 			// Try to extract percentage from metrics or description
 			let percent = 0;
 			if (insight.metrics) {
-				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
+				const pctMetric = insight.metrics.find(m => false);
 				if (pctMetric) percent = pctMetric.value;
 			}

[NoCoverage] ConditionalExpression
src/report-ui.js:151:9
 			let percent = 0;
 			if (insight.metrics) {
 				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
-				if (pctMetric) percent = pctMetric.value;
+				if (false) percent = pctMetric.value;
 			}
 

[NoCoverage] ConditionalExpression
src/report-ui.js:151:9
 			let percent = 0;
 			if (insight.metrics) {
 				const pctMetric = insight.metrics.find(m => m.key.toLowerCase().includes('percent') || m.key.toLowerCase().includes('complete'));
-				if (pctMetric) percent = pctMetric.value;
+				if (true) percent = pctMetric.value;
 			}
 

[NoCoverage] ConditionalExpression
src/report-ui.js:158:9
 				<div class="progress-item">
 					<div class="progress-header">
 						<span class="progress-label">${escapeHtml(insight.name)}</span>
-						${percent > 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
+						${false ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
 					</div>
 					${percent > 0 ? `

[NoCoverage] EqualityOperator
src/report-ui.js:158:9
 				<div class="progress-item">
 					<div class="progress-header">
 						<span class="progress-label">${escapeHtml(insight.name)}</span>
-						${percent > 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
+						${percent >= 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
 					</div>
 					${percent > 0 ? `

[NoCoverage] EqualityOperator
src/report-ui.js:160:8
 						<span class="progress-label">${escapeHtml(insight.name)}</span>
 						${percent > 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
 					</div>
-					${percent > 0 ? `
+					${percent >= 0 ? `
 						<div class="progress-bar-bg">
 							<div class="progress-bar-fill" style="width: ${percent}%"></div>

[NoCoverage] ConditionalExpression
src/report-ui.js:160:8
 						<span class="progress-label">${escapeHtml(insight.name)}</span>
 						${percent > 0 ? `<span class="progress-percent">${percent.toFixed(0)}%</span>` : ''}
 					</div>
-					${percent > 0 ? `
+					${false ? `
 						<div class="progress-bar-bg">
 							<div class="progress-bar-fill" style="width: ${percent}%"></div>

[NoCoverage] ConditionalExpression
src/report-ui.js:172:9
 		});
 	}
 
-	return html || '<p style="color:#9aa0b4;">No progress information available.</p>';
+	return true;
 }
 

[NoCoverage] LogicalOperator
src/report-ui.js:172:9
 		});
 	}
 
-	return html || '<p style="color:#9aa0b4;">No progress information available.</p>';
+	return html && '<p style="color:#9aa0b4;">No progress information available.</p>';
 }
 

[NoCoverage] ConditionalExpression
src/report-ui.js:177:22
 
 function renderDetectionCards(detections) {
 	const cards = detections.map(det => {
-		const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
+		const confidence = false ? (det.confidence * 100).toFixed(0) : '?';
 		const category = det.category || 'other';
 		const categoryLabel = category.replace(/_/g, ' ');

[NoCoverage] ConditionalExpression
src/report-ui.js:177:22
 
 function renderDetectionCards(detections) {
 	const cards = detections.map(det => {
-		const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
+		const confidence = true ? (det.confidence * 100).toFixed(0) : '?';
 		const category = det.category || 'other';
 		const categoryLabel = category.replace(/_/g, ' ');

[NoCoverage] LogicalOperator
src/report-ui.js:178:20
 function renderDetectionCards(detections) {
 	const cards = detections.map(det => {
 		const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
-		const category = det.category || 'other';
+		const category = det.category && 'other';
 		const categoryLabel = category.replace(/_/g, ' ');
 

[NoCoverage] ConditionalExpression
src/report-ui.js:178:20
 function renderDetectionCards(detections) {
 	const cards = detections.map(det => {
 		const confidence = typeof det.confidence === 'number' ? (det.confidence * 100).toFixed(0) : '?';
-		const category = det.category || 'other';
+		const category = true;
 		const categoryLabel = category.replace(/_/g, ' ');
 

[NoCoverage] ConditionalExpression
src/report-ui.js:182:40
 		const categoryLabel = category.replace(/_/g, ' ');
 
 		let attrsHtml = '';
-		if (Array.isArray(det.attributes) && det.attributes.length > 0) {
+		if (Array.isArray(det.attributes) && true) {
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {

[NoCoverage] LogicalOperator
src/report-ui.js:182:7
 		const categoryLabel = category.replace(/_/g, ' ');
 
 		let attrsHtml = '';
-		if (Array.isArray(det.attributes) && det.attributes.length > 0) {
+		if (Array.isArray(det.attributes) || det.attributes.length > 0) {
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {

[NoCoverage] BlockStatement
src/report-ui.js:184:35
 		let attrsHtml = '';
 		if (Array.isArray(det.attributes) && det.attributes.length > 0) {
 			attrsHtml = '<dl class="detection-card-attrs">';
-			det.attributes.forEach(attr => {
-				const value = attr.valueNum ?? attr.valueStr ?? attr.valueBool ?? '—';
-				const unit = attr.unit ? ` ${attr.unit}` : '';
-				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;
-			});
+			det.attributes.forEach(attr => {});
 			attrsHtml += '</dl>';
 		}

[NoCoverage] LogicalOperator
src/report-ui.js:185:19
 		if (Array.isArray(det.attributes) && det.attributes.length > 0) {
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {
-				const value = attr.valueNum ?? attr.valueStr ?? attr.valueBool ?? '—';
+				const value = (attr.valueNum ?? attr.valueStr) && attr.valueBool ?? '—';
 				const unit = attr.unit ? ` ${attr.unit}` : '';
 				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;

[NoCoverage] LogicalOperator
src/report-ui.js:185:19
 		if (Array.isArray(det.attributes) && det.attributes.length > 0) {
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {
-				const value = attr.valueNum ?? attr.valueStr ?? attr.valueBool ?? '—';
+				const value = (attr.valueNum ?? attr.valueStr ?? attr.valueBool) && '—';
 				const unit = attr.unit ? ` ${attr.unit}` : '';
 				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;

[NoCoverage] StringLiteral
src/report-ui.js:186:30
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {
 				const value = attr.valueNum ?? attr.valueStr ?? attr.valueBool ?? '—';
-				const unit = attr.unit ? ` ${attr.unit}` : '';
+				const unit = attr.unit ? `` : '';
 				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;
 			});

[NoCoverage] StringLiteral
src/report-ui.js:186:48
 			attrsHtml = '<dl class="detection-card-attrs">';
 			det.attributes.forEach(attr => {
 				const value = attr.valueNum ?? attr.valueStr ?? attr.valueBool ?? '—';
-				const unit = attr.unit ? ` ${attr.unit}` : '';
+				const unit = attr.unit ? ` ${attr.unit}` : "Stryker was here!";
 				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;
 			});

[NoCoverage] StringLiteral
src/report-ui.js:189:17
 				const unit = attr.unit ? ` ${attr.unit}` : '';
 				attrsHtml += `<dt>${escapeHtml(attr.name)}:</dt><dd>${value}${unit}</dd><br>`;
 			});
-			attrsHtml += '</dl>';
+			attrsHtml += "";
 		}
 

[NoCoverage] ConditionalExpression
src/report-ui.js:193:74
 		}
 
 		return `
-			<div class="detection-card category-${category}" data-detection-id="${det.id || ''}">
+			<div class="detection-card category-${category}" data-detection-id="${true}">
 				<div class="detection-card-header">
 					<div class="detection-card-label">${escapeHtml(det.label)}</div>

[NoCoverage] ConditionalExpression
src/report-ui.js:193:74
 		}
 
 		return `
-			<div class="detection-card category-${category}" data-detection-id="${det.id || ''}">
+			<div class="detection-card category-${category}" data-detection-id="${false}">
 				<div class="detection-card-header">
 					<div class="detection-card-label">${escapeHtml(det.label)}</div>

[NoCoverage] StringLiteral
src/report-ui.js:204:9
 		`;
 	}).join('');
 
-	return `<div class="detection-grid">${cards}</div>`;
+	return ``;
 }
 

[NoCoverage] EqualityOperator
src/report-ui.js:209:22
 
 function renderInsights(insights) {
 	const cards = insights.map(insight => {
-		const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
+		const confidence = typeof insight.confidence !== 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 		let metricsHtml = '';
 

[NoCoverage] ConditionalExpression
src/report-ui.js:209:22
 
 function renderInsights(insights) {
 	const cards = insights.map(insight => {
-		const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
+		const confidence = true ? (insight.confidence * 100).toFixed(0) : '?';
 		let metricsHtml = '';
 

[NoCoverage] StringLiteral
src/report-ui.js:210:21
 function renderInsights(insights) {
 	const cards = insights.map(insight => {
 		const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
-		let metricsHtml = '';
+		let metricsHtml = "Stryker was here!";
 
 		if (Array.isArray(insight.metrics) && insight.metrics.length > 0) {

[NoCoverage] LogicalOperator
src/report-ui.js:212:7
 		const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 		let metricsHtml = '';
 
-		if (Array.isArray(insight.metrics) && insight.metrics.length > 0) {
+		if (Array.isArray(insight.metrics) || insight.metrics.length > 0) {
 			metricsHtml = '<div class="insight-metrics">';
 			insight.metrics.forEach(metric => {

[NoCoverage] ConditionalExpression
src/report-ui.js:212:7
 		const confidence = typeof insight.confidence === 'number' ? (insight.confidence * 100).toFixed(0) : '?';
 		let metricsHtml = '';
 
-		if (Array.isArray(insight.metrics) && insight.metrics.length > 0) {
+		if (false) {
 			metricsHtml = '<div class="insight-metrics">';
 			insight.metrics.forEach(metric => {

[NoCoverage] BlockStatement
src/report-ui.js:214:38
 
 		if (Array.isArray(insight.metrics) && insight.metrics.length > 0) {
 			metricsHtml = '<div class="insight-metrics">';
-			insight.metrics.forEach(metric => {
-				const unit = metric.unit ? ` ${metric.unit}` : '';
-				metricsHtml += `
-					<div class="insight-metric">
-						<span class="insight-metric-key">${escapeHtml(metric.key)}:</span>
-						<span class="insight-metric-value">${metric.value}${unit}</span>
-					</div>
-				`;
-			});
+			insight.metrics.forEach(metric => {});
 			metricsHtml += '</div>';
 		}

[NoCoverage] StringLiteral
src/report-ui.js:215:52
 		if (Array.isArray(insight.metrics) && insight.metrics.length > 0) {
 			metricsHtml = '<div class="insight-metrics">';
 			insight.metrics.forEach(metric => {
-				const unit = metric.unit ? ` ${metric.unit}` : '';
+				const unit = metric.unit ? ` ${metric.unit}` : "Stryker was here!";
 				metricsHtml += `
 					<div class="insight-metric">

[NoCoverage] StringLiteral
src/report-ui.js:216:20
 			metricsHtml = '<div class="insight-metrics">';
 			insight.metrics.forEach(metric => {
 				const unit = metric.unit ? ` ${metric.unit}` : '';
-				metricsHtml += `
-					<div class="insight-metric">
-						<span class="insight-metric-key">${escapeHtml(metric.key)}:</span>
-						<span class="insight-metric-value">${metric.value}${unit}</span>
-					</div>
-				`;
+				metricsHtml += ``;
 			});
 			metricsHtml += '</div>';

[NoCoverage] LogicalOperator
src/report-ui.js:236:9
 		`;
 	}).join('');
 
-	return cards || '<p style="color:#9aa0b4;">No additional insights available.</p>';
+	return cards && '<p style="color:#9aa0b4;">No additional insights available.</p>';
 }
 

[NoCoverage] ConditionalExpression
src/report-ui.js:236:9
 		`;
 	}).join('');
 
-	return cards || '<p style="color:#9aa0b4;">No additional insights available.</p>';
+	return true;
 }
 

[NoCoverage] EqualityOperator
src/report-ui.js:243:6
 	let html = '';
 
 	// By Category
-	if (aggregates.countsByCategory.length > 0) {
+	if (aggregates.countsByCategory.length <= 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">By Category</h4>';
 		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));

[NoCoverage] EqualityOperator
src/report-ui.js:243:6
 	let html = '';
 
 	// By Category
-	if (aggregates.countsByCategory.length > 0) {
+	if (aggregates.countsByCategory.length >= 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">By Category</h4>';
 		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));

[NoCoverage] ArrowFunction
src/report-ui.js:245:64
 	// By Category
 	if (aggregates.countsByCategory.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">By Category</h4>';
-		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));
+		const maxCount = Math.max(...aggregates.countsByCategory.map(() => undefined));
 
 		aggregates.countsByCategory.forEach(item => {

[NoCoverage] MethodExpression
src/report-ui.js:245:20
 	// By Category
 	if (aggregates.countsByCategory.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">By Category</h4>';
-		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));
+		const maxCount = Math.min(...aggregates.countsByCategory.map(c => c.count));
 
 		aggregates.countsByCategory.forEach(item => {

[NoCoverage] BlockStatement
src/report-ui.js:247:47
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">By Category</h4>';
 		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));
 
-		aggregates.countsByCategory.forEach(item => {
-			const width = (item.count / maxCount) * 100;
-			const categoryLabel = item.category.replace(/_/g, ' ');
-
-			html += `
-				<div class="aggregate-bar">
-					<div class="aggregate-bar-header">
-						<span class="aggregate-bar-label">${escapeHtml(categoryLabel)}</span>
-						<span class="aggregate-bar-count">${item.count}</span>
-					</div>
-					<div class="aggregate-bar-bg">
-						<div class="aggregate-bar-fill category-${item.category}" style="width: ${width}%">
-							${item.count}
-						</div>
-					</div>
-				</div>
-			`;
-		});
+		aggregates.countsByCategory.forEach(item => {});
 	}
 

[NoCoverage] ArithmeticOperator
src/report-ui.js:248:19
 		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));
 
 		aggregates.countsByCategory.forEach(item => {
-			const width = (item.count / maxCount) * 100;
+			const width = (item.count * maxCount) * 100;
 			const categoryLabel = item.category.replace(/_/g, ' ');
 

[NoCoverage] ArithmeticOperator
src/report-ui.js:248:18
 		const maxCount = Math.max(...aggregates.countsByCategory.map(c => c.count));
 
 		aggregates.countsByCategory.forEach(item => {
-			const width = (item.count / maxCount) * 100;
+			const width = item.count / maxCount / 100;
 			const categoryLabel = item.category.replace(/_/g, ' ');
 

[NoCoverage] StringLiteral
src/report-ui.js:249:54
 
 		aggregates.countsByCategory.forEach(item => {
 			const width = (item.count / maxCount) * 100;
-			const categoryLabel = item.category.replace(/_/g, ' ');
+			const categoryLabel = item.category.replace(/_/g, "");
 
 			html += `

[NoCoverage] EqualityOperator
src/report-ui.js:268:6
 	}
 
 	// By Label
-	if (aggregates.countsByLabel.length > 0) {
+	if (aggregates.countsByLabel.length <= 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
 		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));

[NoCoverage] ConditionalExpression
src/report-ui.js:268:6
 	}
 
 	// By Label
-	if (aggregates.countsByLabel.length > 0) {
+	if (true) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
 		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));

[NoCoverage] StringLiteral
src/report-ui.js:269:11
 
 	// By Label
 	if (aggregates.countsByLabel.length > 0) {
-		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
+		html += "";
 		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));
 		const topLabels = aggregates.countsByLabel.slice(0, 10);

[NoCoverage] MethodExpression
src/report-ui.js:270:20
 	// By Label
 	if (aggregates.countsByLabel.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
-		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));
+		const maxCount = Math.min(...aggregates.countsByLabel.map(c => c.count));
 		const topLabels = aggregates.countsByLabel.slice(0, 10);
 

[NoCoverage] ArrowFunction
src/report-ui.js:270:61
 	// By Label
 	if (aggregates.countsByLabel.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
-		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));
+		const maxCount = Math.max(...aggregates.countsByLabel.map(() => undefined));
 		const topLabels = aggregates.countsByLabel.slice(0, 10);
 
