[NoCoverage] MethodExpression
src/report-ui.js:271:21
 	if (aggregates.countsByLabel.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">By Label (Top 10)</h4>';
 		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));
-		const topLabels = aggregates.countsByLabel.slice(0, 10);
+		const topLabels = aggregates.countsByLabel;
 
 		topLabels.forEach(item => {

[NoCoverage] BlockStatement
src/report-ui.js:273:29
 		const maxCount = Math.max(...aggregates.countsByLabel.map(c => c.count));
 		const topLabels = aggregates.countsByLabel.slice(0, 10);
 
-		topLabels.forEach(item => {
-			const width = (item.count / maxCount) * 100;
-
-			html += `
-				<div class="aggregate-bar">
-					<div class="aggregate-bar-header">
-						<span class="aggregate-bar-label">${escapeHtml(item.label)}</span>
-						<span class="aggregate-bar-count">${item.count}</span>
-					</div>
-					<div class="aggregate-bar-bg">
-						<div class="aggregate-bar-fill category-other" style="width: ${width}%; background:#4a4aff;">
-							${item.count}
-						</div>
-					</div>
-				</div>
-			`;
-		});
+		topLabels.forEach(item => {});
 	}
 

[NoCoverage] ArithmeticOperator
src/report-ui.js:274:18
 		const topLabels = aggregates.countsByLabel.slice(0, 10);
 
 		topLabels.forEach(item => {
-			const width = (item.count / maxCount) * 100;
+			const width = item.count / maxCount / 100;
 
 			html += `

[NoCoverage] ArithmeticOperator
src/report-ui.js:274:19
 		const topLabels = aggregates.countsByLabel.slice(0, 10);
 
 		topLabels.forEach(item => {
-			const width = (item.count / maxCount) * 100;
+			const width = (item.count * maxCount) * 100;
 
 			html += `

[NoCoverage] BlockStatement
src/report-ui.js:295:27
 	return html;
 }
 
-function escapeHtml(text) {
-	const div = document.createElement('div');
-	div.textContent = text;
-	return div.innerHTML;
-}
+function escapeHtml(text) {}
 
 /**

[NoCoverage] BlockStatement
src/report-ui.js:304:39
 /**
  * Render session report for multiple images
  */
-function renderSessionReport(session) {
-	const agg = session.sessionAggregates;
-	const completedImages = session.images.filter(img => img.status === 'completed');
-	
-	let html = '';
-
-	// Session Overview Section
-	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false);
-
-	// Export Controls Section
-	html += renderSection('export', '💾 Export Data', renderExportControls(), false);
-
-	// Per-Image Sections
-	completedImages.forEach((img, index) => {
-		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
-		const imageReport = renderSingleImageReport(img);
-		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);
-	});
-
-	return html;
-}
+function renderSessionReport(session) {}
 
 /**

[NoCoverage] EqualityOperator
src/report-ui.js:306:55
  */
 function renderSessionReport(session) {
 	const agg = session.sessionAggregates;
-	const completedImages = session.images.filter(img => img.status === 'completed');
+	const completedImages = session.images.filter(img => img.status !== 'completed');
 	
 	let html = '';

[NoCoverage] ConditionalExpression
src/report-ui.js:306:55
  */
 function renderSessionReport(session) {
 	const agg = session.sessionAggregates;
-	const completedImages = session.images.filter(img => img.status === 'completed');
+	const completedImages = session.images.filter(img => false);
 	
 	let html = '';

[NoCoverage] BooleanLiteral
src/report-ui.js:311:104
 	let html = '';
 
 	// Session Overview Section
-	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false);
+	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), ftrue;
 
 	// Export Controls Section

[NoCoverage] AssignmentOperator
src/report-ui.js:311:2
 	let html = '';
 
 	// Session Overview Section
-	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false);
+	html -= renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false)
 
 	// Export Controls Section

[NoCoverage] AssignmentOperator
src/report-ui.js:314:2
 	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false);
 
 	// Export Controls Section
-	html += renderSection('export', '💾 Export Data', renderExportControls(), false);
+	html -= renderSection('export', '💾 Export Data', renderExportControls(), false)
 
 	// Per-Image Sections

[NoCoverage] BooleanLiteral
src/report-ui.js:314:76
 	html += renderSection('session-overview', '📊 Session Overview', renderSessionOverview(session, agg), false);
 
 	// Export Controls Section
-	html += renderSection('export', '💾 Export Data', renderExportControls(), false);
+	html += renderSection('export', '💾 Export Data', renderExportControls(), ftrue;
 
 	// Per-Image Sections

[NoCoverage] BlockStatement
src/report-ui.js:317:42
 	html += renderSection('export', '💾 Export Data', renderExportControls(), false);
 
 	// Per-Image Sections
-	completedImages.forEach((img, index) => {
-		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
-		const imageReport = renderSingleImageReport(img);
-		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);
-	});
+	completedImages.forEach((img, index) => {});
 
 	return html;

[NoCoverage] ArithmeticOperator
src/report-ui.js:318:35
 
 	// Per-Image Sections
 	completedImages.forEach((img, index) => {
-		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
+		const imageTitle = `🖼️ Image ${iindex - 1: ${img.filename}`;
 		const imageReport = renderSingleImageReport(img);
 		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);

[NoCoverage] StringLiteral
src/report-ui.js:318:22
 
 	// Per-Image Sections
 	completedImages.forEach((img, index) => {
-		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
+		const imageTitle = ``
 		const imageReport = renderSingleImageReport(img);
 		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);

[NoCoverage] BooleanLiteral
src/report-ui.js:320:69
 	completedImages.forEach((img, index) => {
 		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
 		const imageReport = renderSingleImageReport(img);
-		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);
+		html += renderSection(`image-${img.id}`, imageTitle, imageReport, false);
 	});
 

[NoCoverage] AssignmentOperator
src/report-ui.js:320:3
 	completedImages.forEach((img, index) => {
 		const imageTitle = `🖼️ Image ${index + 1}: ${img.filename}`;
 		const imageReport = renderSingleImageReport(img);
-		html += renderSection(`image-${img.id}`, imageTitle, imageReport, true);
+		html -= renderSection(`image-${img.id}`, imageTitle, imageReport, true);
 	});
 

[NoCoverage] MethodExpression
src/report-ui.js:331:25
  */
 function renderSessionOverview(session, agg) {
 	const totalImages = session.images.length;
-	const completedCount = session.images.filter(img => img.status === 'completed').length;
+	const completedCount = session.images.length;
 	const errorCount = session.images.filter(img => img.status === 'error').length;
 

[NoCoverage] ConditionalExpression
src/report-ui.js:331:54
  */
 function renderSessionOverview(session, agg) {
 	const totalImages = session.images.length;
-	const completedCount = session.images.filter(img => img.status === 'completed').length;
+	const completedCount = session.images.filter(img => false).length;
 	const errorCount = session.images.filter(img => img.status === 'error').length;
 

[NoCoverage] MethodExpression
src/report-ui.js:332:21
 function renderSessionOverview(session, agg) {
 	const totalImages = session.images.length;
 	const completedCount = session.images.filter(img => img.status === 'completed').length;
-	const errorCount = session.images.filter(img => img.status === 'error').length;
+	const errorCount = session.images.length;
 
 	let html = '<div style="display:grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap:16px; margin-bottom:20px;">';

[NoCoverage] EqualityOperator
src/report-ui.js:332:50
 function renderSessionOverview(session, agg) {
 	const totalImages = session.images.length;
 	const completedCount = session.images.filter(img => img.status === 'completed').length;
-	const errorCount = session.images.filter(img => img.status === 'error').length;
+	const errorCount = session.images.filter(img => img.status !== 'error').length;
 
 	let html = '<div style="display:grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap:16px; margin-bottom:20px;">';

[NoCoverage] ConditionalExpression
src/report-ui.js:341:6
 		<div style="background:#141420; border:1px solid #2a2a3b; border-radius:8px; padding:16px;">
 			<div style="font-size:12px; color:#9aa0b4; margin-bottom:4px;">Total Images</div>
 			<div style="font-size:24px; font-weight:600;">${completedCount} / ${totalImages}</div>
-			${errorCount > 0 ? `<div style="font-size:12px; color:#ff4444; margin-top:4px;">${errorCount} failed</div>` : ''}
+			${false ? `<div style="font-size:12px; color:#ff4444; margin-top:4px;">${errorCount} failed</div>` : ''}
 		</div>
 		<div style="background:#141420; border:1px solid #2a2a3b; border-radius:8px; padding:16px;">

[NoCoverage] ConditionalExpression
src/report-ui.js:341:6
 		<div style="background:#141420; border:1px solid #2a2a3b; border-radius:8px; padding:16px;">
 			<div style="font-size:12px; color:#9aa0b4; margin-bottom:4px;">Total Images</div>
 			<div style="font-size:24px; font-weight:600;">${completedCount} / ${totalImages}</div>
-			${errorCount > 0 ? `<div style="font-size:12px; color:#ff4444; margin-top:4px;">${errorCount} failed</div>` : ''}
+			${true ? `<div style="font-size:12px; color:#ff4444; margin-top:4px;">${errorCount} failed</div>` : ''}
 		</div>
 		<div style="background:#141420; border:1px solid #2a2a3b; border-radius:8px; padding:16px;">

[NoCoverage] ArithmeticOperator
src/report-ui.js:349:52
 		</div>
 		<div style="background:#141420; border:1px solid #ff4444; border-radius:8px; padding:16px;">
 			<div style="font-size:12px; color:#9aa0b4; margin-bottom:4px;">Safety Issues</div>
-			<div style="font-size:24px; font-weight:600;">${agg.safetyIssues.high + agg.safetyIssues.medium + agg.safetyIssues.low}</div>
+			<div style="font-size:24px; font-weight:600;">${agg.safetyIssues.high - agg.safetyIssues.medium + agg.safetyIssues.low}</div>
 			<div style="font-size:11px; margin-top:4px;">
 				<span style="color:#ff4444;">High: ${agg.safetyIssues.high}</span> | 

[NoCoverage] ArithmeticOperator
src/report-ui.js:349:52
 		</div>
 		<div style="background:#141420; border:1px solid #ff4444; border-radius:8px; padding:16px;">
 			<div style="font-size:12px; color:#9aa0b4; margin-bottom:4px;">Safety Issues</div>
-			<div style="font-size:24px; font-weight:600;">${agg.safetyIssues.high + agg.safetyIssues.medium + agg.safetyIssues.low}</div>
+			<div style="font-size:24px; font-weight:600;">${agg.safetyIssues.high + agg.safetyIssues.medium - agg.safetyIssues.low}</div>
 			<div style="font-size:11px; margin-top:4px;">
 				<span style="color:#ff4444;">High: ${agg.safetyIssues.high}</span> | 

[NoCoverage] ConditionalExpression
src/report-ui.js:360:6
 	html += '</div>';
 
 	// Image heatmap
-	if (agg.imageStats && agg.imageStats.length > 0) {
+	if (false) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Images Overview</h4>';
 		html += '<div style="display:grid; grid-template-columns: repeat(auto-fill, minmax(150px, 1fr)); gap:8px;">';

[NoCoverage] ConditionalExpression
src/report-ui.js:360:24
 	html += '</div>';
 
 	// Image heatmap
-	if (agg.imageStats && agg.imageStats.length > 0) {
+	if (agg.imageStats && true) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Images Overview</h4>';
 		html += '<div style="display:grid; grid-template-columns: repeat(auto-fill, minmax(150px, 1fr)); gap:8px;">';

[NoCoverage] BlockStatement
src/report-ui.js:364:36
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Images Overview</h4>';
 		html += '<div style="display:grid; grid-template-columns: repeat(auto-fill, minmax(150px, 1fr)); gap:8px;">';
 		
-		agg.imageStats.forEach((stat) => {
-			const hasSafety = stat.safetyIssueCount > 0;
-			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
-			
-			html += `
-				<div style="background:#141420; border:2px solid ${borderColor}; border-radius:6px; padding:8px; font-size:11px;">
-					<div style="font-weight:600; margin-bottom:4px; overflow:hidden; text-overflow:ellipsis; white-space:nowrap;">${escapeHtml(stat.filename)}</div>
-					<div style="color:#9aa0b4;">Detections: ${stat.detectionCount}</div>
-					${hasSafety ? `<div style="color:#ff4444;">⚠️ Safety: ${stat.safetyIssueCount}</div>` : ''}
-					${stat.progressItemCount > 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
-				</div>
-			`;
-		});
+		agg.imageStats.forEach((stat) => {});
 		
 		html += '</div>';

[NoCoverage] EqualityOperator
src/report-ui.js:365:22
 		html += '<div style="display:grid; grid-template-columns: repeat(auto-fill, minmax(150px, 1fr)); gap:8px;">';
 		
 		agg.imageStats.forEach((stat) => {
-			const hasSafety = stat.safetyIssueCount > 0;
+			const hasSafety = stat.safetyIssueCount >= 0;
 			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
 			

[NoCoverage] EqualityOperator
src/report-ui.js:365:22
 		html += '<div style="display:grid; grid-template-columns: repeat(auto-fill, minmax(150px, 1fr)); gap:8px;">';
 		
 		agg.imageStats.forEach((stat) => {
-			const hasSafety = stat.safetyIssueCount > 0;
+			const hasSafety = stat.safetyIssueCount <= 0;
 			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
 			

[NoCoverage] StringLiteral
src/report-ui.js:366:48
 		
 		agg.imageStats.forEach((stat) => {
 			const hasSafety = stat.safetyIssueCount > 0;
-			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
+			const borderColor = hasSafety ? '#ff4444' : "";
 			
 			html += `

[NoCoverage] StringLiteral
src/report-ui.js:366:36
 		
 		agg.imageStats.forEach((stat) => {
 			const hasSafety = stat.safetyIssueCount > 0;
-			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
+			const borderColor = hasSafety ? "" : '#2a2a3b';
 			
 			html += `

[NoCoverage] StringLiteral
src/report-ui.js:368:12
 			const hasSafety = stat.safetyIssueCount > 0;
 			const borderColor = hasSafety ? '#ff4444' : '#2a2a3b';
 			
-			html += `
-				<div style="background:#141420; border:2px solid ${borderColor}; border-radius:6px; padding:8px; font-size:11px;">
-					<div style="font-weight:600; margin-bottom:4px; overflow:hidden; text-overflow:ellipsis; white-space:nowrap;">${escapeHtml(stat.filename)}</div>
-					<div style="color:#9aa0b4;">Detections: ${stat.detectionCount}</div>
-					${hasSafety ? `<div style="color:#ff4444;">⚠️ Safety: ${stat.safetyIssueCount}</div>` : ''}
-					${stat.progressItemCount > 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
-				</div>
-			`;
+			html += ``;
 		});
 		

[NoCoverage] EqualityOperator
src/report-ui.js:373:8
 					<div style="font-weight:600; margin-bottom:4px; overflow:hidden; text-overflow:ellipsis; white-space:nowrap;">${escapeHtml(stat.filename)}</div>
 					<div style="color:#9aa0b4;">Detections: ${stat.detectionCount}</div>
 					${hasSafety ? `<div style="color:#ff4444;">⚠️ Safety: ${stat.safetyIssueCount}</div>` : ''}
-					${stat.progressItemCount > 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
+					${stat.progressItemCount >= 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
 				</div>
 			`;

[NoCoverage] EqualityOperator
src/report-ui.js:373:8
 					<div style="font-weight:600; margin-bottom:4px; overflow:hidden; text-overflow:ellipsis; white-space:nowrap;">${escapeHtml(stat.filename)}</div>
 					<div style="color:#9aa0b4;">Detections: ${stat.detectionCount}</div>
 					${hasSafety ? `<div style="color:#ff4444;">⚠️ Safety: ${stat.safetyIssueCount}</div>` : ''}
-					${stat.progressItemCount > 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
+					${stat.progressItemCount <= 0 ? `<div style="color:#44ff88;">📊 Progress: ${stat.progressItemCount}</div>` : ''}
 				</div>
 			`;

[NoCoverage] BlockStatement
src/report-ui.js:382:59
 	}
 
 	// Session aggregates
-	if (agg.categoryCounts && agg.categoryCounts.length > 0) {
-		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Category Distribution</h4>';
-		html += renderAggregates({ countsByCategory: agg.categoryCounts, countsByLabel: [] });
-	}
+	if (agg.categoryCounts && agg.categoryCounts.length > 0) {}
 
 	return html;

[NoCoverage] ConditionalExpression
src/report-ui.js:382:6
 	}
 
 	// Session aggregates
-	if (agg.categoryCounts && agg.categoryCounts.length > 0) {
+	if (false) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Category Distribution</h4>';
 		html += renderAggregates({ countsByCategory: agg.categoryCounts, countsByLabel: [] });

[NoCoverage] AssignmentOperator
src/report-ui.js:384:3
 	// Session aggregates
 	if (agg.categoryCounts && agg.categoryCounts.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Category Distribution</h4>';
-		html += renderAggregates({ countsByCategory: agg.categoryCounts, countsByLabel: [] });
+		html -= renderAggregates({
+  countsByCategory: agg.categoryCounts,
+  countsByLabel: []
+});
 	}
 

[NoCoverage] BlockStatement
src/report-ui.js:393:33
 /**
  * Render export controls
  */
-function renderExportControls() {
-	return `
-		<div style="display:flex; gap:12px; flex-wrap:wrap;">
-			<button id="exportJSON" style="background:#4a4aff; color:#fff; border:none; border-radius:8px; padding:12px 24px; font-size:14px; font-weight:600; cursor:pointer;">
-				Export JSON
-			</button>
-			<button id="exportCSV" style="background:#44ff88; color:#000; border:none; border-radius:8px; padding:12px 24px; font-size:14px; font-weight:600; cursor:pointer;">
-				Export CSV
-			</button>
-		</div>
-	`;
-}
+function renderExportControls() {}
 
 /**

[NoCoverage] ConditionalExpression
src/report-ui.js:410:21
  * Render single image report (for per-image subsections)
  */
 function renderSingleImageReport(img) {
-	const detections = img.detections || [];
+	const detections = true;
 	const insights = img.parsedData?.global_insights || [];
 

[NoCoverage] LogicalOperator
src/report-ui.js:410:21
  * Render single image report (for per-image subsections)
  */
 function renderSingleImageReport(img) {
-	const detections = img.detections || [];
+	const detections = img.detections && [];
 	const insights = img.parsedData?.global_insights || [];
 

[NoCoverage] OptionalChaining
src/report-ui.js:411:19
  */
 function renderSingleImageReport(img) {
 	const detections = img.detections || [];
-	const insights = img.parsedData?.global_insights || [];
+	const insights = img.parsedData.global_insights || [];
 
 	const safetyIssues = detections.filter(d => d.category === 'safety_issue');

[NoCoverage] LogicalOperator
src/report-ui.js:411:19
  */
 function renderSingleImageReport(img) {
 	const detections = img.detections || [];
-	const insights = img.parsedData?.global_insights || [];
+	const insights = img.parsedData?.global_insights && [];
 
 	const safetyIssues = detections.filter(d => d.category === 'safety_issue');

[NoCoverage] ConditionalExpression
src/report-ui.js:413:46
 	const detections = img.detections || [];
 	const insights = img.parsedData?.global_insights || [];
 
-	const safetyIssues = detections.filter(d => d.category === 'safety_issue');
+	const safetyIssues = detections.filter(d => true);
 	const progressItems = detections.filter(d => d.category === 'progress' && d.progress);
 	const progressInsights = insights.filter(i => i.category === 'progress');

[NoCoverage] EqualityOperator
src/report-ui.js:413:46
 	const detections = img.detections || [];
 	const insights = img.parsedData?.global_insights || [];
 
-	const safetyIssues = detections.filter(d => d.category === 'safety_issue');
+	const safetyIssues = detections.filter(d => d.category !== 'safety_issue');
 	const progressItems = detections.filter(d => d.category === 'progress' && d.progress);
 	const progressInsights = insights.filter(i => i.category === 'progress');

[NoCoverage] ArrowFunction
src/report-ui.js:414:42
 	const insights = img.parsedData?.global_insights || [];
 
 	const safetyIssues = detections.filter(d => d.category === 'safety_issue');
-	const progressItems = detections.filter(d => d.category === 'progress' && d.progress);
+	const progressItems = detections.filter(() => undefined);
 	const progressInsights = insights.filter(i => i.category === 'progress');
 

[NoCoverage] ConditionalExpression
src/report-ui.js:415:48
 
 	const safetyIssues = detections.filter(d => d.category === 'safety_issue');
 	const progressItems = detections.filter(d => d.category === 'progress' && d.progress);
-	const progressInsights = insights.filter(i => i.category === 'progress');
+	const progressInsights = insights.filter(i => true);
 
 	let html = '';

[NoCoverage] ConditionalExpression
src/report-ui.js:415:48
 
 	const safetyIssues = detections.filter(d => d.category === 'safety_issue');
 	const progressItems = detections.filter(d => d.category === 'progress' && d.progress);
-	const progressInsights = insights.filter(i => i.category === 'progress');
+	const progressInsights = insights.filter(i => false);
 
 	let html = '';

[NoCoverage] EqualityOperator
src/report-ui.js:420:6
 	let html = '';
 
 	// Safety (if any)
-	if (safetyIssues.length > 0) {
+	if (safetyIssues.length >= 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Safety Issues</h4>';
 		html += renderSafetyCards(safetyIssues);

[NoCoverage] BlockStatement
src/report-ui.js:420:31
 	let html = '';
 
 	// Safety (if any)
-	if (safetyIssues.length > 0) {
-		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Safety Issues</h4>';
-		html += renderSafetyCards(safetyIssues);
-	}
+	if (safetyIssues.length > 0) {}
 
 	// Progress (if any)

[NoCoverage] AssignmentOperator
src/report-ui.js:422:3
 	// Safety (if any)
 	if (safetyIssues.length > 0) {
 		html += '<h4 style="margin:0 0 12px; font-size:14px; color:#9aa0b4;">Safety Issues</h4>';
-		html += renderSafetyCards(safetyIssues);
+		html -= renderSafetyCards(safetyIssues);
 	}
 

[NoCoverage] LogicalOperator
src/report-ui.js:426:6
 	}
 
 	// Progress (if any)
-	if (progressItems.length > 0 || progressInsights.length > 0) {
+	if (progressItems.length > 0 && progressInsights.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Progress</h4>';
 		html += renderProgressSection(progressItems, progressInsights);

[NoCoverage] EqualityOperator
src/report-ui.js:426:34
 	}
 
 	// Progress (if any)
-	if (progressItems.length > 0 || progressInsights.length > 0) {
+	if (progressItems.length > 0 || progressInsights.length >= 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Progress</h4>';
 		html += renderProgressSection(progressItems, progressInsights);

[NoCoverage] AssignmentOperator
src/report-ui.js:428:3
 	// Progress (if any)
 	if (progressItems.length > 0 || progressInsights.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">Progress</h4>';
-		html += renderProgressSection(progressItems, progressInsights);
+		html -= renderProgressSection(progressItems, progressInsights);
 	}
 

[NoCoverage] BlockStatement
src/report-ui.js:432:29
 	}
 
 	// All Detections
-	if (detections.length > 0) {
-		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">All Detections</h4>';
-		html += renderDetectionCards(detections);
-	}
+	if (detections.length > 0) {}
 
 	return html;

[NoCoverage] EqualityOperator
src/report-ui.js:432:6
 	}
 
 	// All Detections
-	if (detections.length > 0) {
+	if (detections.length >= 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">All Detections</h4>';
 		html += renderDetectionCards(detections);

[NoCoverage] StringLiteral
src/report-ui.js:433:11
 
 	// All Detections
 	if (detections.length > 0) {
-		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">All Detections</h4>';
+		html += "";
 		html += renderDetectionCards(detections);
 	}

[NoCoverage] AssignmentOperator
src/report-ui.js:434:3
 	// All Detections
 	if (detections.length > 0) {
 		html += '<h4 style="margin:20px 0 12px; font-size:14px; color:#9aa0b4;">All Detections</h4>';
-		html += renderDetectionCards(detections);
+		html -= renderDetectionCards(detections);
 	}
 

[NoCoverage] BlockStatement
src/report-ui.js:445:71
  */
 export function setupReportInteractions(reportContainer, detections, onHover, onLeave) {
 	// Toggle section collapse
-	reportContainer.querySelectorAll('.report-header').forEach(header => {
-		header.addEventListener('click', () => {
-			const section = header.dataset.section;
-			const content = reportContainer.querySelector(`.report-content[data-section="${section}"]`);
-			
-			header.classList.toggle('collapsed');
-			content.classList.toggle('hidden');
-		});
-	});
+	reportContainer.querySelectorAll('.report-header').forEach(header => {});
 
 	// Detection card hover interactions

[NoCoverage] StringLiteral
src/report-ui.js:445:35
  */
 export function setupReportInteractions(reportContainer, detections, onHover, onLeave) {
 	// Toggle section collapse
-	reportContainer.querySelectorAll('.report-header').forEach(header => {
+	reportContainer.querySelectorAll("").forEach(header => {
 		header.addEventListener('click', () => {
 			const section = header.dataset.section;

[NoCoverage] BlockStatement
src/report-ui.js:446:42
 export function setupReportInteractions(reportContainer, detections, onHover, onLeave) {
 	// Toggle section collapse
 	reportContainer.querySelectorAll('.report-header').forEach(header => {
-		header.addEventListener('click', () => {
-			const section = header.dataset.section;
-			const content = reportContainer.querySelector(`.report-content[data-section="${section}"]`);
-			
-			header.classList.toggle('collapsed');
-			content.classList.toggle('hidden');
-		});
+		header.addEventListener('click', () => {});
 	});
 

[NoCoverage] StringLiteral
src/report-ui.js:450:28
 			const section = header.dataset.section;
 			const content = reportContainer.querySelector(`.report-content[data-section="${section}"]`);
 			
-			header.classList.toggle('collapsed');
+			header.classList.toggle("");
 			content.classList.toggle('hidden');
 		});

[NoCoverage] BlockStatement
src/report-ui.js:456:74
 	});
 
 	// Detection card hover interactions
-	reportContainer.querySelectorAll('[data-detection-id]').forEach(card => {
-		const detectionId = card.dataset.detectionId;
-		const detection = detections.find(d => d.id === detectionId);
-
-		if (detection) {
-			card.addEventListener('mouseenter', () => {
-				card.classList.add('highlight');
-				onHover(detection);
-			});
-
-			card.addEventListener('mouseleave', () => {
-				card.classList.remove('highlight');
-				onLeave(detection);
-			});
-		}
-	});
+	reportContainer.querySelectorAll('[data-detection-id]').forEach(card => {});
 }
 

[NoCoverage] StringLiteral
src/report-ui.js:456:35
 	});
 
 	// Detection card hover interactions
-	reportContainer.querySelectorAll('[data-detection-id]').forEach(card => {
+	reportContainer.querySelectorAll("").forEach(card => {
 		const detectionId = card.dataset.detectionId;
 		const detection = detections.find(d => d.id === detectionId);

[NoCoverage] ArrowFunction
src/report-ui.js:458:37
 	// Detection card hover interactions
 	reportContainer.querySelectorAll('[data-detection-id]').forEach(card => {
 		const detectionId = card.dataset.detectionId;
-		const detection = detections.find(d => d.id === detectionId);
+		const detection = detections.find(() => undefined);
 
 		if (detection) {

[NoCoverage] ConditionalExpression
src/report-ui.js:458:42
 	// Detection card hover interactions
 	reportContainer.querySelectorAll('[data-detection-id]').forEach(card => {
 		const detectionId = card.dataset.detectionId;
-		const detection = detections.find(d => d.id === detectionId);
+		const detection = detections.find(d => true);
 
 		if (detection) {

[NoCoverage] ConditionalExpression
src/report-ui.js:460:7
 		const detectionId = card.dataset.detectionId;
 		const detection = detections.find(d => d.id === detectionId);
 
-		if (detection) {
+		if (true) {
 			card.addEventListener('mouseenter', () => {
 				card.classList.add('highlight');

[NoCoverage] ConditionalExpression
src/report-ui.js:460:7
 		const detectionId = card.dataset.detectionId;
 		const detection = detections.find(d => d.id === detectionId);
 
-		if (detection) {
+		if (false) {
 			card.addEventListener('mouseenter', () => {
 				card.classList.add('highlight');

[NoCoverage] BlockStatement
src/report-ui.js:461:46
 		const detection = detections.find(d => d.id === detectionId);
 
 		if (detection) {
-			card.addEventListener('mouseenter', () => {
-				card.classList.add('highlight');
-				onHover(detection);
-			});
+			card.addEventListener('mouseenter', () => {});
 
 			card.addEventListener('mouseleave', () => {

[NoCoverage] BlockStatement
src/report-ui.js:466:46
 				onHover(detection);
 			});
 
-			card.addEventListener('mouseleave', () => {
-				card.classList.remove('highlight');
-				onLeave(detection);
-			});
+			card.addEventListener('mouseleave', () => {});
 		}
 	});
