[NoCoverage] StringLiteral
src/report-ui.js:467:27
 			});
 
 			card.addEventListener('mouseleave', () => {
-				card.classList.remove('highlight');
+				card.classList.remove("");
 				onLeave(detection);
 			});
