[Killed] ArrowFunction
src/session.js:125:38
 export function getSessionProgress(session) {
 	const total = session.images.length;
 	const completed = session.images.filter(img => img.status === 'completed').length;
-	const error = session.images.filter(img => img.status === 'error').length;
+	const error = session.images.filter(() => undefined).length;
 	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
 	const queued = session.images.filter(img => img.status === 'queued').length;
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
src/session.js:125:16
 export function getSessionProgress(session) {
 	const total = session.images.length;
 	const completed = session.images.filter(img => img.status === 'completed').length;
-	const error = session.images.filter(img => img.status === 'error').length;
+	const error = session.images.length;
 	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
 	const queued = session.images.filter(img => img.status === 'queued').length;
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 5

[Killed] MethodExpression
src/session.js:126:20
 	const total = session.images.length;
 	const completed = session.images.filter(img => img.status === 'completed').length;
 	const error = session.images.filter(img => img.status === 'error').length;
-	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
+	const analyzing = session.images.length;
 	const queued = session.images.filter(img => img.status === 'queued').length;
 
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 5

[Killed] EqualityOperator
src/session.js:126:49
 	const total = session.images.length;
 	const completed = session.images.filter(img => img.status === 'completed').length;
 	const error = session.images.filter(img => img.status === 'error').length;
-	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
+	const analyzing = session.images.filter(img => img.status !== 'analyzing').length;
 	const queued = session.images.filter(img => img.status === 'queued').length;
 
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Killed] ArrowFunction
src/session.js:127:39
 	const completed = session.images.filter(img => img.status === 'completed').length;
 	const error = session.images.filter(img => img.status === 'error').length;
 	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
-	const queued = session.images.filter(img => img.status === 'queued').length;
+	const queued = session.images.filter(() => undefined).length;
 
 	return {
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
src/session.js:127:17
 	const completed = session.images.filter(img => img.status === 'completed').length;
 	const error = session.images.filter(img => img.status === 'error').length;
 	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
-	const queued = session.images.filter(img => img.status === 'queued').length;
+	const queued = session.images.length;
 
 	return {
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 5

[Killed] ObjectLiteral
src/session.js:129:9
 	const analyzing = session.images.filter(img => img.status === 'analyzing').length;
 	const queued = session.images.filter(img => img.status === 'queued').length;
 
-	return {
-		total,
-		completed,
-		error,
-		analyzing,
-		queued,
-		done: completed + error,
-		percentage: Math.round(((completed + error) / total) * 100)
-	};
+	return {};
 }
 
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/session.js:135:9
 		error,
 		analyzing,
 		queued,
-		done: completed + error,
+		done: completed - error,
 		percentage: Math.round(((completed + error) / total) * 100)
 	};
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/session.js:136:26
 		analyzing,
 		queued,
 		done: completed + error,
-		percentage: Math.round(((completed + error) / total) * 100)
+		percentage: Math.round((completed + error) / total / 100)
 	};
 }
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 0

[Killed] ArithmeticOperator
src/session.js:136:27
 		analyzing,
 		queued,
 		done: completed + error,
-		percentage: Math.round(((completed + error) / total) * 100)
+		percentage: Math.round(((completed + error) * total) * 100)
 	};
 }
killedBy: session getSessionProgress should calculate progress metrics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 1500
