[Killed] BlockStatement
src/math.js:1:36
-export function clamp(n, min, max) {
-	if (!Number.isFinite(n)) return min;
-	return Math.max(min, Math.min(max, n));
-}
+export function clamp(n, min, max) {}
 
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 80,

[Killed] BooleanLiteral
src/math.js:2:6
 export function clamp(n, min, max) {
-	if (!Number.isFinite(n)) return min;
+	if (Number.isFinite(n)) return min;
 	return Math.max(min, Math.min(max, n));
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 80,

[Killed] ConditionalExpression
src/math.js:2:6
 export function clamp(n, min, max) {
-	if (!Number.isFinite(n)) return min;
+	if (true) return min;
 	return Math.max(min, Math.min(max, n));
 }
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 80,

[Killed] MethodExpression
src/math.js:3:23
 export function clamp(n, min, max) {
 	if (!Number.isFinite(n)) return min;
-	return Math.max(min, Math.min(max, n));
+	return Math.max(min, Math.max(max, n));
 }
 
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "height": 40,
    "width": 80,

[Killed] MethodExpression
src/math.js:3:9
 export function clamp(n, min, max) {
 	if (!Number.isFinite(n)) return min;
-	return Math.max(min, Math.min(max, n));
+	return Math.min(min, Math.min(max, n));
 }
 
killedBy: geometry helpers Gemini bbox array format [ymin, xmin, ymax, xmax] toCanvasBox parses Gemini array format and converts to canvas coordinates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "height": 40,
-   "width": 80,
