[Killed] BlockStatement
src/ui-utils.js:10:39
  * @param {string} cat - Category name
  * @returns {string} Hex color code
  */
-export function colorForCategory(cat) {
-	switch (cat) {
-		case 'safety_issue': return '#ff5b5b';
-		case 'facility_asset': return '#5bd1ff';
-		case 'progress': return '#a1ff5b';
-		case 'object': return '#ffd05b';
-		default: return '#cccccc';
-	}
-}
+export function colorForCategory(cat) {}
 
 /**
killedBy: colorForCategory returns correct color for safety_issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ff5b5b"
Received: undefined

[Killed] ConditionalExpression
src/ui-utils.js:12:3
  */
 export function colorForCategory(cat) {
 	switch (cat) {
-		case 'safety_issue': return '#ff5b5b';
+		case 'safety_issue':
 		case 'facility_asset': return '#5bd1ff';
 		case 'progress': return '#a1ff5b';
killedBy: colorForCategory returns correct color for safety_issue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ff5b5b"
Received: "#5bd1ff"

[Killed] ConditionalExpression
src/ui-utils.js:13:3
 export function colorForCategory(cat) {
 	switch (cat) {
 		case 'safety_issue': return '#ff5b5b';
-		case 'facility_asset': return '#5bd1ff';
+		case 'facility_asset':
 		case 'progress': return '#a1ff5b';
 		case 'object': return '#ffd05b';
killedBy: colorForCategory returns correct color for facility_asset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#5bd1ff"
Received: "#a1ff5b"

[Killed] ConditionalExpression
src/ui-utils.js:14:3
 	switch (cat) {
 		case 'safety_issue': return '#ff5b5b';
 		case 'facility_asset': return '#5bd1ff';
-		case 'progress': return '#a1ff5b';
+		case 'progress':
 		case 'object': return '#ffd05b';
 		default: return '#cccccc';
killedBy: colorForCategory returns correct color for progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#a1ff5b"
Received: "#ffd05b"

[Killed] ConditionalExpression
src/ui-utils.js:15:3
 		case 'safety_issue': return '#ff5b5b';
 		case 'facility_asset': return '#5bd1ff';
 		case 'progress': return '#a1ff5b';
-		case 'object': return '#ffd05b';
+		case 'object':
 		default: return '#cccccc';
 	}
killedBy: colorForCategory returns correct color for object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ffd05b"
Received: "#cccccc"

[Killed] StringLiteral
src/ui-utils.js:15:25
 		case 'safety_issue': return '#ff5b5b';
 		case 'facility_asset': return '#5bd1ff';
 		case 'progress': return '#a1ff5b';
-		case 'object': return '#ffd05b';
+		case 'object': return "";
 		default: return '#cccccc';
 	}
killedBy: colorForCategory returns correct color for object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#ffd05b"
Received: ""

[Killed] ConditionalExpression
src/ui-utils.js:16:3
 		case 'facility_asset': return '#5bd1ff';
 		case 'progress': return '#a1ff5b';
 		case 'object': return '#ffd05b';
-		default: return '#cccccc';
+		default:
 	}
 }
killedBy: colorForCategory returns default color for unknown category
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#cccccc"
Received: undefined

[Killed] BlockStatement
src/ui-utils.js:27:47
  * @returns {object} Parsed JSON data
  * @throws {Error} If no text JSON found or JSON is invalid
  */
-export function extractJSONFromResponse(resp) {
-	// Expect JSON as text in first candidate part
-	const c = resp?.candidates?.[0];
-	const parts = c?.content?.parts || [];
-	const textPart = parts.find(p => typeof p.text === 'string');
-	if (!textPart) throw new Error('No text JSON found in response.');
-	// Some responses may wrap JSON in backticks by mistake; strip if needed
-	const raw = textPart.text.trim().replace(/^```json\s*|\s*```$/g, '');
-	return JSON.parse(raw);
-}
+export function extractJSONFromResponse(resp) {}
 
 /**
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"detections": []}
Received: undefined

[Killed] OptionalChaining
src/ui-utils.js:29:12
  */
 export function extractJSONFromResponse(resp) {
 	// Expect JSON as text in first candidate part
-	const c = resp?.candidates?.[0];
+	const c = resp?.candidates[0];
 	const parts = c?.content?.parts || [];
 	const textPart = parts.find(p => typeof p.text === 'string');
killedBy: extractJSONFromResponse throws error when no candidates
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No text JSON found in response."
Received message:   "Cannot read properties of undefined (reading '0')"

      103 |     stryCov_9fa48("1727");
      104 |     // Expect JSON as text in first candidate part
    > 105 |     const c = stryMutAct_9fa48("1729") ? resp.candidates?.[0] : stryMutAct_9fa48("1728") ? resp?.candidates[0] : (st

[Survived] OptionalChaining
src/ui-utils.js:29:12
  */
 export function extractJSONFromResponse(resp) {
 	// Expect JSON as text in first candidate part
-	const c = resp?.candidates?.[0];
+	const c = resp.candidates?.[0];
 	const parts = c?.content?.parts || [];
 	const textPart = parts.find(p => typeof p.text === 'string');

[Killed] ConditionalExpression
src/ui-utils.js:30:16
 export function extractJSONFromResponse(resp) {
 	// Expect JSON as text in first candidate part
 	const c = resp?.candidates?.[0];
-	const parts = c?.content?.parts || [];
+	const parts = false;
 	const textPart = parts.find(p => typeof p.text === 'string');
 	if (!textPart) throw new Error('No text JSON found in response.');
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: TypeError: parts.find is not a function

[Killed] LogicalOperator
src/ui-utils.js:30:16
 export function extractJSONFromResponse(resp) {
 	// Expect JSON as text in first candidate part
 	const c = resp?.candidates?.[0];
-	const parts = c?.content?.parts || [];
+	const parts = c?.content?.parts && [];
 	const textPart = parts.find(p => typeof p.text === 'string');
 	if (!textPart) throw new Error('No text JSON found in response.');
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: No text JSON found in response.

[Killed] EqualityOperator
src/ui-utils.js:31:35
 	// Expect JSON as text in first candidate part
 	const c = resp?.candidates?.[0];
 	const parts = c?.content?.parts || [];
-	const textPart = parts.find(p => typeof p.text === 'string');
+	const textPart = parts.find(p => typeof p.text !== 'string');
 	if (!textPart) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: No text JSON found in response.

[Killed] ConditionalExpression
src/ui-utils.js:31:35
 	// Expect JSON as text in first candidate part
 	const c = resp?.candidates?.[0];
 	const parts = c?.content?.parts || [];
-	const textPart = parts.find(p => typeof p.text === 'string');
+	const textPart = parts.find(p => false);
 	if (!textPart) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: No text JSON found in response.

[Killed] BooleanLiteral
src/ui-utils.js:32:6
 	const c = resp?.candidates?.[0];
 	const parts = c?.content?.parts || [];
 	const textPart = parts.find(p => typeof p.text === 'string');
-	if (!textPart) throw new Error('No text JSON found in response.');
+	if (textPart) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
 	const raw = textPart.text.trim().replace(/^```json\s*|\s*```$/g, '');
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: No text JSON found in response.

[Killed] ConditionalExpression
src/ui-utils.js:32:6
 	const c = resp?.candidates?.[0];
 	const parts = c?.content?.parts || [];
 	const textPart = parts.find(p => typeof p.text === 'string');
-	if (!textPart) throw new Error('No text JSON found in response.');
+	if (true) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
 	const raw = textPart.text.trim().replace(/^```json\s*|\s*```$/g, '');
killedBy: extractJSONFromResponse extracts JSON from valid Gemini response
statusReason: Error: No text JSON found in response.

[Survived] MethodExpression
src/ui-utils.js:34:14
 	const textPart = parts.find(p => typeof p.text === 'string');
 	if (!textPart) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
-	const raw = textPart.text.trim().replace(/^```json\s*|\s*```$/g, '');
+	const raw = textPart.text.replace(/^```json\s*|\s*```$/g, '');
 	return JSON.parse(raw);
 }

[Survived] Regex
src/ui-utils.js:34:43
 	const textPart = parts.find(p => typeof p.text === 'string');
 	if (!textPart) throw new Error('No text JSON found in response.');
 	// Some responses may wrap JSON in backticks by mistake; strip if needed
-	const raw = textPart.text.trim().replace(/^```json\s*|\s*```$/g, '');
+	const raw = textPart.text.trim().replace(/```json\s*|\s*```$/g, '');
 	return JSON.parse(raw);
 }

[Killed] BlockStatement
src/ui-utils.js:45:82
  * @param {number} padding - Padding to subtract from viewport (default: 60)
  * @returns {number} Scale factor (1.0 = no scaling, <1.0 = scale down)
  */
-export function calculateDisplayScale(naturalWidth, viewportWidth, padding = 60) {
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
-		throw new Error('Invalid naturalWidth: must be positive finite number');
-	}
-	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
-		throw new Error('Invalid viewportWidth: must be positive finite number');
-	}
-	if (typeof padding !== 'number' || !Number.isFinite(padding) || padding < 0) {
-		throw new Error('Invalid padding: must be non-negative finite number');
-	}
-	
-	const maxW = Math.min(viewportWidth - padding, naturalWidth);
-	return maxW / naturalWidth;
-}
+export function calculateDisplayScale(naturalWidth, viewportWidth, padding = 60) {}
 
 /**
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/ui-utils.js:46:6
  * @returns {number} Scale factor (1.0 = no scaling, <1.0 = scale down)
  */
 export function calculateDisplayScale(naturalWidth, viewportWidth, padding = 60) {
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
+	if (true) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: Invalid naturalWidth: must be positive finite number

[Killed] BlockStatement
src/ui-utils.js:46:95
  * @returns {number} Scale factor (1.0 = no scaling, <1.0 = scale down)
  */
 export function calculateDisplayScale(naturalWidth, viewportWidth, padding = 60) {
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
-		throw new Error('Invalid naturalWidth: must be positive finite number');
-	}
+	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {}
 	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
 		throw new Error('Invalid viewportWidth: must be positive finite number');
killedBy: calculateDisplayScale throws error for invalid naturalWidth
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid naturalWidth"

Received function did not throw

[Killed] EqualityOperator
src/ui-utils.js:49:6
 	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
-	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
+	if (typeof viewportWidth === 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
 		throw new Error('Invalid viewportWidth: must be positive finite number');
 	}
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: Invalid viewportWidth: must be positive finite number

[Killed] EqualityOperator
src/ui-utils.js:49:78
 	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
-	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
+	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth < 0) {
 		throw new Error('Invalid viewportWidth: must be positive finite number');
 	}
killedBy: calculateDisplayScale throws error for invalid viewportWidth
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid viewportWidth"

Received function did not throw

[Killed] EqualityOperator
src/ui-utils.js:52:66
 	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
 		throw new Error('Invalid viewportWidth: must be positive finite number');
 	}
-	if (typeof padding !== 'number' || !Number.isFinite(padding) || padding < 0) {
+	if (typeof padding !== 'number' || !Number.isFinite(padding) || padding >= 0) {
 		throw new Error('Invalid padding: must be non-negative finite number');
 	}
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: Invalid padding: must be non-negative finite number

[Killed] EqualityOperator
src/ui-utils.js:52:6
 	if (typeof viewportWidth !== 'number' || !Number.isFinite(viewportWidth) || viewportWidth <= 0) {
 		throw new Error('Invalid viewportWidth: must be positive finite number');
 	}
-	if (typeof padding !== 'number' || !Number.isFinite(padding) || padding < 0) {
+	if (typeof padding === 'number' || !Number.isFinite(padding) || padding < 0) {
 		throw new Error('Invalid padding: must be non-negative finite number');
 	}
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: Invalid padding: must be non-negative finite number

[Killed] MethodExpression
src/ui-utils.js:56:15
 		throw new Error('Invalid padding: must be non-negative finite number');
 	}
 	
-	const maxW = Math.min(viewportWidth - padding, naturalWidth);
+	const maxW = Math.max(viewportWidth - padding, naturalWidth);
 	return maxW / naturalWidth;
 }
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2.325

[Killed] ArithmeticOperator
src/ui-utils.js:56:24
 		throw new Error('Invalid padding: must be non-negative finite number');
 	}
 	
-	const maxW = Math.min(viewportWidth - padding, naturalWidth);
+	const maxW = Math.min(viewportWidth + padding, naturalWidth);
 	return maxW / naturalWidth;
 }
killedBy: calculateDisplayScale scales down when image exceeds viewport
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.93
Received: 0.99

[Killed] ArithmeticOperator
src/ui-utils.js:57:9
 	}
 	
 	const maxW = Math.min(viewportWidth - padding, naturalWidth);
-	return maxW / naturalWidth;
+	return maxW * naturalWidth;
 }
 
killedBy: calculateDisplayScale returns 1.0 when image fits within viewport
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 640000

[Killed] BlockStatement
src/ui-utils.js:66:45
  * @param {string} [note] - Optional note to prepend
  * @returns {string} Formatted JSON string
  */
-export function formatJsonOutput(obj, note) {
-	const head = note ? `// ${note}\n` : '';
-	return head + JSON.stringify(obj, null, 2);
-}
+export function formatJsonOutput(obj, note) {}
 
 /**
killedBy: formatJsonOutput formats JSON with pretty printing
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArithmeticOperator
src/ui-utils.js:68:9
  */
 export function formatJsonOutput(obj, note) {
 	const head = note ? `// ${note}\n` : '';
-	return head + JSON.stringify(obj, null, 2);
+	return head - JSON.stringify(obj, null, 2);
 }
 
killedBy: formatJsonOutput formats JSON with pretty printing
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "\"key\": \"value\""
Received number: NaN

[Killed] BlockStatement
src/ui-utils.js:77:51
  * @returns {string} Base64 content without the data URL prefix
  * @throws {Error} If dataUrl format is invalid
  */
-export function extractBase64FromDataUrl(dataUrl) {
-	if (typeof dataUrl !== 'string') {
-		throw new Error('Invalid dataUrl: must be a string');
-	}
-	const parts = dataUrl.split(',');
-	if (parts.length < 2) {
-		throw new Error('Invalid dataUrl format: expected "data:mime;base64,content"');
-	}
-	return parts[1];
-}
+export function extractBase64FromDataUrl(dataUrl) {}
 
 /**
killedBy: extractBase64FromDataUrl extracts base64 content from data URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABC123XYZ"
Received: undefined

[Killed] EqualityOperator
src/ui-utils.js:78:6
  * @throws {Error} If dataUrl format is invalid
  */
 export function extractBase64FromDataUrl(dataUrl) {
-	if (typeof dataUrl !== 'string') {
+	if (typeof dataUrl === 'string') {
 		throw new Error('Invalid dataUrl: must be a string');
 	}
killedBy: extractBase64FromDataUrl extracts base64 content from data URL
statusReason: Error: Invalid dataUrl: must be a string

[Killed] BlockStatement
src/ui-utils.js:78:35
  * @throws {Error} If dataUrl format is invalid
  */
 export function extractBase64FromDataUrl(dataUrl) {
-	if (typeof dataUrl !== 'string') {
-		throw new Error('Invalid dataUrl: must be a string');
-	}
+	if (typeof dataUrl !== 'string') {}
 	const parts = dataUrl.split(',');
 	if (parts.length < 2) {
killedBy: extractBase64FromDataUrl throws error for non-string input
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid dataUrl: must be a string"
Received message:   "dataUrl.split is not a function"

      189 |       }
      190 |     }
    > 191 |     const parts = dataUrl.split(stryMutAct_9fa48("1810") ? "" : (stryCov_9fa48("1810"), ','));

[Killed] StringLiteral
src/ui-utils.js:81:30
 	if (typeof dataUrl !== 'string') {
 		throw new Error('Invalid dataUrl: must be a string');
 	}
-	const parts = dataUrl.split(',');
+	const parts = dataUrl.split("");
 	if (parts.length < 2) {
 		throw new Error('Invalid dataUrl format: expected "data:mime;base64,content"');
killedBy: extractBase64FromDataUrl extracts base64 content from data URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABC123XYZ"
Received: "a"

[Killed] ConditionalExpression
src/ui-utils.js:82:6
 		throw new Error('Invalid dataUrl: must be a string');
 	}
 	const parts = dataUrl.split(',');
-	if (parts.length < 2) {
+	if (true) {
 		throw new Error('Invalid dataUrl format: expected "data:mime;base64,content"');
 	}
killedBy: extractBase64FromDataUrl extracts base64 content from data URL
statusReason: Error: Invalid dataUrl format: expected "data:mime;base64,content"

[Killed] ConditionalExpression
src/ui-utils.js:82:6
 		throw new Error('Invalid dataUrl: must be a string');
 	}
 	const parts = dataUrl.split(',');
-	if (parts.length < 2) {
+	if (false) {
 		throw new Error('Invalid dataUrl format: expected "data:mime;base64,content"');
 	}
killedBy: extractBase64FromDataUrl throws error for invalid format without comma
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid dataUrl format"

Received function did not throw

[Killed] BlockStatement
src/ui-utils.js:96:75
  * @param {number} naturalHeight - Original image height
  * @returns {object} Enhanced detection data with guaranteed image dimensions
  */
-export function prepareDetectionData(parsed, naturalWidth, naturalHeight) {
-	if (!parsed || typeof parsed !== 'object') {
-		throw new Error('Invalid parsed data: must be an object');
-	}
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
-		throw new Error('Invalid naturalWidth: must be positive finite number');
-	}
-	if (typeof naturalHeight !== 'number' || !Number.isFinite(naturalHeight) || naturalHeight <= 0) {
-		throw new Error('Invalid naturalHeight: must be positive finite number');
-	}
-
-	// Fill in image.width/height if missing (helps downstream)
-	if (!parsed.image) parsed.image = {};
-	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
-	if (parsed.image.height == null) parsed.image.height = naturalHeight;
-
-	return parsed;
-}
+export function prepareDetectionData(parsed, naturalWidth, naturalHeight) {}
 
killedBy: prepareDetectionData adds missing image dimensions
statusReason: TypeError: Cannot read properties of undefined (reading 'image')

[Killed] BooleanLiteral
src/ui-utils.js:97:6
  * @returns {object} Enhanced detection data with guaranteed image dimensions
  */
 export function prepareDetectionData(parsed, naturalWidth, naturalHeight) {
-	if (!parsed || typeof parsed !== 'object') {
+	if (parsed || typeof parsed !== 'object') {
 		throw new Error('Invalid parsed data: must be an object');
 	}
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: Invalid parsed data: must be an object

[Killed] EqualityOperator
src/ui-utils.js:97:17
  * @returns {object} Enhanced detection data with guaranteed image dimensions
  */
 export function prepareDetectionData(parsed, naturalWidth, naturalHeight) {
-	if (!parsed || typeof parsed !== 'object') {
+	if (!parsed || typeof parsed === 'object') {
 		throw new Error('Invalid parsed data: must be an object');
 	}
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: Invalid parsed data: must be an object

[Killed] LogicalOperator
src/ui-utils.js:100:6
 	if (!parsed || typeof parsed !== 'object') {
 		throw new Error('Invalid parsed data: must be an object');
 	}
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
+	if (typeof naturalWidth !== 'number' && !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
killedBy: prepareDetectionData throws error for invalid naturalWidth
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid naturalWidth"

Received function did not throw

[Killed] BooleanLiteral
src/ui-utils.js:100:42
 	if (!parsed || typeof parsed !== 'object') {
 		throw new Error('Invalid parsed data: must be an object');
 	}
-	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
+	if (typeof naturalWidth !== 'number' || Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: Invalid naturalWidth: must be positive finite number

[Killed] StringLiteral
src/ui-utils.js:101:19
 		throw new Error('Invalid parsed data: must be an object');
 	}
 	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
-		throw new Error('Invalid naturalWidth: must be positive finite number');
+		throw new Error("");
 	}
 	if (typeof naturalHeight !== 'number' || !Number.isFinite(naturalHeight) || naturalHeight <= 0) {
killedBy: prepareDetectionData throws error for invalid naturalWidth
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid naturalWidth"
Received message:   ""

      228 |       } else {
      229 |         stryCov_9fa48("1839");
    > 230 |         throw new Error(stryMutAct_9fa48("1840") ? "" : (stryCov_9fa48("1840"), 'Invalid naturalWidth: must be positive finite number'));

[Killed] EqualityOperator
src/ui-utils.js:103:6
 	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
-	if (typeof naturalHeight !== 'number' || !Number.isFinite(naturalHeight) || naturalHeight <= 0) {
+	if (typeof naturalHeight === 'number' || !Number.isFinite(naturalHeight) || naturalHeight <= 0) {
 		throw new Error('Invalid naturalHeight: must be positive finite number');
 	}
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: Invalid naturalHeight: must be positive finite number

[Killed] EqualityOperator
src/ui-utils.js:103:78
 	if (typeof naturalWidth !== 'number' || !Number.isFinite(naturalWidth) || naturalWidth <= 0) {
 		throw new Error('Invalid naturalWidth: must be positive finite number');
 	}
-	if (typeof naturalHeight !== 'number' || !Number.isFinite(naturalHeight) || naturalHeight <= 0) {
+	if (typeof naturalHeight !== 'number' || !Number.isFinite(naturalHeight) || naturalHeight > 0) {
 		throw new Error('Invalid naturalHeight: must be positive finite number');
 	}
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: Invalid naturalHeight: must be positive finite number

[Killed] BooleanLiteral
src/ui-utils.js:108:6
 	}
 
 	// Fill in image.width/height if missing (helps downstream)
-	if (!parsed.image) parsed.image = {};
+	if (parsed.image) parsed.image = {};
 	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
 	if (parsed.image.height == null) parsed.image.height = naturalHeight;
killedBy: prepareDetectionData adds missing image dimensions
statusReason: TypeError: Cannot read properties of undefined (reading 'width')

[Killed] ConditionalExpression
src/ui-utils.js:108:6
 	}
 
 	// Fill in image.width/height if missing (helps downstream)
-	if (!parsed.image) parsed.image = {};
+	if (false) parsed.image = {};
 	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
 	if (parsed.image.height == null) parsed.image.height = naturalHeight;
killedBy: prepareDetectionData adds missing image dimensions
statusReason: TypeError: Cannot read properties of undefined (reading 'width')

[Killed] EqualityOperator
src/ui-utils.js:109:6
 
 	// Fill in image.width/height if missing (helps downstream)
 	if (!parsed.image) parsed.image = {};
-	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
+	if (parsed.image.width != null)  parsed.image.width  = naturalWidth;
 	if (parsed.image.height == null) parsed.image.height = naturalHeight;
 
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1920
Received: undefined

[Killed] ConditionalExpression
src/ui-utils.js:109:6
 
 	// Fill in image.width/height if missing (helps downstream)
 	if (!parsed.image) parsed.image = {};
-	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
+	if (true)  parsed.image.width  = naturalWidth;
 	if (parsed.image.height == null) parsed.image.height = naturalHeight;
 
killedBy: prepareDetectionData preserves existing image dimensions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 800
Received: 1920

[Killed] ConditionalExpression
src/ui-utils.js:110:6
 	// Fill in image.width/height if missing (helps downstream)
 	if (!parsed.image) parsed.image = {};
 	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
-	if (parsed.image.height == null) parsed.image.height = naturalHeight;
+	if (true) parsed.image.height = naturalHeight;
 
 	return parsed;
killedBy: prepareDetectionData preserves existing image dimensions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600
Received: 1080

[Killed] EqualityOperator
src/ui-utils.js:110:6
 	// Fill in image.width/height if missing (helps downstream)
 	if (!parsed.image) parsed.image = {};
 	if (parsed.image.width == null)  parsed.image.width  = naturalWidth;
-	if (parsed.image.height == null) parsed.image.height = naturalHeight;
+	if (parsed.image.height != null) parsed.image.height = naturalHeight;
 
 	return parsed;
killedBy: prepareDetectionData adds missing image dimensions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1080
Received: undefined
